{"title":"Hentai / Demon Beast Invasion (eng)  flv.","uid":6303603,"size":2092822413,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:00770e16253550ebded0a6bf392dc0f81918c315&amp;dn=Hentai+%2F+Demon+Beast+Invasion+%28eng%29++flv.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimevjr","files":7,"time":1302249704,"description":"Earth is being invaded by a race of unclean beasts who wish to take over the planet. \nHowever, since Earth's environment is hostile to the demons they hatch a plan to \nimpregnate as many human females as possible in order to create a race of human/demon \nhybrids which will rule the Earth by proxy. But the &quot;Interplanetary Mutual Observation \nAgency&quot; sends a duo of enforcers to Earth to hunt down and destroy the alien race they \ncall the 'demon beasts'.\n\nvolume 1\n\nIt's hungry for vengeance. She's hungry for more! One hundred million years \nago, an ecological disaster drove the Demon Beasts from our world. Now, they \nmust breed with human females to create a new, hybrid creature, who will \nclear the way for an invading horde. When Kayo is raped by a possessed \nlover, it's up to Interplanetary Mutual Observation Agent Muneto to save \nher from the terrifying creature to which she gives birth: a mutant, \nlust-driven Demon Beast! \n\nvolume 2\n\nKayo's demonic offspring lives and plots a diabolical family reunion with \nits otherworldly brethren! The Interplanetary Observation Agency dispatches \na trio of beautiful female warriors to slay the invaders. But they're way \nout of their league, and the demon beasts will have their revenge... and a \nlittle lecherous fun! \n\nvolume 3\n\nTerror... Treachery... and TENTACLES! Something evil slithers through \nthe Hong Kong underworld, seeking warm flesh and new victims. Many have \nalready succumbed to its perverse charms. But the Deamon Beast hungers \nfor more than just blood - it wants a human woman to possess - body and soul! \n\n","torrent":{"xt":"urn:btih:00770e16253550ebded0a6bf392dc0f81918c315","amp;dn":"Hentai+%2F+Demon+Beast+Invasion+%28eng%29++flv.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00770e16253550ebded0a6bf392dc0f81918c315","infoHashBuffer":{"type":"Buffer","data":[0,119,14,22,37,53,80,235,222,208,166,191,57,45,192,248,25,24,195,21]},"announce":[],"urlList":[]}}