{"title":"Information Wars   2011 03 28   Aljazeera Empire ","uid":6289259,"size":616606670,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:019a74af58496667511f684289f0d2d83499518e&amp;dn=Information+Wars+++2011+03+28+++Aljazeera+Empire+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1301738422,"description":"Information Wars   2011 03 28   Aljazeera Empire \n\n\n588mb/47mns/avi\n\n\nHow will governments deal with the information revolution?\n\nNew media, from WikiLeaks to Facebook, Twitter to YouTube, is persistently challenging the traditional flow of information, and cyber disobedience is exposing powerful governments.\n\nWebsites are now being treated like hostile territories; whistleblowers and leakers as terrorists, and hackers as insurgents.\n\nGovernments are scrambling to salvage their influence and take advantage of the new cyber and satellite media. From China to the Sudan, Egypt to Iran, despots and armies are tracking web activity and setting up Facebook accounts to spy on their citizens.\n\nSo is this the century of free information and expression as the cyber utopians predicted, or new methods of electronic oppression as the cyber sceptics warned?\n\nJoining Marwan Bishara to discuss these issues are: Carl Bernstein, a Pulitzer Prize-winning investigative journalist; Amy Goodman, the host and executive producer of Democracy Now!; Professor Emily Bell, the director of digital journalism at Columbia University; Evgeny Morozov, the author of The Net Delusion: The Dark Side of Internet Freedom; Professor Clay Shirky, the author of Cognitive Surplus: Creativity and Generosity in a Connected Age.\n\nOur interviewees are: Daniel Ellsberg, the Pentagon Papers whistleblower; Charlie Beckett, the director of Polis at London School of Economics; Jeremy Goldkorn, the founder of Danwei.org, and Pink Ke, the co-founder of antiwave.net.\n\nFLV:http://english.aljazeera.net/programmes/empire/2011/02/201128144711422264.html\n\n\nOther shunster posts","torrent":{"xt":"urn:btih:019a74af58496667511f684289f0d2d83499518e","amp;dn":"Information+Wars+++2011+03+28+++Aljazeera+Empire+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"019a74af58496667511f684289f0d2d83499518e","infoHashBuffer":{"type":"Buffer","data":[1,154,116,175,88,73,102,103,81,31,104,66,137,240,210,216,52,153,81,142]},"announce":[],"urlList":[]}}