{"title":"Democracy Now - 09 feb 2011","uid":6162974,"size":453727384,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:03fff949abd81c1cb39f442a167dcb25ee7108af&amp;dn=Democracy+Now+-+09+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1297278392,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 09, 2011\n\n- Egyptian Protests Spread Following Record-Level Turnout\n- White House Urges End to Egyptian Gov't Crackdown\n- Obama Expected to Maintain U.S. Aid to Egyptian Regime\n- GOP Dealt Setback With Temporary PATRIOT Act Defeat\n- Assange Attorneys Challenge Swedish Prosecutor to Testify\n- Cables: Despite No Evidence, Yemen Continued Jailing Prisoners at U.S. Behest\n- Blackwater Appeal to Be Closed to Public\n- Pakistan Jails U.S. Consular Worker Over Shooting Deaths\n- Haiti Issues Passport to Aristide\n- ACLU Observer Alleges Beating at L.A. Prison\n\n\nSpecial reports\n\n- After Record-Level Turnout in Tahrir, Egyptian Protests Spread to Parliament, Cabinet Buildings; Labor Unions Launch Strikes Nationwide\n\nEgypt's pro-democracy uprising is seizing new momentum one day after hundreds of thousands turned out for one of the largest protests in Cairo's Tahrir Square to date. A gathering of protesters led to the evacuation of the Egyptian cabinet building today, and tent camps are also being set up outside the Egyptian parliament. Egypt's labor movement has launched new strikes across the country, with an estimated 10,000 workers taking part. Democracy Now! Senior Producer Sharif Abdel Kouddous interviews a demonstrator outside the Egyptian parliament building.\n\n- &quot;We Are Writing History By Our Blood&quot;: Egyptian Physician on Why Protests Won't End Until Mubarak Resigns\n\nDemocracy Now! Senior Producer Sharif Abdel Kouddous speaks to Egyptian physician Dr. Ali El Mashad in Cairo's Tahrir square over the weekend. Dr. Mashad describes being injured in the streets and bleeding from the head. &quot;We are writing history by our blood,&quot; he says. Mashad says he will not stop demonstrating until Mubarak leaves office.\n\n\n- Human Rights Watch: 300 Deaths, Massive Detentions and Abuse Under Mubarak Regime Crackdown\n\nHuman Rights Watch is reporting that at least 302 people have died in Egypt since pro-Mubarak forces launched a violent response to the popular uprising last month. The group says at least 232 people have died in Cairo, 52 in Alexandria, and 18 in Suez, but warns the actual death toll could be far higher. We speak with Human Rights Watch researcher Heba Morayef, who has been monitoring the situation on the ground since the protests began.\n\n\n- &quot;People Are Taking Care of Each Other&quot;: Democracy Now!'s Anjali Kamat Camps With Protesters Overnight in Tahrir Square\n\nDemocracy Now! correspondent Anjali Kamat reports on the festive atmosphere in Tahrir Square last night following a record-level turnout of protesters: &quot;People are taking care of each other very well, giving each other food, water and blankets. It is a very moving experience,&quot; Kamat says.\n\n\n- &quot;The Great Tragedy is Obama Chose Not to Hold Out His Hand&quot;: Robert Fisk on the Gap Between U.S. Rhetoric and Action in Egyptian Uprising\n\nThe longtime Middle East correspondent of The Independent newspaper in London joins us from Cairo to talk about the popular uprising ongoing across Egypt, its regional implications, and how Obama should respond. &quot;[The protesters] are asking for nothing less than Americans expect in their own lives,&quot; Fisk says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:03fff949abd81c1cb39f442a167dcb25ee7108af","amp;dn":"Democracy+Now+-+09+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03fff949abd81c1cb39f442a167dcb25ee7108af","infoHashBuffer":{"type":"Buffer","data":[3,255,249,73,171,216,28,28,179,159,68,42,22,125,203,37,238,113,8,175]},"announce":[],"urlList":[]}}