{"title":"coast to coast 2011-02-19 - Inside Iran","uid":6190400,"size":57559424,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:045c7788feef640f898693faf7496e3b1f77966d&amp;dn=coast+to+coast+2011-02-19+-+Inside+Iran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1298259452,"description":"\nInside Iran\n-----------\nDate: 02-19-2011\nHost: Ian Punnett\n\nGuests: S. Mostofi, Daniel O'Brien, Michael Swaim\n\n\nIranian novelist and women's rights advocate S. Mostofi joined Ian Punnett for a discussion about what life is like under Iranian law as well as what she thinks really happened during a failed US rescue attempt of 52 American hostages in Iran in 1980. &quot;In Iran, nothing is bizarre anymore,&quot; Mostofi declared, &quot;people have seen it all, at this point, and they're really sick of it.&quot; She was hopeful that the current regime in Iran would fall by the end of the year, but expressed concern because the Iranian government is &quot;extremely violent.&quot; Mostofi noted that, unlike the Egyptian leadership, the leaders of Iran &quot;would not be welcomed into the international community&quot; should they be deposed and, thus, must tenaciously hold on to their power.\n\nMostofi, who fled Iran in 1990 when she was a teenager, described some of the troubling aspects of life in the country under the current regime. She explained that, in Iranian court, when a woman testifies, it only carries the weight of half of a man's testimony. Additionally, she noted that although women constitute 60% of the university graduates in Iran and hold jobs like physicians and engineers, they are still barred from getting a divorce or leaving the country without their husband's permission. Mostofi also shared the stunning statistic that, so far this year, the Iranian government has been executing one person every eight hours. Despite the Iranian government's claims that those executed are drug dealers, Mostofi contended that a lot of the victims are actually people who have protested against the regime.\n\nRegarding the 1980 hostage rescue mission, dubbed Operation Eagle Claw, Mostofi revealed information that came from members of the Iranian military who had been working with the CIA during the operation. According to these sources, the mission aimed not just to rescue the hostages, but also to spawn an overthrow of the recently formed Islamic regime that had taken over Iran. In contrast to the official story, which says that the mission failed to due sand storms, Mostofi contended that the Russians, who were in Afghanistan at the time, fired a missile at the American staging area and foiled the rescue operation. The missile, she said, is what took out the helicopter, resulting in the death of eight Americans. &quot;I have no way to verify this, personally,&quot; she conceded, &quot;but this is from Iranian sources who claim to have been there when it happened.&quot;\n\nYou Might Be a Zombie:\nAppearing during the first half-hour, comedy writers for Cracked.com, Dan O' Brien and Michael Swaim talked about their book You Might be a Zombie and Other Bad News. They joked that, in light of the &quot;uptrend in pop culture&quot; for zombies, a Twilight-esque film with zombies as the paramours is probably inevitable. On why one might be a zombie, they revealed that a parasite, that has been shown to control the bodily functions of animals, can be found in over half the human population. Additionally, they suggested that nanotechnology could eventually be used to create real zombies, since tiny robots could enter the brain of a corpse and control its limbs.\n\nWebsites:\nsmostofi.com\ncracked.com\n\nBooks:\nCemetery of Dreams\nYou Might be a Zombie and Other Bad News\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:045c7788feef640f898693faf7496e3b1f77966d","amp;dn":"coast+to+coast+2011-02-19+-+Inside+Iran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045c7788feef640f898693faf7496e3b1f77966d","infoHashBuffer":{"type":"Buffer","data":[4,92,119,136,254,239,100,15,137,134,147,250,247,73,110,59,31,119,150,109]},"announce":[],"urlList":[]}}