{"title":"Rooms.The.Main.Building.BY.JKIRLIN","uid":6183289,"size":17101584,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:05338655a066df7dae7684c11c1efb378292a923&amp;dn=Rooms.The.Main.Building.BY.JKIRLIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gaditano_cc","files":2,"time":1298029247,"description":"[color=red][size=18]Rooms.The.Main.Building[/size][/color]\n\n[color=orange][size=18]Trailer[/size][/color]\n\n\n[color=orange][size=18]Capturas[/size][/color]\n\n[color=orange][size=18]Sipnosis[/size][/color]\nHudson nos muestra una historia en forma de puzzle, en la que para avanzar, deberemos ajustar el mundo en el que nos encontramos para poder escapar de allÃƒÂ­. \nTras recibir una intrigante carta que aparece en la puerta de nuestra casa, una misteriosa fuerza nos transporta a un mundo repleto de enigmÃƒÂ¡ticas y desordenadas habitaciones en las que deberemos encontrar la manera de escapar de cada una de ellas para abandonar el agobiante escenario en el que hemos sido arrastrados. Nuestro nombre, Mr. X \nSin embargo no estaremos solos en la aventura ya que Mr. Book (como vemos, no se han roto los sesos a la hora de bautizar a los personajes) nos ayudarÃƒÂ¡ a escapar de Rooms dÃƒÂ¡ndonos pistas y consejos, ademÃƒÂ¡s de un instructivo tutorial al comienzo del juego. \n\nJugabilidad \nPodremos elegir entre dos modalidades de juego:\n- Modo historia, en el que avanzaremos por las diferentes Rooms, tratando de desvelar ese mundo e intentando conseguir la manera de abrir un cofre somnoliento que parece resguardar algo interesante. Nos ayudaremos de los objetos que nos encontremos en las diferentes partes del escenario para avanzar, desde escaleras que nos permiten subir al piso anterior, a telÃƒÂ©fonos que nos teletransportarÃƒÂ¡n, haciendo un guiÃƒÂ±o a la archiconocida saga de Matriz. \n- Modo desafÃƒÂ­o, en el que jugaremos con ciertras restricciones que aumentan la dificultad de cada nivel, como el nÃƒÂºmero de veces que puedes mover las habitaciones o un lÃƒÂ­mite de tiempo para escapar. \nAsÃƒÂ­ mismo, nos encontraremos con un editor de escenarios, donde podremos crear nuestros propios mundos y guardar hasta un total de diez de los mismos. \nContaremos con un total de cuatro mansiones a desbloquear, con 20 habitaciones en cada una y una mansiÃƒÂ³n extra. El nivel de dificultad irÃƒÂ¡ aumentando progresivamente a medida que avancemos en la historia. \nLa mecÃƒÂ¡nica del juego es muy sencilla, tendremos un puzzle desordenado, con un hueco vacÃƒÂ­o en el cual podremos arrastrar las habitaciones para ir ordenÃƒÂ¡ndolo siempre y cuando nos encontremos dentro de ella. Conseguiremos escapar de ella cuando la imagen de fondo quede colocada en el orden adecuado. \nSin embargo, a medida que avanzamos en niveles, podemos encontrarnos dificultades, como habitaciones con trampas que si accedemos a ellas pereceremos. \nEl punto dÃƒÂ©bil del juego es sin duda la fluidez de juego. Nuestro personaje tiene unas animaciones desesperantemente lentas y cuando queremos que use un objeto determinado del escenario, a veces tendremos que indicarlo varias veces ya que no lo utiliza a la primera, algo que no plantea mucho inconveniente en el modo historia, pero que puede hacer que perdamos una partida en el modo desafÃƒÂ­o. \n\nGrÃƒÂ¡ficos y Sonido \nLos grÃƒÂ¡ficos no son nada del otro mundo, tÃƒÂ©tricos ya que representan ciudades nocturnas con callejones deshabitados. En cualquier caso crean una ambientaciÃƒÂ³n lo suficientemente claustrofÃƒÂ³bica como para darnos ganas de escapar de allÃƒÂ­ cuanto antes. \nEl apartado sonoro es muy adecuado para el tipo de juego que nos encontramos aunque como casi todos los de ÃƒÂ©sta plataforma, puede llegar a ser un poco repetitivo. \n\nConclusiones \nTenemos ante nosotros un juego entretenido que aunque en ocasiones se vuelva repetitivo, a medida que avancemos vamos a encontrar nuevos objetos y retos que amenizarÃƒÂ¡n el desarrollo de un juego cuya historia podrÃƒÂ­a haber dado mucho mÃƒÂ¡s de sÃƒÂ­. \n \n \n\n","torrent":{"xt":"urn:btih:05338655a066df7dae7684c11c1efb378292a923","amp;dn":"Rooms.The.Main.Building.BY.JKIRLIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05338655a066df7dae7684c11c1efb378292a923","infoHashBuffer":{"type":"Buffer","data":[5,51,134,85,160,102,223,125,174,118,132,193,28,30,251,55,130,146,169,35]},"announce":[],"urlList":[]}}