{"title":"(Blues VA)  My Rough And Rowdy Ways (2CDs)","uid":6138508,"size":338592574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:053df07697ac453235f35ff99ec4e6c721b22956&amp;dn=%28Blues+VA%29++My+Rough+And+Rowdy+Ways+%282CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1296405593,"description":"CD1:\n\nAlbum: My Rough And Rowdy Ways Vol.1 \nBitrate: 320K/s \nTime: 72:06 \nSize: 165.0 MB \nLabel: Yazoo\nStyles: Country blues, Old-timey, Pre-war country blues\nYear: 1998\nArt: Front \n\n[2:56] 1. Grant Brothers - Tell It To Me\n[2:51] 2. Clarence Ashley - Little Sadie\n[3:17] 3. Clifford Gibson - Bad Luck Dice\n[3:12] 4. Jilson Setters - Way Up On Clinch Mountain\n[2:59] 5. Dykes Magic City Trio - Frankie\n[3:39] 6. Tommy Johnson - Canned Heat Blues\n[2:57] 7. Ray Brothers - Got The Jake Leg Too\n[3:01] 8. Dock Boggs - Country Blues\n[3:12] 9. 'Little Hat' Jones - Kentucky Blues\n[2:49] 10. Allen Brothers - Prisoner's Dream\n[2:58] 11. Sweet Brothers/Ernest Stoneman - John Hardy\n[3:25] 12. Will Shade - Better Leave That Stuff Alone\n[2:59] 13. Uncle Dave Macon/Sam McGee - Way Down The Old Plank Road\n[3:13] 14. Ernest Stoneman/Kahle Brewer - The Fate Of Talmedge Osborn\n[3:11] 15. Cannon's Jug Stompers - Viola Lee Blues\n[3:05] 16. Cleve Chaffin/The McClung Brothers - Rock House Gamblers\n[3:30] 17. Willie Walker - Dupree Blues\n[3:00] 18. Haywood County Ramblers - All Bound Down\n[3:16] 19. Peg Leg Howell - Low Down Rounder Blues\n[3:17] 20. Fruit Jar Guzzlers - Stack-O-Lee\n[2:50] 21. Barefoot Bill - My Crime Blues\n[3:28] 22. Ken Maynard - Jesse James\n[2:51] 23. Watts &amp; Wilson - Chain Gang Special\n\n\nA disc of classic recordings is a rarity, but that's exactly what this is. Some of the performers are well known people, like Clarence Ashley, Dock Boggs, Uncle Dave Macon, and Tommy Johnson. Others, like the Haywood County Ramblers, are far from household names, but that doesn't mean their songs are lesser creations. And these ballads of bad men, hell raisers, violence, and drinking are the stuff of legends, like &quot;Frankie&quot; by the Dykes Magic City Trio, a version of &quot;Frankie and Johnny&quot; by a group reminiscent of the Carter Family. It's interesting that the performers on these songs from the '20s and '30s are both black and white, and the music sounds remarkably similar -- a clear indication that prejudice didn't extend everywhere at the time, and that music was colorblind. From a time when American rural song was still a strong musical force -- before Tin Pan Alley and commercialization had changed everything -- &quot;Little Sadie&quot; and &quot;Viola Lee Blues&quot; come across the years with complete crispness, while the banjo style of Dock Boggs can be heard as an influence on so many who followed. But these pieces also come from the cusp, when urban culture was about to take over, and songs like the Allen Brothers' &quot;Prisoner's Dream&quot; would be replaced by other tunes. In fact, the one piece here that offers any kind of continuity is a version of &quot;Stack-O-Lee&quot; from the Fruit Jar Guzzlers, although their version seems hopelessly naÃƒÂ¯ve and country compared to others that would come later. This is, as it's meant to be, a collection that's very much of its place and time. But since they both represent a crossroad, it's a great place and perfect time in the development of American music. \n\n-----------------------------------------------------------------------------------\n\nCD2:\n\nAlbum: My Rough And Rowdy Ways Vol. 2 \nBitrate: 320K/s \nTime: 68:44 \nSize: 157.4 MB \nLabel: Yazoo\nStyles: Country blues, Old-timey, Pre-war country blues, Field Recordings\nYear: 1998 \nArt: Front \n\n[3:07] 1. Dick Justice - Cocaine\n[3:12] 2. The Carolina Buddies - Otto Wood The Bandit\n[3:24] 3. Mississippi John Hurt - Frankie\n[2:40] 4. Uncle Dave Macon - Railroadin' And Gamblin'\n[2:49] 5. David Miller - That Bad Man Stackolee\n[2:59] 6. Sloppy Henry - Canned Heat Blues\n[3:02] 7. Earl Johnson &amp; His Dixie Entertainers - Ain't Nobody's Business\n[3:07] 8. Peg Leg Howell - Skin Game Blues\n[3:02] 9. Uncle Dave Macon &amp; Sam McGee - Late Last Night When Willie Came Home\n[2:49] 10. Bob Campbell - Dice's Blues\n[3:13] 11. Haskell Wolfenbarger - Sailing Out On The Ocean\n[2:49] 12. Hickory Nuts - Louisville Burglar\n[2:54] 13. Robert Wilkins - Old Jim Canan's\n[3:01] 14. Vernon Dalhart - Billy The Kid\n[3:11] 15. Georgia Crackers - Georgia Black Bottom\n[3:06] 16. Emry Arthur - Ethan Lang\n[2:18] 17. Hall Brothers - Wrong Road\n[3:24] 18. Eva Davis - Wild Bill Jones\n[3:41] 19. Lee Green - Bad Man Napper\n[3:02] 20. George Reneau - Jesse James\n[2:30] 21. Bill Cox - My Rough And Rowdy Ways\n[2:43] 22. Bill Broonzy - Good Liquor Gonna Carry Me Down\n[2:30] 23. Garland Jubilee Singers - This Train\n\n\nMy Rough and Rowdy Ways, Vol. 2 features 23 songs from the '30s about badmen and hellraisers, by artists ranging from legends like Uncle Dave Macon, Mississippi John Hurt, and Big Bill Broonzy to obscure music pioneers like George Reneau and groups like the Haywood County Ramblers. The mix of white, country, and black, blues artists is one of the better in this series, the music meshing together to form a kind of audio panorama of story-songs dealing with life on the far side of law and order -- &quot;Otto Wood the Bandit&quot; by the Carolina Buddies, (aka Odell Smith [fiddle] and Norman Woodlief [guitar]), segues into Mississippi John Hurt's &quot;Frankie,&quot; followed by Uncle Dave Macon's rip-roaring banjo workout &quot;Railroadin' and Gamblin'&quot; (anyone seeking a track that defines Macon's claw-hammer style of banjo playing need look no further than this cut). \n\nAmong the too little heard bluesmen featured here are Sloppy Henry (&quot;Canned Heat Blues&quot;) and Peg Leg Howell (&quot;Skin Game Blues&quot;), who also plays on Henry's cut, and Robert Wilkins, whose &quot;Old Jim Canan's&quot; features a superb guitar duet between the singer and Little Son Joe, later the husband of Memphis Minnie. Country highlights include Georgia based fiddle wildman Earl Johnson (&quot;Nobody's Business&quot;) and George Reneau's &quot;Jesse James,&quot; which features singing by future star crooner Gene Austin. Yazoo has done a generally good job of remastering these cuts, so the sound on most of it (David Miller's &quot;That Bad Man Stackolee&quot; and Uncle Dave Macon's &quot;Late Last Night When Willie Come Home&quot; are the big exceptions) holds together at a decent volume without any excessive artificial processing or distracting noise. ","torrent":{"xt":"urn:btih:053df07697ac453235f35ff99ec4e6c721b22956","amp;dn":"%28Blues+VA%29++My+Rough+And+Rowdy+Ways+%282CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053df07697ac453235f35ff99ec4e6c721b22956","infoHashBuffer":{"type":"Buffer","data":[5,61,240,118,151,172,69,50,53,243,95,249,158,196,230,199,33,178,41,86]},"announce":[],"urlList":[]}}