{"title":"Nazi Gold - Publishing the Third Reich (BBC Radio 4 documentary)","uid":6260122,"size":13125620,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0566356f7235195698f684915f0c1da009333e22&amp;dn=Nazi+Gold+-+Publishing+the+Third+Reich+%28BBC+Radio+4+documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fakeplastictrousers2","files":-1,"time":1300721861,"description":"Nazi Gold - Publishing the Third Reich\n\nWhy are books about the Third Reich such an ongoing publishing phenomenon in the UK....and what does it say about us?\n\nAccording to trade magazine The Bookseller, there were no less than 850 new titles about the Third Reich published in the UK in 2010 (up from 380 in 2000 -.that's more than double in ten years). These join the thousands already available on Amazon covering everything from Hitler and the occult to SS uniforms and the teaspoons of the Third Reich; from Nazi bunkers and secret weapons to the regime's interest in flying saucers, the lives of the Fuhrer's personal pilots and (our favourite) 'How Astrology Guided Hitler's Germany'.\n\nAnd there's no sign the market has become saturated, far from it: Hitler and his regime are known in the British publishing business as 'The gift that keeps on giving'. Interestingly, book sales in the UK on subjects relating to Nazism are not matched, in relative terms, by any other country in the world. So really: what does all this say about us, the reading public? This feature - with shades of light and dark - examines an ongoing, national publishing phenomenon, talking to authors and agents, historians, Nazi thriller writers and publishers among others.\n\nGuests also include the comedian David Mitchell, Laurence Rees, Guy Walters and Henry Stevens, author of 'Hitler's Flying Saucers'.\n\nPresenter: Clive Anderson\nProducer: Simon Hollis\nA Brook Lapping production for BBC Radio 4.","torrent":{"xt":"urn:btih:0566356f7235195698f684915f0c1da009333e22","amp;dn":"Nazi+Gold+-+Publishing+the+Third+Reich+%28BBC+Radio+4+documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0566356f7235195698f684915f0c1da009333e22","infoHashBuffer":{"type":"Buffer","data":[5,102,53,111,114,53,25,86,152,246,132,145,95,12,29,160,9,51,62,34]},"announce":[],"urlList":[]}}