{"title":"MaÃƒÂ±ana cuando la guerra empieze [BR-Screener][Spanish][www.cons","uid":6221763,"size":2925113344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07c2b3f7f5758116611f6b9a40c81708e17f1c79&amp;dn=Ma%C3%83%C2%B1ana+cuando+la+guerra+empieze+%5BBR-Screener%5D%5BSpanish%5D%5Bwww.cons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":1,"time":1299354232,"description":"Harta de ayudar a sus padres en las tareas del campo, Ellie Linton (Caitlin Stasey), de 17 aÃƒÂ±os, decide vivir una ÃƒÂºltima aventura antes de que acaben las vacaciones de verano: una acampada en un valle paradisÃƒÂ­aco que supuestamente se encuentra en una zona de densa maleza, a la que los vecinos se refieren con el poco halagÃƒÂ¼eÃƒÂ±o nombre de Ã‚Â«El InfiernoÃ‚Â». \n\nTras conseguir que sus padres le presten el Land Rover, Ellie recoge a sus compaÃƒÂ±eros de instituto, que la acompaÃƒÂ±an en su aventura: su mejor amiga, Corrie McKenzie (Rachel Hurd-Wood) y su cariÃƒÂ±oso y atlÃƒÂ©tico novio, Kevin Holmes (Lincoln Lewis); la tÃƒÂ­mida belleza Fiona Maxwell (Phoebe Tonkin); el camorrista Homer Yannos (Deniz Akdeniz); la puritana Robyn Mathers (Ashleigh Cummings), y Lee Takkam (Chris Pang), cuyos padres regentan el restaurante tailandÃƒÂ©s del pueblo, Wirrawee. \n\nAl llegar a su destino, el grupo descubre que el lugar no tiene nada de infernal. Muy al contrario, es un exuberante e idÃƒÂ­lico paraÃƒÂ­so oculto, con un arroyo y una cascada: el lugar perfecto para que florezcan la amistad y el amor. Durante la semana que dura su acampada, el resto del mundo parece un recuerdo lejano para los chicos... hasta que de repente aparecen en el cielo nocturno varias escuadrillas de aviones volando bajo. \n\nAl volver al pueblo, los siete jÃƒÂ³venes descubren que algo grave sucede: en las casas no hay electricidad, el ganado y las mascotas han muerto o estÃƒÂ¡n agonizantes y, lo peor de todo, sus familias han desaparecido. \n\nCon la sensaciÃƒÂ³n de que un peligro invisible se cierne sobre ellos, los amigos se separan para buscar pistas sobre lo que estÃƒÂ¡ sucediendo. Ellie, Corrie y Kevin hacen un descubrimiento impactante: el recinto ferial ha sido convertido en un campo de prisioneros y todo el pueblo se encuentra preso de una fuerza militar desconocida. \n\nCuando el ejÃƒÂ©rcito hostil se percata de la presencia de los chicos, Ellie y sus amigos, junto con una nueva incorporaciÃƒÂ³n, el apÃƒÂ¡tico porrero Chris Lang (interpretado por Andrew Ryan), deberÃƒÂ¡n aunar fuerzas para burlar y contraatacar al misterioso enemigo que se ha apoderado de su pueblo y que ha apresado a sus amigos y seres queridos. \n\n","torrent":{"xt":"urn:btih:07c2b3f7f5758116611f6b9a40c81708e17f1c79","amp;dn":"Ma%C3%83%C2%B1ana+cuando+la+guerra+empieze+%5BBR-Screener%5D%5BSpanish%5D%5Bwww.cons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07c2b3f7f5758116611f6b9a40c81708e17f1c79","infoHashBuffer":{"type":"Buffer","data":[7,194,179,247,245,117,129,22,97,31,107,154,64,200,23,8,225,127,28,121]},"announce":[],"urlList":[]}}