{"title":"The Exterminator 1980 - Hyperdrive25","uid":6300114,"size":537151793,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08d2bfdf0506af8e16387e701f0c2bd4d1bab76f&amp;dn=The+Exterminator+1980+-+Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hyperdrive25","files":2,"time":1302124426,"description":"         The Exterminator 1980 + Theatrical Trailor After End Credits\n         ------------------------------------------------------------\n\n\nThe Exterminator is a 1980 action film written, produced and directed by James Glickenhaus and starring Robert Ginty as Vietnam veteran vigilante John Eastland, also known as &quot;The Exterminator&quot;, who takes out the street punks and those involved in organized crime when the law fails to do justice.\n\nPlot\n----\nThe film begins in Vietnam, opening with a dramatic shot of a huge explosion propelling a U.S. soldier through the air. The soldier is revealed to be the film's protagonist, John Eastland (Robert Ginty) who is quickly assisted by fellow soldier and best friend Michael Jefferson (Steve James). Both men, along with several other U.S. soldiers are quickly captured by the Viet Cong. The film cuts to an open-air VC camp where we next see the soldiers tied to wooden stakes in the ground. The VC commander demands information on when a U.S. strike is going to occur. Eastland refuses to answer and the commander slowly decapitates one of his fellow soldiers. Jefferson manages to get free and quickly slaughters the Vietnamese soldiers.\n\nThe film then shifts to New York, where Eastland and Jefferson work in a food warehouse. One day, a group of thugs called the Ghetto Ghouls attack Eastland while he is working after Eastland catches them trying to steal beer. Jefferson comes to his aid. They defeat the thugs, but the gang return to cripple Jefferson, leaving him paralyzed. Eastland then takes the law into his own hands, a decisions that will change his life forever...\n\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the MP4 file onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\n","torrent":{"xt":"urn:btih:08d2bfdf0506af8e16387e701f0c2bd4d1bab76f","amp;dn":"The+Exterminator+1980+-+Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08d2bfdf0506af8e16387e701f0c2bd4d1bab76f","infoHashBuffer":{"type":"Buffer","data":[8,210,191,223,5,6,175,142,22,56,126,112,31,12,43,212,209,186,183,111]},"announce":[],"urlList":[]}}