{"title":"Animal Instincts - Alan Titchmarsh  (Unabridged)","uid":6188539,"size":181136888,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ad98215ad70f007de4a8969385a6746de8488d3&amp;dn=Animal+Instincts+-+Alan+Titchmarsh++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":34,"time":1298161437,"description":"Alan Titchmarsh - Animal Instincts (unabridged) - Read Alan Titchmarsh\n\n\nSource CD\nDuration approx 8:21 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nFollowing the death of his father, the owner of East Yarmouth Animal Sanctuary, Kit Lavery returns to Britain from Australia to sort out his father's affairs. His visit is intended to be brief, but on arrival at the down-at-heel animal sanctuary, Kit finds it staffed by two very determined women. Elizabeth Punch and Jess Wetherby. Elizabeth is a woman with a mission - to save animals from inconsiderate man. And Jess Supple has one burning desire - to keep alive the work of the old man who took her under his wing when she was a placard-waving hunt saboteur. As the two women cajole, berate and demand that Kit stay and carry on his father's good work, he finds life becoming increasingly complicated. And when GM crop trials are proposed in the fields surrounding his farm, his scruples are tested to the limit, and not everyone is happy with his decision. It seems that blood may be spilt before the Animal Sanctuary, with its assorted inhabitants, is out of the woods...\n\n\nThe author and reader\n\nAlan Titchmarsh is the main presenter on Gardener's World and Ground Force. As well as writing for BBC Gardener's World magazine, The Express and Radio Times, he has also appeared on radio and television both as a gardening expert and as an interviewer and presenter, fronting such programmes as Points of View and Pebble Mill. He is the author of two previous novels, Mr. MacGregor and The Last Lighthouse Keeper, and was appointed MBE in the 2000 New Year Honours list.","torrent":{"xt":"urn:btih:0ad98215ad70f007de4a8969385a6746de8488d3","amp;dn":"Animal+Instincts+-+Alan+Titchmarsh++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad98215ad70f007de4a8969385a6746de8488d3","infoHashBuffer":{"type":"Buffer","data":[10,217,130,21,173,112,240,7,222,74,137,105,56,90,103,70,222,132,136,211]},"announce":[],"urlList":[]}}