{"title":"Nsasoft Product Key Explorer v2.6.6.0 [ak]","uid":6152145,"size":2620529,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0ae732fbf5e00914bc88cdc304e0c88aadb5dcef&amp;dn=Nsasoft+Product+Key+Explorer+v2.6.6.0+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1296912234,"description":"Nsasoft Product Key Explorer v2.6.6.0\n\nProduct Key Explorer - Find over 500 popular software product keys instantly! Product Key Explorer displays product key for Windows, MS Office, SQL Server and more than 500 popular software products installed on your local or remote network computers. In order to install or reinstall Microsoft Office, Windows, or other commercial software, you must have access to a product serial key (CD Key) for that product. Product Key Explorer retrieves serial keys from network computers and allows to protect your company from having pirated software on your network. With this software you will be able to track the number of software licenses installed in your business, find and recover a lost or forgotten product keys, save and keep an up-to-date backup of all your software license keys in a central location. Excellent tool for network administrators, or businesses undergoing a software license compliancy. You can save product keys as Tab Delimited Txt File (.txt), Excel Workbook (.xls), CSV Comma Delimited (.csv), Access Database (.mdb), Web Page (.html) or XML Data (.xml) file, Print or Copy to Clipboard.\n\n\nProduct Key Explorer is a powerful utility that can help you to recover lost license CD keys for many popular products (including Microsoft Windows 2000, XP, Server 2003, Vista, Office, etc.) Product Key Explorer automatically recovers serial keys of the current system and retrieves product keys from network computers. The software allows to protect your company from having pirated software on your network. With this software you will be able to track the number of software licenses installed in your business, find and recover a lost or forgotten product keys, save and keep an up-to-date backup of all your software product keys in a central location.\n\nHome Page - http://www.nsauditor.com\n","torrent":{"xt":"urn:btih:0ae732fbf5e00914bc88cdc304e0c88aadb5dcef","amp;dn":"Nsasoft+Product+Key+Explorer+v2.6.6.0+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ae732fbf5e00914bc88cdc304e0c88aadb5dcef","infoHashBuffer":{"type":"Buffer","data":[10,231,50,251,245,224,9,20,188,136,205,195,4,224,200,138,173,181,220,239]},"announce":[],"urlList":[]}}