{"title":"Motown chartbusters[vol 9]-mp3-320k-mru-winker@kidzcorner-1337x","uid":6163294,"size":137727063,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0bd5c76d607e8a3f44d8bad18fa6c1c64bef6f9c&amp;dn=Motown+chartbusters%5Bvol+9%5D-mp3-320k-mru-winker%40kidzcorner-1337x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":-1,"time":1297291880,"description":"Diana Ross is strongly featured on this volume, with three solo tracks, a duet with Marvin Gaye and a Supremes oldie from the sixties that re-entered the UK charts in 1974. Baby love was the only UK number one hit for the Supremes when first released in 1964. It just missed the top ten when re-issued in 1974. Of Diana's solo hits, All of my life made the UK top ten while Last time I saw him (an American country hit for Dottie West at about the same time) and Love me were only minor UK hits. You are everything (with Marvin Gaye) made the UK top five.\n\nAnother sixties classic that re-entered the UK charts in 1974 is What becomes of the broken hearted (Jimmy Ruffin). Originally peaking at ten in 1966, it made number four in 1974. Observant fans will notice that this track also appears on volume 1. Brilliant as it is, it would have better to replace it on volume 1 with Reach out I'll be there (Four Tops), which doesn't appear in this series at all.\n\nThere's a ghost in this house (R Dean Taylor) made the UK top three in 1974, making it the biggest hit for Motown in the UK that year.\n\nApart from the tracks already mentioned, the big attraction of this volume is the trio of Stevie Wonder hits - Higher ground (the only 1973 hit here), He's mistra know it all and Living for the city. There are also a couple of wonderful Eddie Kendricks tracks (Keep on trucking, Boogie down) as well as Machine gun (Commodores). The tracks by Marvin Gaye, Syreeta and Smokey Robinson, despite their excellence, were only minor UK hits but still did better than Dancing machine (Jackson 5), which didn't make the UK charts at all.\n\nThis is a very strong compilation of some of Motown's classic songs from the seventies, strengthened by a couple of sixties oldies. \n\n\n   1. All Of My Life (Diana Ross)\n   2. Higher Ground (Stevie Wonder)\n   3. Dancing Machine (Jackson 5)\n   4. My Mistake (Was To Love You) (Diana Ross And Marvin Gaye)\n   5. Spinnin' And Spinnin' (Syreeta)\n   6. Keep On Trukin' (Eddie Kendricks)\n   7. There's A Ghost Im My House (R.Dean Taylor)\n   8. Just My Soul Responding (Smokey Robinson)\n   9. Last Time I Saw Him (Diana Ross)\n  10. You Are Everything (Diana Ross And Marvin Gaye)\n  11. He's Misstra Know It All (Stevie Wonder)\n  12. Baby Love (Diana Ross And The Supremes)\n  13. What Becomes Of The Brokenhearted (Various Artists)\n  14. Living For The City (Stevie Wonder)\n  15. Love Me (Diana Ross)\n  16. Boogie Down (Eddie Kendricks)\n  17. Machine Gun (The Commodores)","torrent":{"xt":"urn:btih:0bd5c76d607e8a3f44d8bad18fa6c1c64bef6f9c","amp;dn":"Motown+chartbusters%5Bvol+9%5D-mp3-320k-mru-winker%40kidzcorner-1337x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd5c76d607e8a3f44d8bad18fa6c1c64bef6f9c","infoHashBuffer":{"type":"Buffer","data":[11,213,199,109,96,126,138,63,68,216,186,209,143,166,193,198,75,239,111,156]},"announce":[],"urlList":[]}}