{"title":"CODIGO LYOKO - EL DESPERTAR DE XENA (LA PELICULA) BY JKRILIN","uid":6230245,"size":469803008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d0cd49be488bbd203d5f8ee82abb9b2f9e3b70c&amp;dn=CODIGO+LYOKO+-+EL+DESPERTAR+DE+XENA+%28LA+PELICULA%29+BY+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gaditano_cc","files":2,"time":1299682706,"description":"Por tantas vueltas al pasado que realizo Franz Hopper, XANA, el sistema operativo de Lyoko, toma conciencia y ataca al mundo virtual de Lyoko creado por Franz Hopper, un antiguo profesor de ciencias y ademÃƒÂ¡s el padre de Aelita, y quiere la dominaciÃƒÂ³n del mundo. Ataca el mundo real intentando matar personas activando las torres, generalmente una a la vez, que actÃƒÂºan como acoplamientos al mundo real. El grupo Lyoko conformado por los presonajes Ulrich, Odd y Yumi, tienen que virtualizarse entrando a unos escÃƒÂ¡neres en la fÃƒÂ¡brica, ayudar a Aelita a encontrar la torre activada de las cuarenta dispersadas sobre los cinco sectores de Lyoko: Hielo, Desierto, Bosque, MontaÃƒÂ±as y CÃƒÂ¡rtago o Sector 5, mientras que Jeremie se encarga de detectar monstruos, guiarles en el camino y ayudarles desde la fÃƒÂ¡brica. Aelita debe desactivar la torre entrando y tecleando el CÃƒÂ³digo: LYOKO y asÃƒÂ­ poder detener el ataque de XANA contra el mundo real; entonces el superordenador (a veces dependiendo de la magnitud del ataque) puede regresar en el tiempo momentos antes del ataque (este hecho lo lleva a cabo Jeremie), dejando a nadie excepto al equipo Lyoko para recordar cualquiera de los acontecimientos que ocurrieron, esto es debido a que son las ÃƒÂºnicas personas que se han escaneado en los escÃƒÂ¡ners. Para complicar la situaciÃƒÂ³n, deben hacer esto mientras se aseguran que nadie muera (porque al regresar en el tiempo no se le puede volver a la vida a ÃƒÂ©stos), guardar en secreto sus aventuras y tratar de que nadie descubra Lyoko ni los interiores de la FÃƒÂ¡brica, haciendo a estos jÃƒÂ³venes estudiantes normales y a la vez guerreros en un mundo virtual. \n\n","torrent":{"xt":"urn:btih:0d0cd49be488bbd203d5f8ee82abb9b2f9e3b70c","amp;dn":"CODIGO+LYOKO+-+EL+DESPERTAR+DE+XENA+%28LA+PELICULA%29+BY+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0cd49be488bbd203d5f8ee82abb9b2f9e3b70c","infoHashBuffer":{"type":"Buffer","data":[13,12,212,155,228,136,187,210,3,213,248,238,130,171,185,178,249,227,183,12]},"announce":[],"urlList":[]}}