{"title":"Coast to Coast AM - 2011-01-17 - Gas Prices, Society, &amp; Technolo","uid":6160852,"size":55088310,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0d572bd3c8a6ee447d4b01e9ac7e3fda6e88026a&amp;dn=Coast+to+Coast+AM+-+2011-01-17+-+Gas+Prices%2C+Society%2C+%26+Technolo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1297208003,"description":"Date: \t01-17-11\nHost: \tGeorge Noory\nGuests: \tChristopher Steiner, William Gladstone\n\nAuthor, engineer and staff writer for Forbes Magazine, Christopher Steiner discussed how the rising price of gasoline may be a good thing for American society, which could be restructured in positive ways. In our current mode, many people drive from their homes to work, and hardly walk anywhere at all. But a study showed that a rise of $1 in gas prices led to a dip of 10% in the nation's obesity rate, he reported, adding that with fewer obese people, less money will have to be spent on health care. With $4 or $5 a gallon gas prices, &quot;we're starting to talk about some pretty big dents in the health care issue,&quot; he commented.\n\nHigher gas prices would lead to grocery stores stocking items grown locally or nearby rather than importing apples from places like New Zealand, which is currently economical because of low gas prices, he detailed. The rise of gas costs would also mean people will want to live in urban centers where they can shop locally, rather than having to drive 15 minutes to buy a carton of milk, and &quot;Main Street&quot; will be relevant again, he suggested. And with airfare becoming prohibitively expensive, trains will become a popular mode of national transport, he said.\n\nVarious gasoline alternatives such as electric cars and hydrogen are not yet cost effective options for many consumers, Steiner pointed out. He also talked about how technology has bolstered traditional stores and businesses, who have been been offering &quot;deal of the day&quot; coupons to consumers via rising online companies like Groupon.\nMind Techniques\n\nIn the first hour, author William Gladstone talked about techniques for developing abundance and happiness in one's life. Based on the Master Key System first published by Charles Haanel in 1912, the first step is you have to learn to focus joyfully within, and stop all the noise around you, he explained. By doing this, one can then align themselves with the &quot;universal mind&quot; or source, he continued.\n\nNews segment guest: Robert Zimmerman\nWebsite(s):\n\n    * chrissteiner.com\n    * tappingthesourcebook.com\n\nBook(s):\n\n    * $20 Per Gallon: How the Inevitable Rise in the Price of Gasoline Will Change Our Lives for the Better\n    * Tapping the Source: Using the Master Key System for Abundance and Happiness\n","torrent":{"xt":"urn:btih:0d572bd3c8a6ee447d4b01e9ac7e3fda6e88026a","amp;dn":"Coast+to+Coast+AM+-+2011-01-17+-+Gas+Prices%2C+Society%2C+%26+Technolo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d572bd3c8a6ee447d4b01e9ac7e3fda6e88026a","infoHashBuffer":{"type":"Buffer","data":[13,87,43,211,200,166,238,68,125,75,1,233,172,126,63,218,110,136,2,106]},"announce":[],"urlList":[]}}