{"title":"Charlie and the Chocolate Factory(2005)DVDRip.AC3(ENG)-DROCK","uid":6177492,"size":739237888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d6b3a19063cbe5b91df72fba61cbd1ee47c7663&amp;dn=Charlie+and+the+Chocolate+Factory%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1297820693,"description":"Director Tim Burton brings his unique vision and sensibility to Roald Dahl's classic children's story in this lavish screen interpretation. Willy Wonka (Johnny Depp) is the secretive and wildly imaginative man behind the world's most celebrated candy company, and while the Wonka factory is famously closed to visitors, the reclusive candy man decides to give five lucky children a chance to see the inside of his operation by placing &quot;golden tickets&quot; in five randomly selected chocolate bars. Charlie Bucket (Freddie Highmore), whose poor but loving family lives literally in the shadow of the Wonka factory, is lucky enough to obtain one of the tickets, and Charlie, escorted by his Grandpa Joe (David Kelly), is in for the ride of a lifetime as he tours the strange and remarkable world of Wonka with fellow winners, media-obsessed Mike Teavee (Jordan Fry), harsh and greedy Veruca Salt (Julia Winter), gluttonous Augustus Gloop (Philip Wiegratz), and ultra-competitive Violet Beauregarde (AnnaSophia Robb). Over the course of the day, some of the children will learn difficult lessons about themselves, and one will go on to become Wonka's new right hand. Charlie and the Chocolate Factory also stars Christopher Lee, James Fox, and Noah Taylor; the book was famously adapted to the screen before in 1971 under the title Willy Wonka and the Chocolate Factory, with Gene Wilder as the eccentric candy tycoon.\n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:0d6b3a19063cbe5b91df72fba61cbd1ee47c7663","amp;dn":"Charlie+and+the+Chocolate+Factory%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d6b3a19063cbe5b91df72fba61cbd1ee47c7663","infoHashBuffer":{"type":"Buffer","data":[13,107,58,25,6,60,190,91,145,223,114,251,166,28,189,30,228,124,118,99]},"announce":[],"urlList":[]}}