{"title":"Defiance(2008)DVDRip.AC3(ENG)-DROCK","uid":6223643,"size":733474117,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0dee1e33c1f97a3488269db4d1685b454e98b933&amp;dn=Defiance%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1299432715,"description":"Inspired by a true story, director Edward Zwick\\'s epic World War II drama Defiance tells the tale of three Jewish Eastern European brothers (Daniel Craig, Liev Schreiber, and Jamie Bell) who narrowly escape certain death at the hands of the Nazis, subsequently vowing to avenge the deaths of their loves ones by launching a desperate battle against the forces that seek to exterminate their entire race. The year is 1941, and the setting is Nazi-occupied Belarus. The Final Solution is in full effect, and the Jews of Eastern Europe are being slaughtered wholesale. Tuvia (Craig), Zus (Schreiber), and Asael (Bell) have miraculously managed to escape into the dense surrounding forest. Having played in these woods since childhood, the brothers have a distinct advantage over their adversaries, and soon decide that simply surviving is not enough. In order to make a difference, they must take action, but in order to take action they will need support. As whispers of their bravery take wind, others like them appear determined to lay their lives on the line for the cause of freedom. Tuvia has become the de facto leader of the group, but he\\'s still somewhat reluctant to take on such a heavy responsibility and his brother Zus expresses concern that his idealistic plan will ultimately bring about the group\\'s downfall. With winter setting in, everyone works to create a functioning community that will help them endure the frigid months that lie ahead, and Asael reluctantly finds himself caught in the crossfire of his older siblings\\' rivalry. Is it possible to keep faith alive in a time when the world seems devoid of humanity and survival becomes a way of life?\n\nRipped with Handbrake.\n\nLength: 2 Hours 16 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:0dee1e33c1f97a3488269db4d1685b454e98b933","amp;dn":"Defiance%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dee1e33c1f97a3488269db4d1685b454e98b933","infoHashBuffer":{"type":"Buffer","data":[13,238,30,51,193,249,122,52,136,38,157,180,209,104,91,69,78,152,185,51]},"announce":[],"urlList":[]}}