{"title":"Alice Cooper Along Came A Spider][2010][mp3 320kbs][ICM369","uid":6299896,"size":139182182,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0f2a532f66966c39134f8828f8d5f178d4fdb827&amp;dn=Alice+Cooper+Along+Came+A+Spider%5D%5B2010%5D%5Bmp3+320kbs%5D%5BICM369&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ICM369","files":-1,"time":1302117429,"description":"Alice Cooper Along Came A Spider][2010][mp3 320kbs][ICM369\n__________\n\nAudio CD (21 Dec 2010) Remastered\n \nNumber of Discs: 1\n \nLabel:  Wea/Bigger Picture\n\nGenre : Heavy metal\n__________\n \nThis concept album contains some of Cooper's most outlandish work \nto date and the album storyline for was first revealed on Cooper's \nradio show Nights with Alice Cooper.\n\nThe theme of the album revolves around a cool, calm and collected \nserial killer known as Spider. \n\nThe police are baffled by the bodies of Spider's victims, which are \ncocooned in a silk web, and are each missing a leg.\n \nSpider's task is to collect eight legs in order to complete the \nconstruction of his own spider however, things get complicated when \nhe falls in love with his eighth victim.\n\nAfter two garage albums it seemed inevitable that Alice would have \nanother crack at the concept album..the problem for Cooper is that \nhis output has been so vastly varied over his career that one\npersons poison is another's delight.\n\nThe first single 'Vengeance Is Mine' sets the tone with huge guitar \nriffs providing the ground on which Cooper can set the scene with \nhis trademark scowling tone. \n\nThis album demands many listen to fully appreciate all its wonders,\nto me this is the most satisfying Alice album in years, and like any \ntruly great album it makes you work to fully explore its brilliance.\n \nThere is a real retro feel to this album that is offset by clean and \nmodern production and if you listen through head phones it brings\nanother dimension to the sound! \n \nHe's stuck to his road band for this trip to the studio, so Kiss \ndrummer Eric Singer, bassist Chuck Garric and guitarists Keri Kelli \nand Jason Hook handle the majority of the work on the album. \n\nAnd all that time spent touring has paid off they sound like a proper \nband, not just a bunch of session guys who've popped in to pay the \nbills. \n\nThere is room for some guests, though, and Guns n' Roses / Velvet \nRevolver fella Slash lays down an excellent solo on &quot;Vengeance Is Mine&quot;, \none of the highlights on the album. \n\nIn a novel twist Ozzy Osborne whips out his mouth organ for some, well, \npedestrian harmonica work on &quot;Wake The Dead&quot;, where he also gets a \nco-writing credit. \n\nIt's a surprisingly heavy album, especially considering that for studio \nalbum number 25, Alice has brought in a new production team in the shape\nof Danny Saber, formerly of Black Grape, and Greg Hampton who's been \nworking on an album project teaming up ex Guns n' Roses guitarist \nBuckethead and Bootsy \nCollins. \n\nBut any fears that this would end up a dance crossover are firmly dashed, \ndespite some heavy synth work on &quot;Catch Me If You Can&quot;.\n\nDespite the return to the concept album, the sound is more similar to his \nBrutal Planet and Dragontown albums than it is to the seventies sounds of \nWelcome To My Nightmare or From The Inside, especially the large amounts\nof riffing laid down by Keri Kelli and Jason Hook. \n\nThe one track that totally fails is the big ballad, &quot;Salvation&quot;, which \njust pales besides older material like &quot;How You Gonna See Me Now&quot;. Luckily, \nthere is an array of material that rocks out and will, doubtless, slot \nhappily into his never-ending tour. \n\n&quot;Wrapped In Silk&quot; and &quot;I'm Hungry&quot;, for example, are custom built for \naudience sing-a-longs. \n\nAnd last but not least things come full circle in the closing track \n&quot;I Am The Spider/Epilogue&quot;, when an old, old friend pops in for a cameo. \n\nHe may have turned 60 this year but there's no sign of him fading away,\nas this really is a good Alice Cooper album, one that tries to tie in the \nvarious musical strands he's pursued over his career, and will be a delight\nfor anyone whose followed him on the way. \n\n2010 re-release / iTunes bonus tracks\n\nAs with a large portion of Cooper's back-catalogue being remastered and \nre-released through various distribution channels, Along Came A Spider has \nalso received the same treatment including the three iTunes-only bonus \ntracks released alongside the album in 2008.\n\n1.&quot;Shadow Of Yourself&quot;\n2.&quot;I'll Still Be There&quot;\n3.&quot;Salvation&quot; (Unplugged With String Section)\n__________\n \n1. Prologue/I Know Where You Live\n\nGreat guitar riff and seventies style lead.I believe there is even some tambourine \nin there!!! \n\n2. Vengeance Is Mine: This could belong on Dragontown, great melody \n\n3. Wake The Dead\n\nSixties psychedelic feel with vocals that match, good guitar riff and nice bass work. \n\n4. Catch Me If You Can\n\nPretty straight rock song, good chorus with intelligent guitar breaks. \n\n5. (In Touch With) Your Feminine Side\n\nGood chorus and another seventies groove! \n\n6. Wrapped In Silk\n\nExcellent bass work and great guitar interplay. \n\n7. Killed By Love\n\nThe ballad!!! Actually works well and is helped by nice backing vocals and a great \nAlice vocal. \n\n8. I am Hungry\n\nTo my ears, a definite nod to the original ACG,nice Bruce type riff. A good measured \nlead solo. \n\n9. The One That Got Away:Good melodies and a fine arrangement, a seventies feel again! \n\n10. Salvation\n\nThis sounds as though it could of sat quite happily on the Go to Hell album, nice drum \nwork, mixed with inventive bass playing and a big chorus! \n\n11. I Am The Spider/Epilogue\n\nA zombie feel and a deliberate plodding and down beat(what do you expect, its about a \nserial killer),with another great guitar riff! \n__________\n\n12 .Shadow Of Yourself\n\n13. I'll Still Be There\n\n14. Salvation (Unplugged With String Section)\n__________\n\nFormat                           : MPEG Audio\nFile size                        : 10.0 MiB\nDuration                         : 4mn 22s\nOverall bit rate                 : 320 Kbps\nAlbum                            : Along Came A Spider\nTrack name                       : Prologue/I Know Where You Live\nTrack name/Position              : 1\nPerformer                        : Alice Cooper\nRecorded date                    : 2010\nWriting library                  : LAME3.92\n\nAudio\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nMode                             : Joint stereo\nMode extension                   : MS Stereo\nDuration                         : 4mn 22s\nBit rate mode                    : Constant\nBit rate                         : 320 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nStream size                      : 10.00 MiB (100%)\nWriting library                  : LAME3.92\n__________\n\nMp3\n\nRipped:320\n\nEnjoy:D","torrent":{"xt":"urn:btih:0f2a532f66966c39134f8828f8d5f178d4fdb827","amp;dn":"Alice+Cooper+Along+Came+A+Spider%5D%5B2010%5D%5Bmp3+320kbs%5D%5BICM369","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f2a532f66966c39134f8828f8d5f178d4fdb827","infoHashBuffer":{"type":"Buffer","data":[15,42,83,47,102,150,108,57,19,79,136,40,248,213,241,120,212,253,184,39]},"announce":[],"urlList":[]}}