{"title":"slitaz-cooking-20110329.iso","uid":6279792,"size":32505856,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:0fbbf7acaf56f359ce2e97a324fce5368e01d060&amp;dn=slitaz-cooking-20110329.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1301391555,"description":"The SliTaz team is pleased to announce the release of a new cooking ISO featuring over 2900 packages. All packages have been rebuild using our new cooking tool, now included in tazwok. It contains Linux Kernel 2.6.37 compiled against glibc 2.13, binutils 2.21 &amp; gcc 4.5.2. The Core LiveCD includes Midori 0.3.3. Tazpkg is now entirely translated to french and we are open to additionnal translations. Tazwok have been entirely rewritten and it's now possible to recook SliTaz from Scratch using any ISO. This ISO is the first of release candidate serie which lead us to stable 4.0 release.\nA lot of work has been done since last cooking ISO released in november: more than 2200 changes have been commited to the wok, and several hundreds to home-build tools. We are proud to announce that SliTaz community growed a lot theses last month: the last year, has many changes was commited than in the four previous - it means all SliTaz history. However, quantity doesn't suffise to make quality. We need you to help to test this new ISO and report eventual bugs. If you want to, you are welcome to help to fix known problems before 4.0 release. You can join members of the crew via our IRC, mailing-list, forums or by mailing packages maintainers. We hope you will enjoy, as us, this new release! \n &lt;a href=&quot;\nhttp://www.slitaz.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.slitaz.org/&lt;/a&gt;\n\nmd5sum : 2e9e8b34d777b7c7c0c2d4714febdb9f  slitaz-cooking.iso","torrent":{"xt":"urn:btih:0fbbf7acaf56f359ce2e97a324fce5368e01d060","amp;dn":"slitaz-cooking-20110329.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fbbf7acaf56f359ce2e97a324fce5368e01d060","infoHashBuffer":{"type":"Buffer","data":[15,187,247,172,175,86,243,89,206,46,151,163,36,252,229,54,142,1,208,96]},"announce":[],"urlList":[]}}