{"title":"Democracy Now - 05 apr 2011","uid":6296988,"size":450816427,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:11b3cfce59e4977cfdd3f0a1d36a735bf0cc67dc&amp;dn=Democracy+Now+-+05+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1302029485,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 05, 2011\n\n- 9/11 Suspects To Be Tried Before Military Commission\n- GOP Proposes Sweeping Changes to Medicare &amp; Medicaid\n- Ivory Coast: Opposition and U.N. Forces Close In On Presidential Palace\n- Libyan-Americans Investigated By FBI\n- Libya Rebels Reject Prospect Of Colonel Gaddafi's Son Taking Power\n- Thousands Protest In Yemen, Two Die In State Crackdown\n- Israel President Peres Visits Washington Amid Construction Of Illegal Settlements\n- Juliano Mer-Khamis of the Jenin Freedom Theatre Murdered In West Bank\n- Michel Martelly Wins Haiti Presidential Election\n- Authorities Investigate Massive Private Information Breach\n- Labor Rallies Sweep Nation Marking Anniversary Of Martin Luther King Assassination\n\n\nSpecial reports\n\n- Japan Releases Radioactive Water Several Million Times the Legal Limit into Ocean\n\nRadiation at the shoreline of the Fukushima Daiichi nuclear power facility has measured several million times the legal limit, just four weeks after the earthquake and tsunami and days after workers discovered a crack where highly contaminated water was spilling directly into the Pacific Ocean. Experts say radiation dissipates quickly in the vast ocean, but they are unclear what will be the long-term effects of large amounts of contamination. The new levels prompted the Japanese government on Tuesday to create an acceptable radiation standard for fish for the first time. We're joined by Philip White of the Citizens' Nuclear Information Center in Tokyo. &quot;Cancers from this sort of level of radioactivity will not appear in the first few months or year; they will be late-onset phenomena,&quot; White says. &quot;So, it'll require a lot of monitoring of health to actually see what the impact of this is.&quot;\n\n\n- U.N. Nuclear Watchdog Says It Will Continue to Push for New Nuclear Power Plants Despite Growing Global Nuclear Concern\n\nThe disaster at the Fukushima Daiichi nuclear power facility in Japan has set off a debate in the international community about the future of nuclear energy. There are currently 440 nuclear reactors in operation worldwide, generating about 14 percent of global electricity-and plans for construction of new plants have soared in the last decade, especially in India and China. This was the focus on Monday as the fifth review meeting of the Convention on Nuclear Safety kicked off in Vienna, hosted by the United Nations atomic watchdog, the International Atomic Energy Agency. We are joined by Philip White of the Tokyo-based Citizens' Nuclear Information Center and Jan BerÃƒÂ¡nek, the director of Greenpeace International's Nuclear Campaign. BarÃƒÂ¡nek argues the IAEA is preventing an honest review by &quot;focusing its efforts to restore the public confidence in nuclear power and to help other countries expand the usage of civilian nuclear reactors to generate electricity.&quot;\n\n\n- States Use &quot;Astonishing Lack of Care and Deliberation&quot; to Choose New Lethal Injection Drugs for Death Row Executions\n\nTonight Texas plans to use a new execution drug for the first time on the scheduled execution of death row prisoner Cleve Foster. Like many states, it is experimenting with its lethal injection process due to a shortage of the sedative sodium thiopental. The new method was shrouded in secrecy until records revealed Texas prison officials chose a replacement execution drug, pentobarbital, without consulting a medical professional and relied on news articles to help them choose a sedative for the state's three-drug lethal injection cocktail that is intended to prevent pain, inhibit muscle movement, and stop the inmate's heart. On Friday, the U.S. Drug Enforcement Agency demanded Kentucky and Tennessee hand over their supply of the drug because of concerns it may have been illegally imported. We speak with Maurie Levin in Austin, who filed suit to get details about Texas's new execution drug. We're also joined by Richard Dieter, executive director of the Death Penalty Information Center in Washington, D.C.\n\n11:25am EST Update: The U.S. Supreme Court has granted a stay in Foster's execution, pending the disposition of the petition for rehearing of the order denying cert in January raising issues regarding constitutional adequacy of state habeas counsel and related claims of innocence and ineffective assistance of counsel.\n\n\n- Leading Palestinian Peace Activist &amp; Theater Director, Juliano Mer-Khamis, Killed in Jenin\n\nPalestinians, artists and peace activists worldwide are mourning the loss of a leading figure in Palestinian creative nonviolent resistance. Juliano Mer-Khamis, the founder of a theater for Palestinian children, was killed Monday by masked assailants in the West Bank town of Jenin. He had received a number of death threats from extremist Palestinians for his work with the Jenin Freedom Theatre. The theater has helped Palestinian youths deal with the hardships of life under Israeli occupation by expressing themselves through the arts-film, photography, art and theater. We are joined in Jenin by Nabeel Raee, director of the Acting School at the Jenin Freedom Theatre, where he worked closely with Mer-Khamis for many years, and by Constancia &quot;Dinky&quot; Romilly, founder and president of the board of the New York City-based Friends of the Jenin Freedom Theatre, who also worked closely with the program in Jenin.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:11b3cfce59e4977cfdd3f0a1d36a735bf0cc67dc","amp;dn":"Democracy+Now+-+05+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b3cfce59e4977cfdd3f0a1d36a735bf0cc67dc","infoHashBuffer":{"type":"Buffer","data":[17,179,207,206,89,228,151,124,253,211,240,161,211,106,115,91,240,204,103,220]},"announce":[],"urlList":[]}}