{"title":"Stoute Boudjies","uid":6288758,"size":980965325,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:120b9dc51fd3d1e3a94838376c00dffb99c35563&amp;dn=Stoute+Boudjies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Grobant","files":-1,"time":1301718332,"description":"Stoute Boudjies\n\nMovie Release Date: Dec 10, 2010\nRunning Time:1hr 33min\nGenre: Comedy\nAudience Rating: 16 LNS\nLanguage: Afrikaans\nFilmed in: South Africa\n\n\nCredits\nCast:  Albert de Villiers, Angelique Pretorius, Andrew Thompson, Gerhard Odendaal, Carien Botha, PerlÃƒÂ© Sippel, Richard vd Westhuizen, Dirk Stolz, Dorette Nel, Lizz Meiring, Willie Esterhuizen\n\nDirector:  Willie Esterhuizen\nScreenplay:  Willie Esterhuizen\n\n\nEK HET DIE PADDA.  EK MAAK DIE REÃƒÂªLS!\n\n\nAlbert de Villiers and Angelique Pretorius stars as Hardus and Petro, in Willie and Pieter Esterhuizen's hilarious new Afrikaans sex comedy &quot;STOUTE BOUDJIES&quot; \n\nHARDUS, is a third year computer sciences student who lives in Johannesburg with his divorcee mother, Madelet (played by Dorette Nel). Hardus has to find work for the varsity holiday to earn his keep, but at his age, he is more interested in losing his virginity than finding a job. \n\nHis best friend and comrade in arms, VAATJIE VISAGIE, played by Gerhard Odendaal, does little to help in the virginity stakes, but does provide an opportunity to work as a washer at Mr. De Vries's bakery. Mr. De Vries (played by actor Matt Stern) sends them on an errand that proves to be much more adventurous that any of them could have imagined. \n\nPETRO, played by the stunning Angelique Pretorius, (a former FHM model of the year) impacts hugely on Hardus's life. He not only finds himself totally besotted with her but when they end up in bed together, Hardus's world, gets turned upside down. This is mainly because Petro's boyfriend, Harley Davidson biker OS, (played by macho man Asley Saunders), wants to break Hardus's neck for screwing his chick. The fact that she no longer happens to be his girl, does not deter OS from wanting to cause some grievous bodily harm to Hardus. \n\nThe film is a hilarious teen sex comedy, targeted specifically for the young Afrikaans movie going audience. It is contemporary and truthful version of life in post world cup South Africa. \n\nThe movie has a star-studded cast. Other actors in the film include Richard van der Westhuizen as Hardus's ex-dominee dad and Gigi, (yes Gigi from Survivor fame) as his Russian stripper girlfriend, IVANKA BEFOKSKI. Dirk Stoltz plays, JAAP the undercover investigator that has to sort out the mess Hardus and Vaatjie get themselves in. Then there's the ever popular VISAGIE family featuring stalwarts Liz Meiring and Willie Esterhuizen as Vaatjies mom and dad, and cute as ever BLAPSIE (played by Karien Botha) as his little, but not so innocent, sister.\n &lt;a href=&quot;\nhttp://www.moviesite.co.za/2010/1210/stoute-boudjies.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviesite.co.za/2010/1210/stoute-boudjies.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.numetro.co.za/movie/1621/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.numetro.co.za/movie/1621/&lt;/a&gt;\n\nTRAILER:","torrent":{"xt":"urn:btih:120b9dc51fd3d1e3a94838376c00dffb99c35563","amp;dn":"Stoute+Boudjies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120b9dc51fd3d1e3a94838376c00dffb99c35563","infoHashBuffer":{"type":"Buffer","data":[18,11,157,197,31,211,209,227,169,72,56,55,108,0,223,251,153,195,85,99]},"announce":[],"urlList":[]}}