{"title":"Amy Chua - Battle Hymn of the Tiger Mother (BBC Radio 4 Excerpts","uid":6267254,"size":82786190,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:12bdbc8b2f0d2da89653f75a5ae916ae96e35fd0&amp;dn=Amy+Chua+-+Battle+Hymn+of+the+Tiger+Mother+%28BBC+Radio+4+Excerpts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1300955342,"description":"***UPLOADERS NOTE*** - This torrent contains the series of excerpts that Amy Chua read for BBC's Radio 4. It is NOT the entire book. The notes below are from the usenet torrent, thanks to the OP\n\n\nBattle Hymn of the Tiger Mother (Book of the Week)\nBroadcast on BBC Radio 4\nMonday 7 to Friday 11 February 2011 09:45-10:00\n\nThe daughter of Chinese immigrants, Amy Chua raised her own daughters in America: starting from the premise that the Chinese parenting model got better results than its Western counterpart. Given that Sophia and Louisa (Lulu) were polite, interesting and helpful girls with perfect school marks and exceptional musical abilities, this seemed to be borne out. But what happens when you won't tolerate disobedience, and yet your daughter still says no?\n\nBattle Hymn of the Tiger Mother is not a child-rearing manual but a tale of culture clash and what happens when your own convictions are seriously challenged.\n\nPart 1 - Encouraged by the young Sophia's musical precocity, Amy turns her attentions to Lulu. But when she sits her down at the piano -things don't turn out quite the way she planned.\n\nPart 2 - The Suzuki method of teaching musical instruments requires a parent to attend all lessons and supervise practice at home. Both daughters are making rapid progress, but Amy is more than up to the challenge.\n\nPart 3 - Music is getting serious for the Chua family. Amy must help Sophia prepare to perform at Carnegie Hall and Lulu to audition for the Pre-College programme at Juilliard College.\n\nPart 4 - After an ill-fated concert in Budapest, relations between Amy and Lulu are under strain. Amy fears she is losing some control over her younger daughter.\n\nPart 5 - After a difficult time for the family the Chuas go on holiday to Russia. But in Red Square, tensions between Amy and Lulu come to a head. Can things carry on as before?\n\nAmy Chua is the John M Duff Professor of Law at Yale Law School. Her first book World on Fire: How Exporting Free Market Democracy Breeds Ethnic Hatred and Global Instability was a New York Times bestseller, was selected by both the Economist and the Guardian as one of the Best Books of 2003 and translated into eight languages. Her second book, Day of Empire: How Hyperpowers Rise to Global Dominance - and Why They Fall was a critically-acclaimed Foreign Affairs bestseller. Her writings have appeared in the New York Times, the Washington Post, the Financial Times, Harvard Business Review and the Wilson Quarterly. She lives with her husband, two daughters and two Samoyeds in New Haven, Connecticut.\n\nTiger Mothers - Amy Chua Interview (Woman's Hour, 8 February 2011)\nAmy Chua is author of the memoir, Battle Hymn of the Tiger Mother, currently Book of the Week on R4. She raised her two daughters using a strict Chinese-parenting model, designed to produce academic success and exceptional musical ability. A lifestyle in which schoolwork comes first and the only activities children should be allowed to do are those in which they can eventually win a medal! Amy joins Jane, along with Child Development Expert, Elizabeth Hartley-Brewer, to discuss whether this level of parental control leads to success, or should discipline be balanced with freedom? Battle Hymn of the Tiger Mother, by Amy Chua, published by Bloomsbury. ISBN: 978-1-4088-1267-9. [11:40]\nAbridged by Jeremy Osborne, Reader: Liz Sutherland\nProducer: Rosalynd Ward, A Sweet Talk Production for BBC Radio 4.\n  &lt;a href=&quot;\nhttp://bayimg.com/baEmpAadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/baEmpAadJ&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Battle-Hymn-Tiger-Mother-Chua/dp/0142429104/ref=tmm_abk_title_0?ie=UTF8&amp;qid=1300949458&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Battle-Hymn-Tiger-Mother-Chua/dp/0142429104/ref=tmm_abk_title_0?ie=UTF8&amp;qid=1300949458&amp;sr=8-1&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b00yf80x/episodes/2011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b00yf80x/episodes/2011&lt;/a&gt;","torrent":{"xt":"urn:btih:12bdbc8b2f0d2da89653f75a5ae916ae96e35fd0","amp;dn":"Amy+Chua+-+Battle+Hymn+of+the+Tiger+Mother+%28BBC+Radio+4+Excerpts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12bdbc8b2f0d2da89653f75a5ae916ae96e35fd0","infoHashBuffer":{"type":"Buffer","data":[18,189,188,139,47,13,45,168,150,83,247,90,90,233,22,174,150,227,95,208]},"announce":[],"urlList":[]}}