{"title":"Coast to Coast AM - 2011.02.21 - Doomsday and Brown Dwarf Star","uid":6194170,"size":55522585,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:13a842bf884c736322e9a705fd2db902df966cbd&amp;dn=Coast+to+Coast+AM+-+2011.02.21+-+Doomsday+and+Brown+Dwarf+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pegasus77","files":5,"time":1298400270,"description":"Doomsday &amp; Brown Dwarf Star\n \nDate: \t02-21-11\nHost: \tGeorge Noory\nGuests: LUCUS(aka Wayne Young), Cheryl Harness\n\nIn the middle two hours, researcher of ancient mysteries and how they relate to geological and astronomical cycles, LUCUS, discussed his contention that a brown dwarf star will decimate Earth. Orbiting in our solar system, its inbound passage every 3,600 years, causes Earth's magnetic field to fall, and sends civilizations back to the hunter/gatherer state, he outlined. In a binary system with our sun, the brown dwarf star is dark and impossible to see from a distance, yet as it draws closer, it will likely appear the same size as the sun, though as a big black circle in the sky, he continued.\n\nThe dwarf star will emit a lot of radiation, as well as gravitational pull that will cause massive earthquakes, floods, tsunamis, and climate extremes, he warned, adding that an example of the coming change was the sun rising two days early in Greenland this year. LUCUS believes that the &quot;powers that be&quot; are aware of the coming dwarf star and have already made survival preparations including an underground facility at the Denver Airport. They have also authorized the spraying of chemtrails which contain barium-- this absorbs and reduces the effects of radiation, he pointed out.\n\nLUCUS spoke about the how the Yellowstone super caldera is increasing in activity but seismic data is being deleted or suppressed from the public. If the caldera blows, the catastrophic effects include deadly glass particles sent into the atmosphere that people and animals would breathe in. He also noted that the San Bruno gas explosion happened at the same time as a fireball in the sky, and may have been sparked by an asteroid.\n\nIn the last hour, Open Lines callers shared how they would deal with a possible disaster facing Earth.\nGhosts of the White House\n\nFirst hour guest, author/illustrator Cheryl Harness talked about ghosts and spirits at the White House. President Truman was said to hear the footsteps of ghosts in the hallway, and on one occasion was awakened by three distinct knocks on his door, but no one was there, she detailed. There have also been sightings of an old usher, a British soldier carrying a torch, and two of the first ladies- Abigail Adams, and Dolly Madison.\n\nNews segment guests: Whitley Strieber, Capt. Kelly Sweeney, Greg Hunter\n\nWebsite(s):\nrabbithole2.com\ncherylharness.com\n\nVideo(s):\nThe Destroyer Star and the Future of Mankind\n\nBook(s):\nGhosts of the White House","torrent":{"xt":"urn:btih:13a842bf884c736322e9a705fd2db902df966cbd","amp;dn":"Coast+to+Coast+AM+-+2011.02.21+-+Doomsday+and+Brown+Dwarf+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a842bf884c736322e9a705fd2db902df966cbd","infoHashBuffer":{"type":"Buffer","data":[19,168,66,191,136,76,115,99,34,233,167,5,253,45,185,2,223,150,108,189]},"announce":[],"urlList":[]}}