{"title":"Felon (2008) Audio English+Polish DD5.1 Retail Multisubs 20 --TB","uid":6303944,"size":4672045313,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:15d9df2940638cbb0d805943ae779bd3ceb43d68&amp;dn=Felon+%282008%29+Audio+English%2BPolish+DD5.1+Retail+Multisubs+20+--TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Saggin","files":-1,"time":1302258537,"description":"Felon 2008 Audio English+Polish DD5.1 Retail 20 subs \n\n\n\nNederlands:       \nVerenigde Staten\nMisdaad / Drama\n104 minuten\n\ngeregisseerd door Ric Roman Waugh\nmet Val Kilmer, Stephen Dorff en Harold Perrineau\n\n\nEen film geschreven en geregisseerd door Ric Roman Waugh, gebaseerd op gebeurtenissen \ndie plaatsvonden in de jaren 1990 in de beruchte California State Gevangenis.\nDrie keer is scheepsrecht, moet Ric Roman Waugh gedacht hebben. Zijn eerste film, \nExit, uit 1996 had niet zijn naam, maar die van Alan Smithee, het pseudoniem als \nregisseur op de rol staan. Zijn tweede film In the Shadows beschikte over een groter \nbudget, betere acteurs en was beter dan Exit, maar nog steeds geen hoogvlieger. In \n2008 komt deze film Felon uit van de voormalige stuntman. Het is een beklemmend \ngevangenisdrama, een film waar Ric Roman Waugh zich allesbehalve voor hoeft te \nschamen, integendeel: Felon is een uitstekende film.\n\nDe kracht van Felon is dat de film goed laat zien hoe een enkele impulsieve \nbeslissing een heel leven voorgoed kan veranderen. Wade rent achter de inbreker aan, \npuur om zijn gezin te beschermen en raakt de man ongelukkig en wordt direct \naangeklaagd voor moord en naar de gevangenis gestuurd. Het is te bizar voor \nwoorden...\n\nWaugh heeft goed in beeld gebracht hoe verbijsterend en gruwelijk iemands leven dit \nkan veranderen. De gevangenis is vernederend, levensgevaarlijk, racistisch, corrupt \nen zeer gewelddadig. Het is shockerend om te zien hoe het dagelijks leven daar is, \nniet alleen voor gevangen en bewakers, maar ook voor de bezoekers. De angst en \nverbijstering die bij Wade en Laura heerst is uitstekend en je kan je gemakkelijk \nidentificeren met dit jonge stel, hetgeen de spanning alleen maar ten goede komt. Het \nacteerwerk is prima in orde, vooral Val Kilmer maakt indruk als sympathieke, ietwat \nfilosofische moordenaar.\n\nFelon is niet alleen een uitstekend gevangenisdrama, maar geeft ook een ontluisterd \nbeeld van het Amerikaanse gevangeniswezen en je kan je echt afvragen in hoeverre \niemand gerehabiliteerd is na een aantal jaren in zo\\'n verknipte omgeving. Een \naanklacht dus tegen het Amerikaanse rechtssysteem, maar regisseur Waugh legt hier \nniet teveel de nadruk op. Dat hoeft echter ook niet, want deze film spreekt voor \nzichzelf. Meer dan de moeite waard.\n\nDe succesvolle familieman Wade Porter verliest alles wanneer hij per ongeluk een \ninbreker doodt. Hij wordt veroordeeld tot drie jaar hechtenis in een zwaar bewaakte \ngevangenis. Wade deelt zijn cel met een beruchte massamoordenaar en moet beestachtige \nafstraffingen van een sadistische bewaker ondergaan. Hij beseft al snel dat hij zich \nkeihard moet opstellen, wil hij dit overleven...\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/31059&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/31059&lt;/a&gt;\n\nEnglish\nThe family man Wade Porter is living the American Dream with his girlfriend Laura and \ntheir son Michael: they have a nice house, he has just raised a loan to make his \ncompany grow and they are going to get married. However their dream becomes a \nnightmare when Wade unintentionally kills a burglar that had broken into their house \nin the middle of the night on his lawn. He is sent to trial and accepts a deal \nproposed by the prosecutor, being sentenced to three years in prison. During the \ntransportation, there is an incident in the bus and Wade is framed and sent to the \nmaximum security wing under the command of the corrupt Lieutenant Jackson. His \ncell-mate John Smith that was sentenced to life revenging the death of his family \nbefriends Wade and gives helpful advices and hope to Wade to return to his family. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1117385/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1117385/&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nAudio          : Engels/Polish 5.1DD\nBron           : Retail\nOndertitels    : NL/English/Czech/Hungarian/Polish/Arabic/Bulgarian/Croatian/Danish/Estonian/Finnish/Greek/Hebrew/Hindi/Icelandic/Norwegian/Serbian/Slovak/Swedish/Turkish\nExtra's        : No\nMenu           : Yes\nGenre          : Crime/Drama \nCover          : Ja \n \n","torrent":{"xt":"urn:btih:15d9df2940638cbb0d805943ae779bd3ceb43d68","amp;dn":"Felon+%282008%29+Audio+English%2BPolish+DD5.1+Retail+Multisubs+20+--TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15d9df2940638cbb0d805943ae779bd3ceb43d68","infoHashBuffer":{"type":"Buffer","data":[21,217,223,41,64,99,140,187,13,128,89,67,174,119,155,211,206,180,61,104]},"announce":[],"urlList":[]}}