{"title":"Hamish McDoodle","uid":6247143,"size":30936893,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:165f2efb1a6ea35b06b7b0a4d06f233af8aca29c&amp;dn=Hamish+McDoodle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tuscanboy","files":6,"time":1300274977,"description":"Amazing Celtic folk-rock band that really deserve to be MUCH wider known.\n\n&quot;This is not anyone's granddad's bagpipe playing. Hamish McDoodle and the Kicking Keltic Kaos Krew serve up old-meets-new with a vengeance on Electric Goatland. Yes, it's got Eryri goatskin bagpipes, but seldom have they been played like this. The band has a certain in-your-face attitude, from the instrumental &quot;Bagpipes Make My Balls Itch&quot; to &quot;Dance Police&quot; to &quot;Hallelujah Brother,&quot; which gets the album a parental advisory rating. Give them credit for originality too, though -- who'd have thought death reggae would combine with bagpipes? But on &quot;Bagpipes From Hell,&quot; there it is. And in a harsh yet rhythmic way, they get it to work. Anybody who wants some strange wailing for a Halloween soundtrack could well look to this cut. The pipes are made from the &quot;body and soul of a goat&quot; says their information page (http://artists.mp3s.com/info/26/hamish_mcdoodle__kickingk.html). Maybe that explains some of the sound effects -- &quot;Yehusaya&quot; offers more eerie ululations. One can almost see shadowy figures leaping around in a fire-circle dance. They earn their designation of ethno-techno. They are an enthusiastic trio as well, by the sound of things -- they've got energy out the wazoo on their recordings. So it won't be everybody's platter of haggis. Still, those who enjoy it will probably be shrieking, stamping, clapping, and whistling, like on the opening of &quot;Caernavon Castle Live,&quot; and keeping an ear peeled for a follow-up. ~ Murrday Fisher, All Music Guide&quot;\n\nHamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Bagpipes From Hell.mp3\n\nHamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Bagpipes Make My Balls Itch.mp3\n\nHamish McDoodle/Hamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Caernavon Castle Live.mp3\nHamish McDoodle/Hamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Diddley Squat.mp3\n\nHamish McDoodle/Hamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Fruit Of The Tree 2.mp3\n\nMcDoodle/Hamish Mcdoodle &amp; Kicking keltic kaos krew - Electric Goatland - Synchronisation.mp3\n\n","torrent":{"xt":"urn:btih:165f2efb1a6ea35b06b7b0a4d06f233af8aca29c","amp;dn":"Hamish+McDoodle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165f2efb1a6ea35b06b7b0a4d06f233af8aca29c","infoHashBuffer":{"type":"Buffer","data":[22,95,46,251,26,110,163,91,6,183,176,164,208,111,35,58,248,172,162,156]},"announce":[],"urlList":[]}}