{"title":"Hilary Serie Completa + OST - Tutti i Torrent [DVDrip ITA] TNT V","uid":6181916,"size":45521,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:16f1abec5cf85a3a23d0493485647c8860360472&amp;dn=Hilary+Serie+Completa+%2B+OST+-+Tutti+i+Torrent+%5BDVDrip+ITA%5D+TNT+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":2,"time":1297983983,"description":"Hilary Serie Completa + OST - Tutti i Torrent [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=240660&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=240660&lt;/a&gt;\n\n.: Trama :.\n\nIl manga tratta la storia di Hikari Kamijo (Hilary Kamigi nel doppiaggio italiano), una ragazza di 15 anni che frequenta la scuola superiore e che ha un'enorme passione per la ginnastica ritmica, nata quando vide il suo idolo, Diliana Gueorguiva, vincere un concorso di ginnastica ritmica ad un'etÃƒÂ  giovanissima.\n\nQuando incontra per la prima volta la Gueorguvia, questa si offre di addestrare Hikari in Bulgaria. Hikari accetta la sfida, preferendo perÃƒÂ² restare a vivere nel suo paese, e rapidamente comincia l'addestramento.\n\nAll'inizio, gli sforzi di Hikari (che in giapponese significa &quot;Luce&quot;) non sembreranno portare a buoni risultati, ma tutto cambia quando Hikari conosce Takaaki Ooishi (Willy), un suo compagno di scuola che la aiuta a migliorare le sue abilitÃƒÂ  ginniche. Ooishi ÃƒÂ¨ il ragazzo piÃƒÂ¹ popolare a scuola ed il piÃƒÂ¹ promettente atleta del Giappone. Con l'aiuto ed il supporto di Takaaki Ooishi, il talento di Hikari nella ginnastica ritmica emerge in uno dei tornei locali fra scuole superiori. La bravura che Hikari mostra in questo torneo la rende popolare come migliore ginnasta della sua scuola in competizione con un'altra ginnasta, Hazuki Shina, con la quale stringe una forte amicizia,piena perÃƒÂ² della rivalitÃƒÂ  che la sfida tra le due ragazze comporta.\n\nHazuki (Debbie) ÃƒÂ¨ vista come l'atleta con piÃƒÂ¹ potenziale per le Olimpiadi, benchÃƒÂ© Hikari migliori giorno dopo giorno nelle sue prestazioni. Hikari ha conoscenza quasi naturale dello sport e grazie alla sua capacitÃƒÂ  di osservazione (viene soprannominata &quot;occhio di falco&quot; nella serie TV italiana) puÃƒÂ² imparare delle tecniche migliori di Hazuki e con il tempo puÃƒÂ² sorpassarla. Tuttavia, c'ÃƒÂ¨ qualcosa su cui Hikari deve lavorare: aggiungere eleganza alle sue prestazioni. RaggiungerÃƒÂ  questo obiettivo anche grazie all'aiuto di Mao Natsukawa.\n\nNatsukawa (Federico) nell'anime ÃƒÂ¨ un amico di infanzia di Hikari mentre nel manga frequenta semplicemente lo stesso istituto, e conosce Hikari vedendo una sua gara in tv. Cantante solista di band musicale chiamata &quot;Mister D&quot;,Mao sogna di diventare un rinomato idolo mondiale del rock'n'roll. Nel manga invece, Mao ÃƒÂ¨ figlio di un famoso musicista classico, ma sfonda ugualmente come rocker. Nel frattempo aiuta Hikari a realizzare il suo sogno, scrivendo la musica che Hikari usa durante le sue gare e accompagnandola spesso dal vivo.\n\nNel corso degli anni, Mao capisce di amare Hikari molto profondamente, anche se ÃƒÂ¨ molto difficile per lui esprimerle i suoi sentimenti. Anche se hanno un rapporto molto stretto, Hikari ÃƒÂ¨ innamorata di Ooishi e questo causa dei momenti difficili nell'amicizia tra lei e Mao, che ÃƒÂ¨ a conoscenza del suo affetto per Ooishi, ma le resta comunque vicino contribuendo con la sua musica alla crescita di Hikari come atleta.\n\nQuesto triangolo amoroso presto si trasformerÃƒÂ  in un quadrato quando Hikari scopre che Hazuki ÃƒÂ¨ innamorata di Ooishi. Ora sono non soltanto amiche, ma anche rivali nello sport e in amore. Hazuki ha perÃƒÂ² un grave problema: soffre infatti di anemia aplastica, grave malattia che spesso la tiene lontana dalle gare. Hikari nel frattempo comincia a perfezionare le sue abilitÃƒÂ  e presto inizia a competere a livello nazionale ed internazionale, dove viene a scontrarsi con nuove rivali, come la giovane bulgara Maria Lenova.\n\nLa serie tv finisce qui: tutti i protagonisti lottano per raggiungere il loro sogno, con impegno, coraggio e ottimismo.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img210.imageshack.us/img210/7613/copertina0bo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img210.imageshack.us/img210/7613/copertina0bo.jpg&lt;/a&gt;\n\n.: Crediti :.\n\n\nTitolo originale Hikari no densetsu\nAutore Izumi Aso\nRegia Tomomi Mochizuki\nSceneggiatura * Hideki Sonoda\n* Mami Watanabe\n* Yasushi Hirano\n\nCharacter design * Michitaka Kikuchi\n* Toyoko Hashimoto\n\nStudio Tatsunoko\nMusiche Eiji Kawamura\nAnno 1986\nEpisodi totali 19\nDurata episodi 25 min","torrent":{"xt":"urn:btih:16f1abec5cf85a3a23d0493485647c8860360472","amp;dn":"Hilary+Serie+Completa+%2B+OST+-+Tutti+i+Torrent+%5BDVDrip+ITA%5D+TNT+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16f1abec5cf85a3a23d0493485647c8860360472","infoHashBuffer":{"type":"Buffer","data":[22,241,171,236,92,248,90,58,35,208,73,52,133,100,124,136,96,54,4,114]},"announce":[],"urlList":[]}}