{"title":"Coast to Coast AM - 2011-01-21 - Ancient Aliens","uid":6160867,"size":54766637,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:17afad7e29e7e7ff3a3d736c37ba5b6490a18089&amp;dn=Coast+to+Coast+AM+-+2011-01-21+-+Ancient+Aliens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297208200,"description":"Date: \t01-21-11\nHost: \tGeorge Noory\nGuests: \tGiorgio Tsoukalos\n\nResearcher and publisher Giorgio Tsoukalos discussed the ancient astronaut theory and presented evidence which he believes may prove extraterrestrials visited our planet in the distant past. According to Tsoukalos, the gods and heavenly beings mentioned in ancient religious texts and traditions were likely alien travelers. Further, stories of 'dragon snakes' found in certain early cultures may refer to aerial vehicles piloted by these ETs, as &quot;the gods, or teachers from the sky, actually walked out of the belly of those flying serpents,&quot; he explained. The flying turtle carvings of Guatemala also seem to point to alien interaction with our ancient ancestors, Tsoukalos added.\n\nThe ET visitors tampered with early man's DNA to create human-alien hybrids, he continued, noting how this probably jump-started our ancestor's technological development. Tsoukalos believes an exhibit depicting a recreation of an ancient human at the Darwin Museum in Moscow confirms this hybridization program. Tsoukalos mentioned several puzzling archaeological sites as well, including the famed Cart Ruts of Malta, Ollantaytambo in Peru, and a 400-ton monolithic bridge in India. Local legend says the massive megalithic structure in India was placed there by the gods to facilitate pilgrimages, Tsoukalos said.\n\nTsoukalos also announced that Season 3 of the History Channel series Ancient Aliens has been approved, as well as shared his take on 2012 and the Mayan Calendar. &quot;Nothing will happen,&quot; he declared, adding that the biggest problem will probably be massive hangovers the next day.\n\nOpen Lines followed in the last hour.\n\nNews segment guests: Douglas Hagmann and David Blume\nWebsite(s):\n\n    * legendarytimes.com\n","torrent":{"xt":"urn:btih:17afad7e29e7e7ff3a3d736c37ba5b6490a18089","amp;dn":"Coast+to+Coast+AM+-+2011-01-21+-+Ancient+Aliens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17afad7e29e7e7ff3a3d736c37ba5b6490a18089","infoHashBuffer":{"type":"Buffer","data":[23,175,173,126,41,231,231,255,58,61,115,108,55,186,91,100,144,161,128,137]},"announce":[],"urlList":[]}}