{"title":"Alvin Stardus - My Coo Ca Choo  (Live On Disco 1974)","uid":6234550,"size":30039022,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:17d77a037fd5d4b58ee63487a5fe462c2228f6ec&amp;dn=Alvin+Stardus+-+My+Coo+Ca+Choo++%28Live+On+Disco+1974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Iron_Horse","files":2,"time":1299820153,"description":"Alvin Stardus - My Coo Ca Choo  (Live On Disco 1974)\n\nography  by Dave Thompson  Allmusic.com\nThe name, the sound, and the image were brand new, but when Alvin Stardust first appeared on the British scene in November, 1973, glowering in a tight leather cat suit and professing his love for his little coo-ca-choo, more than one observer took one look at him and said, \\&quot;I know that face.\\&quot; And they did. More than a decade previous, during 1961-1962, this same figure was going under the name of Shane Fenton and scoring hits with two of the most memorable hits of the pre-Beatles \\'60s: \\&quot;I\\'m a Moody Guy\\&quot; and \\&quot;Cindy\\'s Birthday.\\&quot;\n\nSince that time, he had sunk into obscurity, haunting the nightclub circuit with an increasingly tired oldies set, until a meeting with songwriter/producer Pete Shelley suddenly brought him back up to date. Although neither Fenton nor Shelley would ever duplicate the sheer hypnotic magnificence of \\&quot;My Coo Ca Choo,\\&quot; the record which slammed the Alvin Stardust persona into the public eye, they still proved to be one of the most reliable and constantly enjoyable hit making teams of the mid-\\'70s, while Stardust\\'s refusal to retreat back into the shadows has seen him establish himself among Britain\\'s most loved entertainers.\n\nShelley wrote \\&quot;My Coo Ca Choo\\&quot; long before he decided who would perform it; all he knew was he wanted someone \\&quot;who could sing rock &amp; roll, but who looked pretty mean.\\&quot; At the time, after all, the entire country seemed to be consumed by glam rock, with all the perceived superficiality which that portended. Shelley wanted someone who would be seen as the complete opposite of all that. He found it in Shane Fenton.\n\nRedolent as it was of a much earlier era, Fenton\\'s own name, of course, could not be revived. Alvin Stardust, however, sounded utterly up-to-date and, though there were certainly some teething problems in the weeks before \\&quot;My Coo-Ca-Choo\\&quot; was launched (most notably the decision to dress the singer in a pink jumpsuit for his first TV appearance), by the time the record began threatening the Top 40, the Alvin Stardust image was firmly in place. By the time the media at large realized who he really was, an entire generation of pop fans were so entranced that it really didn\\'t matter.\n\nWith a 1950s-style haircut, tight black leather and a permanent scowl, crouched in a stance midway between a fighting fit boxer and the ghost of Gene Vincent, Stardust was the most threatening looking pop star of the age. Even before the Magnet Records publicity department began to move, the media was already showering him with epithets: \\&quot;the Man in Black,\\&quot; \\&quot;the Untouchable,\\&quot; \\&quot;the Star Who Is Forbidden to Smile,\\&quot; \\&quot;the Son of Gary Glitter.\\&quot; Children\\'s television seriously considered banning him from appearing in case he frightened the young viewers, but nothing could halt \\&quot;My Coo Ca Choo.\\&quot; The single rose to number two, before finally being held off the top spot by fellow veteran Gary Glitter. \\&quot;Jealous Mind,\\&quot; which did go all the way to number one, more than compensated for that disappointment and over the next year, into the summer of 1975, Shelley and Stardust produced another five, almost equally memorable, hit singles: \\&quot;Red Dress,\\&quot; \\&quot;You You You,\\&quot; \\&quot;Tell Me Why,\\&quot; \\&quot;Good Love Can Never Die,\\&quot; and \\&quot;Sweet Cheatin\\' Rita.\\&quot;\n\nThe hits stopped after that, but Stardust had already made plans for the future. He had already dropped the leather and the scowl, while his last two singles, in particular, had revealed a sensitive side to the once-demonic performer. With an audience which now included as many parents as children, he turned his attention towards the rock &amp; roll revival circuit and remained a successful live draw well into the early \\'80s.\n\nStardust then engineered a quite remarkable comeback, signing to the Stiff Records label and returning to the chart with \\&quot;Pretend.\\&quot; It reached number four during fall 1981 and while Stardust then lapsed back into silence, it was only fleeting. In May, 1984, \\&quot;I Feel Like Buddy Holly\\&quot; returned him to the U.K. Top Ten, to be followed by \\&quot;I Won\\'t Run Away\\&quot; and the festive favorite \\&quot;So Near to Christmas.\\&quot; He celebrated 25 years of chart success the following year when \\&quot;Got a Little Heartache\\&quot; breached the Top 60. It was to prove his final hit; since that time, Alvin Stardust has remained a fixture on the live circuit, eminently capable of appearing on both glam and rock &amp; roll revival bills.","torrent":{"xt":"urn:btih:17d77a037fd5d4b58ee63487a5fe462c2228f6ec","amp;dn":"Alvin+Stardus+-+My+Coo+Ca+Choo++%28Live+On+Disco+1974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d77a037fd5d4b58ee63487a5fe462c2228f6ec","infoHashBuffer":{"type":"Buffer","data":[23,215,122,3,127,213,212,181,142,230,52,135,165,254,70,44,34,40,246,236]},"announce":[],"urlList":[]}}