{"title":"Codigo Lyoko Temporada 3 by JKRILIN","uid":6250110,"size":3052695552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1841fb0c0f61ad9c4718bc865c023513383ac1f3&amp;dn=Codigo+Lyoko+Temporada+3+by+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gaditano_cc","files":13,"time":1300379708,"description":"En la tercera temporada, XANA logra poseer a Aelita y le ordena que borre todos los sectores menos el sector 5, donde ÃƒÂ©l habita. A pesar de que el grupo de amigos trata de impedirlo, XANA tiene ÃƒÂ©xito en su operaciÃƒÂ³n. Sin embargo, despuÃƒÂ©s de todo, Jeremy frustra los planes de la entidad maligna encontrando un mÃƒÂ©todo por el cual entrar en el sector cinco sin necesidad de hacerlo por medio de otro sector.\nConsiderando que XANA ahora es mÃƒÂ¡s poderoso que antes, el grupo decide reclutar a William Dunbar al equipo. Esto resulta ser un error desastroso ya que la Scyphozoa logra poseerlo y XANA consigue inutilizar el superordenador y, supuestamente, tambiÃƒÂ©n destruye Lyoko. Dentro de la mÃƒÂ¡quina vacÃƒÂ­a e inÃƒÂºtil, William se transforma en una versiÃƒÂ³n oscura de sÃƒÂ­, controlado por la voluntad de XANA.\nEn esta temporada Aelita ya es libre, por lo que sin Lyoko puede permanecer viva de todos modos. Aunque Aelita ya sea libre, XANA por desgracia, tambiÃƒÂ©n lo es, asÃƒÂ­ que no apagan el superordenador para poder seguir luchando contra XANA. Y la destrucciÃƒÂ³n del mundo virtual obstruirÃƒÂ­a las posibilidades de que pueda conocer a Franz Hopper, su padre, pero increÃƒÂ­blemente Jeremy recibe un mensaje cifrado de ÃƒÂ©l a travÃƒÂ©s de Internet, que demuestra que no todo estÃƒÂ¡ perdido.\n","torrent":{"xt":"urn:btih:1841fb0c0f61ad9c4718bc865c023513383ac1f3","amp;dn":"Codigo+Lyoko+Temporada+3+by+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1841fb0c0f61ad9c4718bc865c023513383ac1f3","infoHashBuffer":{"type":"Buffer","data":[24,65,251,12,15,97,173,156,71,24,188,134,92,2,53,19,56,58,193,243]},"announce":[],"urlList":[]}}