{"title":"Details for CorkScrew Fallout New Vegas For Linux","uid":6286114,"size":7242698230,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:188d22f598feb94029ad5ab299aa9b6f659f0bab&amp;dn=Details+for+CorkScrew+Fallout+New+Vegas+For+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"evilgold","files":7,"time":1301621526,"description":"CorkScrew\n\nTitle: Fallout: New Vegas\nType: Game - Action/RPG\nRating (appdb): Gold\nDate: 2011, 03-31\nRelease Source: SKIDROW\nAppDB Link: http://appdb.winehq.org/objectManager.php?sClass=version&amp;iId=21692\nNotes: This release contains all the updates released from SKIDROW up till now, including the downloadable extras and Dead Money.\n\nAbout:\n\nCorkScrews are prepackaged wine prefixes inspired by the &quot;Wine bottle&quot; of\nCrossover (cxgames.). This package was built using ArchLinux and also tested on Ubuntu 10.04, it should work properly on any Linux distribution with wine properly installed.\n\nTo install the game run installer.sh. This will extract the archive to ~/.wine/wineprefixes/FalloutNewVegas. \n\nTo launch the game execute the script located in ~/bin, either by double clicking on it, or from a terminal enter: &quot;~/bin/falloutnv&quot; (case sensative). I reccomend adding $HOME/bin to your PATH, especially if you want to use more then one corkscrew (hint: google it). A desktop launcher is not included with this release, but you can easily make one yourself using the included icon.\n\nTo uninstall delete the FalloutNewVegas folder in ~/.wine/wineprefixes.\n\nI encourage you to package, test, and distribute CorkScrews of other applications and games. This package along with the installer can be freely redistributed and/or modified only by qualified software pirates. If you are happy to see a game or program you like running on linux be sure to let the developers know. \n\nFor other packages just search &quot;CorkScrew&quot; on your favorite torrenting site. \n\nAny requests/feedback/questions/issues/comments/virgin offerings, are welcome. Leave a comment or find me on freenode IRC as &quot;evilgold&quot;.\n\nThanks to Skidrow for the original scene release and crack.\n\nPlease do not download this release unless you are able to seed it for a while. If you are unable to seed, please download the original SKIDROW release instead (it already has lots of seeds).","torrent":{"xt":"urn:btih:188d22f598feb94029ad5ab299aa9b6f659f0bab","amp;dn":"Details+for+CorkScrew+Fallout+New+Vegas+For+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188d22f598feb94029ad5ab299aa9b6f659f0bab","infoHashBuffer":{"type":"Buffer","data":[24,141,34,245,152,254,185,64,41,173,90,178,153,170,155,111,101,159,11,171]},"announce":[],"urlList":[]}}