{"title":"MyPlan Entreprise Network 1.22 Bilingual [ak]","uid":6150976,"size":31156743,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:19e000b3ccb22b0c593b2ab994010e47003d105c&amp;dn=MyPlan+Entreprise+Network+1.22+Bilingual+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1296877733,"description":"MyPlan Entreprise Network 1.22 Bilingual\n\nmyPlan is a user-friendly but flexible scheduling system, with which you can manage variably schedule types for your company. It is mostly recommended for small companies or companies who must generally schedule staff, machines, cars etc. You can also schedule rooms or individual other kinds of schedule types. We emphasized to realize an easy and intuitive handling of the application.\n\nDetails:\n\n* Unlimited number of different types of schedules can be managed (depending on version)\n* Many predefined schedule types are delivered (staff, machines, cars etc.)\n* Individual schedule types can be created (depending on version)\n* Many different input fields are available for each schedule\n* The input fields can be renamed and also rearranged in the input form (depending on version)\n* Schedules can also be created as recurrence dates (depending on version)\n* The schedule view can also be displayed in different variants (daily, weekly, monthly, yearly or chronological).\n* Also a tabular view of the schedules is possible (depending on version)\n* The different views can be customized in many ways.\n* Schedule entries can be assigned to groups (e.g. teams, departments etc.)\n* The schedule view can be limited by filter (e.g. only certain resources, certain groups etc.)\n* The schedule view can be printed in different ways.\n* Every schedule can include an unlimited number of so called resources (a resource for example is a person or a car). These resources are combined to groups (resource groups)\n* The look and feel of the whole application can be changed in many ways.\n* A customer management is included. Schedule items can be assigned to customers (depending on version)\n* Also to-do or pin board entries can be managed (depending on version)\n\nHome Page - http://www.jv-soft.com/myplan\n\n","torrent":{"xt":"urn:btih:19e000b3ccb22b0c593b2ab994010e47003d105c","amp;dn":"MyPlan+Entreprise+Network+1.22+Bilingual+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19e000b3ccb22b0c593b2ab994010e47003d105c","infoHashBuffer":{"type":"Buffer","data":[25,224,0,179,204,178,43,12,89,59,42,185,148,1,14,71,0,61,16,92]},"announce":[],"urlList":[]}}