{"title":"Coast to Coast AM Feb 09 2011 - Vaccination Issues","uid":6165798,"size":55653937,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1e12492726e65482b6a66ab265548043fa6cb939&amp;dn=Coast+to+Coast+AM+Feb+09+2011+-+Vaccination+Issues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":6,"time":1297382337,"description":"Date: 02-09-11 \nHost: George Noory \nGuests: Mary Holland, Andrew Wakefield, Michio Kaku \n\nMary Holland, a research scholar at NYU School of Law, discussed issues related to vaccination, health, and human rights. In the book Vaccine Epidemic, which she co-edited with Louise Kuo Habakus, they feature a variety of experts from such fields as ethics, science, medicine, and business, who call for reform in the compulsory mandating of vaccinations, and a reevaluation of their safety. &quot;At the end of the day, because every vaccination carries real risks...it has to be the individual with their healthcare practitioner that makes an informed choice,&quot; she said, adding that her objection is not to the vaccines, but the &quot;forcing of the products on children or people.&quot; Often, if they don't accept the vaccine, they can't go to work or school, she noted. \nAppearing for a segment at the top of the third hour, British journalist Brian Deer spoke about his investigation into Andrew Wakefield's research of children's vaccines. He suggested Wakefield perpetuated a fraud, and was rewarded with a large monetary payout. Then, Dr. Andrew Wakefield joined the show, to refute Deer's charges, and speak about the connection he uncovered between MMR and other vaccines to health problems such as autism. Further info. \nHolland cited how children are typically receiving multiple vaccines at one time, sometimes being exposed to as many as seven different diseases, and when problems are reported it is often in these cases. She recommended that parents get educated on the topic and review their options with their doctors. She is active in the organization, Center for Personal Rights, which focuses on individual vaccination choice. \n","torrent":{"xt":"urn:btih:1e12492726e65482b6a66ab265548043fa6cb939","amp;dn":"Coast+to+Coast+AM+Feb+09+2011+-+Vaccination+Issues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e12492726e65482b6a66ab265548043fa6cb939","infoHashBuffer":{"type":"Buffer","data":[30,18,73,39,38,230,84,130,182,166,106,178,101,84,128,67,250,108,185,57]},"announce":[],"urlList":[]}}