{"title":"Big Book of Dragons, Monsters and Other Mythical Creatures - E&amp;J","uid":6185935,"size":21546239,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2130ce136c181076ac64dfa46741b2380b279438&amp;dn=Big+Book+of+Dragons%2C+Monsters+and+Other+Mythical+Creatures+-+E%26J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1298107888,"description":"Big Book of Dragons, Monsters, and Other Mythical Creatures by Ernst and Johanna Lehner\n\nFrom the back cover:\n\nThis intriguing volume provides a glimpse of the imaginary animals and monsters that existed in ancient man's fertile imagination. Dramatic illustrations of dragons, griffins, werewolves, serpent monsters, sirens, mermaids, and other fabulous creatures of land, sea, and air are accompanied by an engrossing text with legends from around the world.\n\nHere, too, are portrayals of such legendary beasts as the unicorn, sphinx, centaur, and the plumed serpent-bird of the Aztecs, as well as images of the whale, octopus, salamander, ostrich, armadillo, and other real animals once associated with magical or supernatural powers.\n\nAn invaluable source of permission-free art for artists and designers, as well as an excellent reference for folklorists and students of mythology, this splendid archive will delight anyone interested in creatures of myth and legend.\n\nDover Pictorial Archive Series, first published in 1969, reprinted in 2004\n\nWhen I scanned this from the public library, the book was out of print. It's since been reissued in softcover.  A wonderful book.\n\nIf torrent fails, download from\n\n","torrent":{"xt":"urn:btih:2130ce136c181076ac64dfa46741b2380b279438","amp;dn":"Big+Book+of+Dragons%2C+Monsters+and+Other+Mythical+Creatures+-+E%26J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2130ce136c181076ac64dfa46741b2380b279438","infoHashBuffer":{"type":"Buffer","data":[33,48,206,19,108,24,16,118,172,100,223,164,103,65,178,56,11,39,148,56]},"announce":[],"urlList":[]}}