{"title":"coast to coast am 2011-03-13 - UFO Happenings &amp; Secret Societies","uid":6242607,"size":57524834,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:23e7e8482b755343f8fe7bdf1572fbf2d191d719&amp;dn=coast+to+coast+am+2011-03-13+-+UFO+Happenings+%26+Secret+Societies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":6,"time":1300124265,"description":"\n\nUFO Happenings &amp; Secret Societies\n---------------------------------\nDate: 03-13-2011\nHost: Whitley Strieber\n\nGuests: Richard Dolan, Mark Booth\n\n\nDuring the first three hours, guest host Whitley Strieber was joined by researcher Richard Dolan, who talked about current UFO happenings as well as the prospect for disclosure. He expressed dismay at the news that the UK Ministry of Defense files related to the infamous Rendlesham UFO event had gone missing. Dolan was skeptical of the idea that the destruction of the files was merely a bureaucratic mix up, since, in the United States, the Roswell files suffered a similar fate. However, he also speculated that the disappearance of the files may have had less to do with UFOs and more to do with the nuclear weapons that were secretly being stored at the Bentwaters base, a fact which the UK government continues to deny to this day. \n\n&quot;The clock is ticking on it. It cannot last forever,&quot; Dolan mused about the secrecy surrounding UFOs. While he stressed the inevitability of disclosure, he theorized that it would only happen if the government was forced to reveal the truth about UFOs. The two scenarios he sees as most likely causing this to happen are either a major sighting of a UFO that cannot be attributed to Earthly technology or a Wikileaks-esque revelation of &quot;a damning statement that attests to the reality of this that cannot be denied.&quot; Additionally, Dolan noted that even if government officialdom confirms that UFOs are real, they will still have to prove it to &quot;a very deeply skeptical scientific community around the world.&quot; \n--------------------\nIn the final hour, professor Mark Booth discussed his research into secret societies, their teachings, and evolution. He put forward the concept that the secret societies began, in ancient times, as &quot;mystery schools.&quot; According to Booth, initiates of these groups were taught, over time, how to commune with &quot;disembodied intelligences&quot; which shared insights into the nature of mankind. Having been told of the eventual return of mankind's creator, the mystery schools drew the persecution of the religious and political leaders of the day and were forced into becoming secret societies. Ultimately, rather than sinister organizations bent on world domination, Booth opined that contemporary secret societies are &quot;guardians of an underground stream of spirituality that has guided humanity on it's way down the ages.&quot; \n\nBooth also detailed the nature of the Antichrist and his agenda. &quot;There is a tradition in the secret societies that, just as 2000 years ago, Christ incarnated, so, in our time, Satan will incarnate,&quot; he revealed. Based on his research, Booth claimed that the Antichrist will seem to perform miracles, but will be able to explain them in scientific terms. The reasoning behind this, he explained, is because Satan will aim to show that &quot;the supernatural and the spiritual are unreal&quot; and, thus, push humanity into becoming &quot;completely materialistic.&quot; While he admitted that he does not know the identity of the Antichrist, Booth was ominously certain that the evil entity is currently present on the Earth. \n\nWebsites:\nthesecrethistoryoftheworld.com\nafterdisclosure.com\nkeyholepublishing.com\n\nBooks:\nThe Secret History of the World\nA.D.: After Disclosure\n\nthanks to my sorce of this show, I'd love to name you, but you might not like that so, you remain unamed, but greatly appreciated. without you I couldn't share this with others...","torrent":{"xt":"urn:btih:23e7e8482b755343f8fe7bdf1572fbf2d191d719","amp;dn":"coast+to+coast+am+2011-03-13+-+UFO+Happenings+%26+Secret+Societies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e7e8482b755343f8fe7bdf1572fbf2d191d719","infoHashBuffer":{"type":"Buffer","data":[35,231,232,72,43,117,83,67,248,254,123,223,21,114,251,242,209,145,215,25]},"announce":[],"urlList":[]}}