{"title":"Douglas Reed - Insanity Fair (1938)","uid":6206364,"size":399960468,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:23ee36231474ab563f5c30d6b04a8ca80d9f467b&amp;dn=Douglas+Reed+-+Insanity+Fair+%281938%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DragonKP","files":-1,"time":1298822396,"description":"Hidden History - Nazis, Hitler, Jews.\n\n-------\nFriendly WARNING for Audio Quality Purists:\nIt's COMPUTER GENERATED VOICE and NOT book read by human reader!\n\nIf you don't like this fact then simply DO NOT download it and complain later.\n-------\n\nIntro from the book:\n\nPublisher's Note. \n\nDouglas Reed was living in Vienna in 1937 and in the beginning of 1938 when he wrote this book. While the book was in the press the storm broke. \n\nThe publishers could easily have edited the chapters on Austria to recognize the changes already accomplished. But by this means much of the vividness of the author's first-hand account of the last days of Austrian independence would have been lost. \n\nTherefore the chapter on Austria (chapter 32) was allowed to stand as it is written. All but the last four paragraphs of it was written before events began to move; and this part shows how clearly the author felt the suspense that lay over the country and shared the anxiety of its inhabitants. The last four paragraphs of Chapter 32 were written after von Schuschnigg visited Hitler at Berchtesgaden, and these paragraphs show equally clearly that Douglas Reed then immediately recognized the end of Austria to be imminent. It came a month later, and Chapters 44, 45, 46 and 47 (which were incorporated after the second impression) describe how it happened. \n\nIn these chapters the reader sees a sound prediction, based on knowledge and experience, come true. \n\n\nAuthor's Note. \n\nNone of the characters in this book is imaginary. They all exist, believe it or not. \n\nNone of the opinions expressed in this book commits any third party. They are mine, all mine, and nobody's but mine. \n\nNone of the material in this book has been published before, but I wrote a full-length book about the Reichstag Fire, which is briefly discussed in this volume, and it was published (The Burning of the Reichstag) by Messrs. Victor Gollancz. \n","torrent":{"xt":"urn:btih:23ee36231474ab563f5c30d6b04a8ca80d9f467b","amp;dn":"Douglas+Reed+-+Insanity+Fair+%281938%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ee36231474ab563f5c30d6b04a8ca80d9f467b","infoHashBuffer":{"type":"Buffer","data":[35,238,54,35,20,116,171,86,63,92,48,214,176,74,140,168,13,159,70,123]},"announce":[],"urlList":[]}}