{"title":"La_Criatura_Perfecta.avi","uid":6141129,"size":729145344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26e58f7f2a84aca856f3f277a093f19f894e9f97&amp;dn=La_Criatura_Perfecta.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"erato99","files":1,"time":1296502767,"description":"Calidad de video: DVD RIP\nPeso: 695 mb\nIdioma del audio: EspaÃƒÂ±ol \n\nHace tres siglos, en un mundo similar al nuestro, un alquimista italiano descubriÃƒÂ³ accidentalmente los secretos de la ciencia genÃƒÂ©tica. Al hacerlo, el alquimista desencadenÃƒÂ³ una oleada de virulentas enfermedades contra las que la raza humana lucha todavÃƒÂ­a. Otra consecuencia de estos experimentos fue la creaciÃƒÂ³n accidental de una nueva raza de personas: los Hermanos, resultante de una mutaciÃƒÂ³n genÃƒÂ©tica provocada por un virus y que sÃƒÂ³lo se manifiesta en los varones. Los Hermanos son seres superiores, fÃƒÂ­sica y mentalmente, que se han convertido en los guardianes de la ciencia genÃƒÂ©tica y se han dedicado a mantener a buen recaudo el peligro potencial que encierra esa ciencia. Los Hermanos tambiÃƒÂ©n ayudan a la humanidad a combatir las enfermedades que periÃƒÂ³dicamente asolan el planeta. Se trata de una relaciÃƒÂ³n simbiÃƒÂ³tica, a cambio de su compromiso de preservar la vida humana, los Hermanos sÃƒÂ³lo piden a la humanidad una cosa: su sangre. Los Hermanos son vampiros, no de la clase de vampiros que alimenta el mito europeo, sino unas criaturas vivientes de carne y hueso: quizÃƒÂ¡s el prÃƒÂ³ximo eslabÃƒÂ³n de la cadena de la evoluciÃƒÂ³n. Entonces surge un problema que amenaza con destruir esta armonÃƒÂ­a. Uno de los Hermanos ha hecho algo que ningÃƒÂºn otro habÃƒÂ­a hecho jamÃƒÂ¡s\n\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:26e58f7f2a84aca856f3f277a093f19f894e9f97","amp;dn":"La_Criatura_Perfecta.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e58f7f2a84aca856f3f277a093f19f894e9f97","infoHashBuffer":{"type":"Buffer","data":[38,229,143,127,42,132,172,168,86,243,242,119,160,147,241,159,137,78,159,151]},"announce":[],"urlList":[]}}