{"title":"Complete Cosmos - Reis door de Ruimte - DVD 1 TBS","uid":6230812,"size":4497630369,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2845b4bff72380c26f135fccba47c1bb945550c7&amp;dn=Complete+Cosmos+-+Reis+door+de+Ruimte+-+DVD+1+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1299707402,"description":"\n\n\n\nComplete Cosmos - Reis door de Ruimte -Het zonnestelsel DVD 1\n\n\n\nEen kompleet naslagwerk bij u thuis? De nieuwste wetenswaardigheden over ons heelal op 2 DVD's . Schitterende beelden gebracht in een heldere taal. Genieten voor wie meer wil weten over onze cosmos?\n\nUpdate van de laatste ontwikkelingen in de ruimte en de astronomie. Link naar een website met 50.000 zoekwoorden met achtergrond over deze serie. Links met interessante websites over ruimte en astronomie.\n\nHub of the planets\n- De zon: Geboorte, leven en dood van de zon, de krachten binnenin, het vuurwerk buiten. Zonnevlekken, corona, zonnewind ? de nieuwste ontdekkingen over de zon!\n- Mercurius: Eindelijk een duidelijk en compleet portret van deze verschroeide mini-planeet ? de dubbele zonsopgang, kraters, kloven en geheel onverklaarbaar! ? de vermoedelijke aanwezigheid van poolijs.\n- Venus: Onder de wolken? het inferno! Een uiterst giftige, verpletterende atmosfeer ? Verschroeiende hittes, vulkanen en een op hol geslagen 'broeikaseffect'. Waarom?\n\nEarthspace\n- De aarde: De evolutie van de aarde en van het leven. De interne structuur. De wegdrijvende continenten ? dag en nacht ? de seizoenen ? de oceanen ? het klimaat ? het weer ? El NiÃƒÂ±o.\n- De maan: De kosmische botsing ? de geschiedenis van de maan ? haar invloed op de aarde ? de Apollo-landingen ? de recente ontdekking van water.\n- Eclipsen en Aurorae: Hemelshows. Hoe de zonnewind een aurora doet ontstaan. Alles over maan- en zonne-eclipsen. De zonne-eclips van 1998.\n\nMars, life and impacts\n- Mars: Mars, koud en dor. De volgende planeet waarop de mens z'n voet zal zetten. Poolkappen, vulkanen, de grootste canyon ooit waargenomen ? wellicht waren op Mars ooit oceanen.\n- Zoektocht naar leven: Is er nog ergens leven in het Zonnestelsel? Bijvoorbeeld op Jupiters maan Europa? In de toekomst op Saturnus' maan Titan?\n- Botsing: De dreiging van kometen en asteroÃƒÂ¯den. Wat zou er gebeuren als de &quot;ruimterots&quot; die de dinosaurussen doodde vandaag New-York zou treffen?\n\nThe outer planets\n- Jupiter: Groter dan alle andere planeten tesamen ? een reusachtige gasbol met 16 manen - een reis door z'n mini-zonnestelsel.\n- Saturnus: De vele ringen en manen van deze exotische gasplaneet. Voorproefje van een landing op Titan, een primitieve, maanachtige aarde.\n- Uranus en Neptunus: De verste reuzen. Uranus ? een waanzinnige planeet met een chaotische maan die luistert naar de naam Miranda. Neptunus en haar vreemde maan met opspuitende geisers.\n- De wereld van de kometen: Kometen en hun oorsprong ? de Oort Wolk en de Kuiper Ring. Misschien is het kleine Pluto wel geen echte planeet.\n\n\n\n\nSpotinformatie \n\n\nCategorie \t: Beeld \nFormaat \t: DVD5 \nAudio           : Nederlans en Engels\nBron\t        : Retail\nOndertitels     : Nederlands (instelbaar)/Engels (instelbaar)\nGenre           : Documentaire\n\n\nBrought to you by TBS","torrent":{"xt":"urn:btih:2845b4bff72380c26f135fccba47c1bb945550c7","amp;dn":"Complete+Cosmos+-+Reis+door+de+Ruimte+-+DVD+1+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2845b4bff72380c26f135fccba47c1bb945550c7","infoHashBuffer":{"type":"Buffer","data":[40,69,180,191,247,35,128,194,111,19,95,204,186,71,193,187,148,85,80,199]},"announce":[],"urlList":[]}}