{"title":"Evil.Anal.13.XviD-PORNOLATiON","uid":6283583,"size":1455516176,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2994a0bd46d36274baeae351592feff390b28de6&amp;dn=Evil.Anal.13.XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TvTeam","files":5,"time":1301532090,"description":".\n &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt;  :  The Hottest xXx Torrent Site On the Net!\n &lt;a href=&quot;\nHTTP://WWW.TORRENTDAY.COM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://WWW.TORRENTDAY.COM&lt;/a&gt;\n\n\nEnjoy =)         www  TorrentDay  Com\n\n...................................NFO:....................................\n\n.                                                              \n             PORNOLATiON...                              \n                                                       \n                                               \n       GETS...                    \n                            \n                        \n           YOU...       \n                               \n                 \n   WET!!!         \n                                  \n                         \n                     \n                         \n                         \n                                \n                                 \n                                 \n                                \n                                               \n                                                       \n                  `high!HoA                            \n                                                        \n                                                  \n                                             \n                                    \n                            \n                               \n                         \n                       \n                          \n                           \n                               \n                                          \n                                               \n                                               \n                                                 \n                                             \n                                                                \n                                                             \n                                                             \n                                                                   \n                                                                       \n                                                                      \n                                                                   \n                                                             \n                                                          \n                                                    \n                                            \n                                \n                                           \n                          \n                            \n                          \n                                \n                               \n                               \n                             \n                                 \n                                        \n                                               \n                                              \n                                                   \n                                                     \n                                                 \n                                              \n                                               \n                                               \n                                         \n                               \n                     \n                 \n               \n              \n                \n\n\n| \n|||||||\n||||||||\n|||||||\n||||||||\n|||||||||\n||\n\n\n---&gt; PORNOLATiON PRESENTS...\n\n \n Title          : Evil Anal #13 (C) Evil-Angel\n Release date   : 26 Mar 2011\n Store Release  : 24 Mar 2011\n\n Size           : 2 CDs\n Source Format  : NTSC DVD\n Format         : XviD\n Resolution     : 4:3\n Audio          : VBR MP3 \n \n Language       : English\n Category       : Anal\n \n URL            : http://store.evilangeldirect.com/details.link/tid/997191/\n                  special/Evil-Anal-13.htm\n\n\n                               \n - Release Info - ---&gt;\n                               \n\n French-born director/stud Manuel Ferrara's &quot;Evil Anal&quot; series won the 2011 AVN\n Award for Best Anal-Themed Series, and lucky Evil Anal 13 continues the tradition.\n The disc includes behind-the-scenes footage, cumshot recap, photo galleries,\n cast list, filmographies, and trailers.\n\n Nighttime in a parking lot: Two tough guys meet -- One is Manuel, paying the\n ransom for kidnapped Asian sex doll Asa Akira. He brings the bound victim to \n his apartment; Asa begs her rescuer for a good butt-fuck before being returned\n to her wealthy family. She peels out of her jean shorts and Manuel smacks her\n ass, then tongues her bunghole and shaved pussy. He fingers her G-spot, shoves\n a black dildo down Asa's throat and thrusts his huge prick into her sucking\n mouth. She pumps her ass with the toy while riding on Manuel's fat dick. He\n gives her a deep butt-reaming and has Asa lick his hairy anus while he jacks\n his pole. Asa sucks Manuel's toes and shoves several fingers into her gaping\n asshole. He sodomizes the exotic nymphomaniac until it's time for a messy \n ass-to-mouth facial.\n\n In the next scene, sexy, fur-wearing slut Chanel Preston picks up filthy\n homeless guys Steve Holmes and Mick Blue in her limousine. She carts them to \n her mansion and gives each a sensuous sponge bath, a shave and new suit, \n making the street dwellers look like successful businessmen. Dressed in\n nothing but pearls and black stockings, Chanel kneels to suck off their cocks.\n The horny altruist gets manhandled by the two gentlemen, loving every minute\n as they stuff all three of her holes. At the climax of a deep face-fucking, \n Chanel opens wide for a couple of cum loads.\n\n The following scene features Manuel as a dirty L.A.P.D. cop. He eats donuts\n in his patrol car while sexy blonde whore Amy Brooke blows him. Responding to\n a call, he kicks her out of his cruiser and heads for the crime scene. Officer\n Manuel finds petite Kristina Rose bound with red vinyl tape and sucking an\n enormous dildo, her ass and pussy filled with sex toys. The corrupt patrolman\n takes advantage of the situation and rams his nightstick into Kristina's ass, \n followed by his meat stick down her throat. The little Latina sucks his taint,\n licks his feet, gets his big toe in her pussy and up her butt. The horse-hung\n pig screws all of Kristina's tiny openings. She sucks his shaft ass-to-mouth \n and earns a massive facial.\n\n Finally, Asian/French beauty Katsuni does a scheduled sex scene with Monsieur\n Ferrara. Oral and anal copulation are accented with choking, face-slapping,\n foot-sucking, teabagging and sex talk in the Language of Love. Ah, romance... \n She's blindfolded and three of Manuel's big-dicked buddies skull-fuck the\n mademoiselle. Manuel and accomplices decorate Katsuni's lovely face and mouth\n with four loads of jism. Les bon temps roulez in Manuel's nasty, ass-flavored\n vignettes!\n\n Starring: Steve Holmes, Manuel Ferrara, Mick Blue, Julius Ceazher, Jon Jon,\n           Kristina Rose, Katsuni, Asa Akira, DSnoop, Amy Brooke, Chanel Preston\n\n                       \n - News - ---&gt;\n                       \n\n We Release Movies For Free. We Do It For Fun, And We Do It For No Profit\n Except The Satisfaction Of Spreading The Wealth.\n\n WE DO NOT ACCEPT MONEY BRIBES\n WE DO NOT GIVE YOU LINKS OR FILL FILES FOR OUR RELEASES !!\n WE DO NOT RUN WWW LINK NOR AN IRC CHANNEL NEVER EVER !!\n WE DO NOT PROVIDE HELP FOR MISSING FILES / BAD FILES\n WE DO NOT CONDONE SELLING MOVIES FOR PROFIT &lt;-- BAD !!\n WE DO NOT NEED COURIERS\n\n IRC  : NEVER EVER.\n WWW  : NEVER EVER.\n\n  \n - Editorial - ---&gt;\n\n\n You wish.\n\n - Members - ---&gt;\n\n\n Nope.\n\n\n - Greetings - ---&gt;\n\n\n your mother\n\n \n - Disclaimer - ---&gt;\n\n\n\n - Final Words - ---&gt;\n\n\n Preach..\n\n                                                                     \n&lt;---  - ASCii By `high24[7 @ HighOnASCii 2006 -","torrent":{"xt":"urn:btih:2994a0bd46d36274baeae351592feff390b28de6","amp;dn":"Evil.Anal.13.XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2994a0bd46d36274baeae351592feff390b28de6","infoHashBuffer":{"type":"Buffer","data":[41,148,160,189,70,211,98,116,186,234,227,81,89,47,239,243,144,178,141,230]},"announce":[],"urlList":[]}}