{"title":"Call of Duty Collections DVD5-TeaMGENTi[WBZ Xclusive]","uid":6269548,"size":39449082778,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:29c82e76d1c3607eeb80a4169d637dc752fb8cb7&amp;dn=Call+of+Duty+Collections+DVD5-TeaMGENTi%5BWBZ+Xclusive%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hshahaz","files":43,"time":1301029954,"description":"[img]http://www.imagefreeks.com/out.php/i365_x5y3E4Fp.jpeg[/img]\n\n Call of Duty (c) Activision\n\n\nRelease Date: Oct 29, 2003\nReview Score: 9.0 - GameSpot\nSize: 1 DVD\nGame Type: Historic First-Person Shooter\nProtection: Safedisc\n\nGame Notes\n~~~~~~~~~~\nCall of Duty is an intense first-person action game that allows players to experience the movie-like intensity and gripping combat of World War II as never before through the eyes of ordinary soldiers, fighting as part of a squad through the chaos of battle.\n\nDeveloped by Infinity Ward, which is comprised of over 20 individuals who developed Medal of Honor: Allied Assault including all the production leads, Call of Duty delivers the gritty realism and cinematic intensity of WWIIs most epic battlefield moments from the perspective of citizen soldiers and unsung heroes representing an alliance of countries, who together helped shape the course of modern history. Throughout the games 24 missions, players will be part of a squad, who bond together to take on enemy forces and achieve mission objectives through pivotal WWII battles and authentic military campaigns.\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. When asked for a serial enter one from the Serial folder on the DVD!\n4. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n5. Play the game !\n6. Thanks DEVIANCE for the crack and Activision for the game.\n7. Support the software developers. If you like this game, BUY IT!\n\n[img]http://www.imagefreeks.com/out.php/i364_xpSXtJsb.jpeg[/img]\n\n\nCall of Duty 2 (c) Activision\n\n\nRelease Date: Oct 25, 2005\nReview Score: 8.8 - GameSpot\nSize: 1 DVD\nGame Type: Historic First-Person Shooter\nProtection: Safedisc 4.60\n\nGame Notes\n~~~~~~~~~~\nThe sequel to the award-winning Call of Duty, Call of Duty 2 is powered by a proprietary new engine featuring striking new visuals, advanced A.I. technology, the most realistic squad combat and explosive action in new historic campaigns.\n\n* Call of Duty 2 lets players experience four individual soldier stories as they overcome insurmountable odds in multiple campaigns. Players have the freedom to follow each of the four storylines through for the ultimate character-driven experience, or they can engage in the historic battles chronologically for quick hitting action.\n* Infinity Ward, creator of the blockbuster, original Call of Duty, has also expanded the scope of combat to deliver a truly realistic battlefield experience. Squads now have the freedom to take on a variety of mission objectives, on expansive battlefields that allow for multiple paths and the ability to utilize actual combat tactics like outflanking and fire and maneuver capabilities.\n* Call of Duty 2s new engine and A.I. technology set the stage for authentic squad combat and astonishing action. Concealment can be key as battlefield smoke or even deployed smoke grenades cloud visibility. Weather effects such as the dusty sandstorms of North Africa and whiteout blizzard conditions of Russia, for example, will keep soldiers glued to their bunkers. The team has also employed a state-of-the-art Battle Chatter System that brings the action to life as squad-mates bark out context-sensitive updates in real-time to players through an advanced A.I. system.\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. When asked for a serial enter one from the Serial folder on the DVD!\n4. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n5. Play the game !\n6. Thanks DEVIANCE for the crack and Activision for the game.\n7. Support the software developers. If you like this game, BUY IT!\n\n[img]http://www.imagefreeks.com/out.php/i363_tADxWbK8.jpeg[/img]\n Call of Duty 4: Modern Warfare (c) Activision\n\n\nRelease Date: Nov 9, 2007\nReview Score: 9.0 - GameSpot\nSize: 2 DVDs\nGame Type: Modern First-Person Shooter\nProtection: Steamworks\n\nGame Notes\n~~~~~~~~~~\nThe new action-thriller from the award-winning team at Infinity Ward, the creators of the Call of Duty series, delivers the most intense and cinematic action experience ever. Call of Duty 4: Modern Warfare arms gamers with an arsenal of advanced and powerful modern day firepower and transports them to the most treacherous hotspots around the globe to take on a rogue enemy group threatening the world. As both a U.S Marine and British S.A.S. soldier fighting through an unfolding story full of twists and turns, players use sophisticated technology, superior firepower and coordinated land and air strikes on a battlefield where speed, accuracy and communication are essential to victory. The epic title also delivers an added depth of multiplayer action providing online fans an all-new community of persistence, addictive and customizable gameplay.\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. When asked for a serial enter one from the Crack folder on the DVD!\n4. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n5. Play the game !\n6. Thanks RAZOR1911 for the crack and Activision for the game.\n7. Support the software developers. If you like this game, BUY IT!\n\n\n[img]http://www.imagefreeks.com/out.php/i362_j65S0gut.jpeg[/img]\n Call of Duty: World at War (c) Activision\n\n\nRelease Date: Nov 10, 2009\nReview Score: 8.5 - GameSpot\nSize: 2 DVDs\nGame Type: Historic First-Person Shooter\nProtection: Safedisc\n\nGame Notes\n~~~~~~~~~~\nBuilding on the Call of Duty 4 engine, Call of Duty: World at War thrusts players into the ruthless and gritty chaos of WWII combat like never been before, and challenges them to band together to survive the most harrowing and climactic battles of WWII that led to the demise of the Axis powers on the European and South Pacific fronts. The title re-defines WWII games by offering an uncensored experience with unique enemies and combat variety, including Kamikaze fighters, ambush attacks, Banzai charges and cunning cover tactics, as well as explosive on-screen action through all new cooperative gameplay.\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. When asked for a serial enter one from the Serial folder on the DVD!\n4. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n5. Play the game !\n6. Thanks RELOADED for the crack and Activision for the game.\n7. Support the software developers. If you like this game, BUY IT!\n\n[img]http://www.imagefreeks.com/out.php/i361_2EACNoVM.jpeg[/img]\n\nCall of Duty: Modern Warfare 2 (c) Activision\n\n\nRelease Date: Nov 10, 2009\nReview Score: 8.5 - GameSpot\nSize: 3 DVDs\nGame Type: Modern First-Person Shooter\nProtection: Steamworks\n\nGame Notes\n~~~~~~~~~~\nThe call of duty needs answering once again, as the blockbusting first person shooter series returns to the modern day. A direct sequel to Call of Duty 4: Modern Warfare, you now play new character Sgt Gary Roach Sanderson. Your commander is Soap from the first game as you join a multinational anti-terrorist squad out to stop Russian ultra nationalists.\nWatch your squad grow from inexperienced rookies to veteran warriors A snowmobile race is just one of the new vehicle sections. Modern Warfare 2 is a direct sequel to Call of Duty 4. Youll journey all around the world in the fight against terrorism.\nMany of the details on the game are still sketchy but it promises to feature an even more varied series of locales than the ever before, including a snowbound enemy camp that starts with a daredevil mountain climb across the ice before a stealthy infiltration goes awry and you have to run for your life by commandeering a snowmobile.\nBut thats just the single player mode the multiplayer is expected to be even more ground-breaking than before, with new co-op options and even more rewards and perks for competitive play.\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n4. Play the game !\n5. Thanks SKIDROW for the crack and Activision for the game.\n6. Support the software developers. If you like this game, BUY IT!\n\n[img]http://www.imagefreeks.com/out.php/i367_i4s6rnuj.jpeg[/img]\n Call of Duty: Black Ops (c) Activision\n\n\nRelease Date: Nov 12, 2010\nReview Score: 9.0 - GameSpot\nSize: 2 DVDs\nGame Type: Historic First-Person Shooter\nProtection: Steam + CEG\n\nGame Notes\n~~~~~~~~~~\nThe biggest action series of all time returns. Call of Duty: Black Ops is an entertainment experience that will take you to conflicts across the globe, as elite Black Ops forces fight in the deniable operations and secret wars that occurred under the veil of the Cold War.\n\nAN INCREDIBLY DEEP MULTIPLAYER EXPERIENCE\n\nExpanding on the series ultimate multiplayer experience, Call of Duty: Black Ops takes competitive play to new heights. Expect the fast-paced, action-packed combat you love with more features than ever before:\n\n* Earn in-game COD Points that work like currency to purchase equipment, attachments, perks, and new customization options. This gives you the freedom to purchase what you want, when you want.\n* All new Killstreaks such as Napalm Strikes, the remote controlled explosive device (RC Car), and controllable helicopters.\n* Put your COD Points on the line with all-new Wager Matches. Compete for one of the top three spots in four custom game modes that test your nerves and weapon skills.\n* Customize the look of your soldiers with a variety of face paints, gun camos, and equipment options.\n* Use the brand new Theater Mode to show off your most epic kills. Edit and upload gameplay videos for the world to see what you re made of.\n* Jump into Combat Training and hone your tactics against A.I. bots in both Free-For-All and Team Deathmatch game modes.\n\n\nInstall Notes\n~~~~~~~~~~~\n1. Mount or Burn iso.\n2. Install the game.\n3. Copy the content from the Crack folder on the DVD to your installation directory and overwrite.\n4. Play the game !\n5. Thanks SKIDROW for the crack and Activision for the game.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:29c82e76d1c3607eeb80a4169d637dc752fb8cb7","amp;dn":"Call+of+Duty+Collections+DVD5-TeaMGENTi%5BWBZ+Xclusive%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c82e76d1c3607eeb80a4169d637dc752fb8cb7","infoHashBuffer":{"type":"Buffer","data":[41,200,46,118,209,195,96,126,235,128,164,22,157,99,125,199,82,251,140,183]},"announce":[],"urlList":[]}}