{"title":"Bento 4.0.2 [k]","uid":6260576,"size":93389200,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2bb835647e6f0d229cad52df183f670ffcb0243a&amp;dn=Bento+4.0.2+%5Bk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nobody2007","files":1,"time":1300737447,"description":"Bento 4.0.2 [k] | Mac Os X | 88.8 MB\nBento is a personal database from FileMaker that's as easy to use as a Mac. Bento organizes all your important information in one place, so you can manage your contacts, coordinate events, track projects, prioritize tasks, and more faster and easier than ever before.\nFeatures:\nBring It All Together: From contacts and calendars, to projects and events, you can organize just about every type of information you have all from one place.\nSee Things Your Way: Just drag and drop or point and click to change the look of any form, and see information in a way that makes sense to you. Now seeing, searching, and sorting your information is simpler and faster than ever before\nDesigned For Leopard: Bento has direct links to the Mac OS X Address Book and iCal, and takes advantage of many new features of Leopard, including core animation, advanced find, Time Machine, backups, and multimedia features.\nIf you're already using FileMaker Pro, be sure to check out Bento for your personal organization and productivity needs. It's also a great way to organize all your after-work activities, community projects, school events and more.\nWhat's New\nBento 4.0.2 for Mac corrects an issue where Bento 4 appears to have crashed when displaying summary rows in databases converted from Bento 3.\nThis is a display issue and no data has been affected. The conversion of the database from Bento 3 has completed successfully, but Bento 4 presents an error message and appears to be inoperable.\nRequirements\nPPC / Intel, Mac OS X 10.5.7 or later\n\n\nplz seed if you've been finished","torrent":{"xt":"urn:btih:2bb835647e6f0d229cad52df183f670ffcb0243a","amp;dn":"Bento+4.0.2+%5Bk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb835647e6f0d229cad52df183f670ffcb0243a","infoHashBuffer":{"type":"Buffer","data":[43,184,53,100,126,111,13,34,156,173,82,223,24,63,103,15,252,176,36,58]},"announce":[],"urlList":[]}}