{"title":"Nights in Black Leather (Classic GAY PORN with Peter Berlin 1973","uid":6174605,"size":860730434,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2c66e157792054c7770d6942cb12c8319e2ae0f1&amp;dn=Nights+in+Black+Leather+%28Classic+GAY+PORN+with+Peter+Berlin+1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":2,"time":1297723480,"description":"Nights in Black Leather is a most enjoyable film about the adventures in San Francisco of gay porn icon, Peter Berlin.\n\nThe cinematography is superb, the acting is convincing and the plot is one of eroticism and sensitivity; A candid exposition of gay male sexuality as well as a celebration of the beautiful male form.\n\nIn this film, the astonishingly beautiful Peter Berlin eloquently narrates to his viewers the letter he is composing to his close friends back home in Germany; describing the erotic adventures he has experienced during his first while in San Francisco.\n\nThe audience is taken on a journey they soon won't forget as they join this master of seduction in the most daring and sexually charged cruising experiences of all time.\n\nAlthough this is basically a soft-core film, the viewer will never feel a lack of sensuality or sexual dynamic.\n\nThe viewer is treated so several steamily erotic scenarios in which the stunning and (always) well-dressed Berlin showcases his beauty,sex-appeal and personally designed wardrobe in a manner which depicts the height of male sexuality, style ,confidence, grace, power and beauty.\n\nThis film is plot-driven and extremely interesting from beginning to end; stimulating all the senses.\n\nThe soundtrack features music by the immensely talented Claude Debussy and is a testament to Berlin's good breeding and fine taste.\n\nThis is a very intelligent and well-made film which I recommend to anyone with a sense of appreciation of male sexuality.\n\nNot only a &quot;must watch&quot; film, more so, a must OWN. One viewing proves never enough.","torrent":{"xt":"urn:btih:2c66e157792054c7770d6942cb12c8319e2ae0f1","amp;dn":"Nights+in+Black+Leather+%28Classic+GAY+PORN+with+Peter+Berlin+1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c66e157792054c7770d6942cb12c8319e2ae0f1","infoHashBuffer":{"type":"Buffer","data":[44,102,225,87,121,32,84,199,119,13,105,66,203,18,200,49,158,42,224,241]},"announce":[],"urlList":[]}}