{"title":"Giles Wemmbley-Hogg Goes Off - S01 to 03 - Audio Comedy - MP3 - ","uid":6137152,"size":594651283,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2c94a0216ac1a120e3fd36eaf22252e5ef149295&amp;dn=Giles+Wemmbley-Hogg+Goes+Off+-+S01+to+03+-+Audio+Comedy+-+MP3+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":25,"time":1296343539,"description":"Giles Wemmbley-Hogg Goes Off - Series 01 to 05 - Audio Comedy - BBC Radio 7 via DVB-T\n22 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nThe show follows the travel adventures of title character Giles Wemmbley-Hogg (&quot;Two Ms, two Gs&quot;), a nice but somewhat dim upper-class ex-public school boy (Charterhouse School) played by co-writer Brigstocke. Giles is on a gap year before university, and he records his (mis)adventures with his portable digital recorder, in places such as Bolivia, India, and Egypt. Throughout the series he does somehow graduate, albeit with a 2:2 in Canadian Studies.\n\n\n\n\n\n\nGiles Wemmbley-Hogg Goes Off - S01 - E01 - The Sudan\nGiles Wemmbley-Hogg Goes Off - S01 - E02 - Beijing\nGiles Wemmbley-Hogg Goes Off - S01 - E03 - Bolivia\nGiles Wemmbley-Hogg Goes Off - S01 - E04 - The Arctic\nGiles Wemmbley-Hogg Goes Off - S01 - E05 - Moscow\nGiles Wemmbley-Hogg Goes Off - S01 - E06 - Thailand\n\nGiles Wemmbley-Hogg Goes Off - S02 - E01 - Tanzania\nGiles Wemmbley-Hogg Goes Off - S02 - E02 - Germany\nGiles Wemmbley-Hogg Goes Off - S02 - E03 - Cuba\nGiles Wemmbley-Hogg Goes Off - S02 - E04 - Egypt\nGiles Wemmbley-Hogg Goes Off - S02 - E05 - India\nGiles Wemmbley-Hogg Goes Off - S02 - E06 - New Zealand\n\nGiles Wemmbley-Hogg Goes Off - S03 - E01 - Scotland\nGiles Wemmbley-Hogg Goes Off - S03 - E02 - Tokyo\nGiles Wemmbley-Hogg Goes Off - S03 - E03 - The Alps\nGiles Wemmbley-Hogg Goes Off - S03 - E04 - Russia\nGiles Wemmbley-Hogg Goes Off - S03 - E05 - Haiti\nGiles Wemmbley-Hogg Goes Off - S03 - E06 - Ireland\nGiles Wemmbley-Hogg Goes Off - S03 - ESP - Conservatives\nGiles Wemmbley-Hogg Goes Off - S03 - ESP - Labour\nGiles Wemmbley-Hogg Goes Off - S03 - ESP - Lib Dems\n\nGiles Wemmbley-Hogg Geht Zum - S04 - E01 - Fussballweltmeisterschaft Weg!\nGiles Wemmbley-Hogg Geht Zum - S04 - E02 - Fussballweltmeisterschaft Weg!\nGiles Wemmbley-Hogg Geht Zum - S04 - E03 - Fussballweltmeisterschaft Weg!\n\nGiles Wemmbley-Hogg Goes Off - S05 - E01 - To Glastonbury\n\n\n\n\n\n\nAudio Format : MP3\nDuration Approx : 27mn 54s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n[\n\n\nI post quite a few torrents if this site is down when I post a new one I don't have time to keep trying.\nIf it's down then it's skipped.\n\nYou can follow me on Twitter so you don't miss any\n\n\nOr add the RSS feed in uTorrent (In FEEDS on the left add)\n\n\n\n.\n","torrent":{"xt":"urn:btih:2c94a0216ac1a120e3fd36eaf22252e5ef149295","amp;dn":"Giles+Wemmbley-Hogg+Goes+Off+-+S01+to+03+-+Audio+Comedy+-+MP3+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c94a0216ac1a120e3fd36eaf22252e5ef149295","infoHashBuffer":{"type":"Buffer","data":[44,148,160,33,106,193,161,32,227,253,54,234,242,34,82,229,239,20,146,149]},"announce":[],"urlList":[]}}