{"title":"(PC GAME) GUNROX (SLLPER)","uid":6224728,"size":55380602,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d14d4aa35fdc755e65d54e76f0a8c34771fd49b&amp;dn=%28PC+GAME%29+GUNROX+%28SLLPER%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sllper2","files":1,"time":1299472907,"description":"In the txt doc is a referrer link to to the website its a free online game, without getting all the toolbars and retarded extra downloads. This is not a virus (scanned).\n\nUse the referrer link and sign up as soon as possible with the link, doing this will cause you to recieve weapons and armors in the game as well as artifacts and points, when you level up. This game is a must!!\n\n---------------------------------------------------------------------------------------\n\nWelcome to Gunrox, a free-to-play top-down strategy game where you get to command a squad of three units against players from around the world. Fight it out in vibrant locales from junkyards to city streets, each with colorful landscapes. With over 30 different weapons available, from the tried and true assault rifles to the close-range devastation of shotguns and seven other weapon types (maybe you'll find a rare artifact with the power to poison your foe?), there's a lot of fun to be had playing GUNROX. For those that love the feeling of getting stronger, a unique weapon skills and perk tree is available to each of your three units as you level up, not to mention numerous upgrades for your weapons as well! With so much to offer, GUNROX is a unique experience you may want to get addicted to.\n\n\n\nThis game is runnable on windows os 98+ this game supports windows 98 2000 2005 etc.\t","torrent":{"xt":"urn:btih:2d14d4aa35fdc755e65d54e76f0a8c34771fd49b","amp;dn":"%28PC+GAME%29+GUNROX+%28SLLPER%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d14d4aa35fdc755e65d54e76f0a8c34771fd49b","infoHashBuffer":{"type":"Buffer","data":[45,20,212,170,53,253,199,85,230,93,84,231,111,10,140,52,119,31,212,155]},"announce":[],"urlList":[]}}