{"title":"Deadliest Catch - Sea Of Chaos[wii][ntsc][usa][scrubbed]","uid":6135373,"size":1406123303,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:2d8dfc202f934171fb325ea16a3efb5e9d77102e&amp;dn=Deadliest+Catch+-+Sea+Of+Chaos%5Bwii%5D%5Bntsc%5D%5Busa%5D%5Bscrubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flat480","files":-1,"time":1296288939,"description":"Congratulations, you are hired! Now go do the toughest job in the world in this game based on the hit Discovery Channel series. Experience life as a crab fisherman as you navigate the Bering Sea, trolling the unforgiving waters for King Crab and Opilio. Captain your own boat, choosing when and where to harvest crab and maximize your haul. Experience some of the show's most memorable moments, riding out giant waves, rescuing men gone overboard, and more. Compare your in-game catch to how the real-life captains did under the same circumstances, compete with other players online, and adapt to conditions that can change in the blink of an eye.\nÃ‚Â \n\nFeatures\nÃ‚Â·\tChoose to fish with the real life captains and fish the authentic boats or create your own customized scenario.\nÃ‚Â·\tUtilize a unique combination of strategy and action to capture the biggest catch.\nÃ‚Â·\tWork with or against rival captains, battle unpredictable seas and ever-changing conditions.\nÃ‚Â·\tSelect from six unique Campaigns, both King &amp; Opilio Crab seasons as well as Derby or Quota style competition.\nÃ‚Â·\tRelive actual past seasons with key events which happened during the Deadliest Catch TV season including, monster waves, aggressive ice, frequent breakdowns, large storms and large hauls from particular locations. Players can also take on rivals, fish multi-season campaigns &amp; more.\n\n\n                                Please seed!!!\n\n\n\n                               ENJOY!!!","torrent":{"xt":"urn:btih:2d8dfc202f934171fb325ea16a3efb5e9d77102e","amp;dn":"Deadliest+Catch+-+Sea+Of+Chaos%5Bwii%5D%5Bntsc%5D%5Busa%5D%5Bscrubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8dfc202f934171fb325ea16a3efb5e9d77102e","infoHashBuffer":{"type":"Buffer","data":[45,141,252,32,47,147,65,113,251,50,94,161,106,62,251,94,157,119,16,46]},"announce":[],"urlList":[]}}