{"title":"Paliament - Osmuim .flac files","uid":6265317,"size":603166400,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2dfd5abd881f3c5cb85b145012b8d1c86cb2156c&amp;dn=Paliament+-+Osmuim+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ulikes","files":21,"time":1300839527,"description":"While most Educated P-Funk fans will tell you that &quot;Up For the Down Stroke&quot; is Parliament's First album without batting an eyelash, this record begs to differ. Released in 1970, George Clinton and the Parlia-Funkadelic crew team up with songwriter Ruth Copeland and Invictus Records to release the fantastic debut &quot;Osmium&quot;. Not only is this a great album, but it bests &quot;Up For the Down Stroke&quot; and maybe even &quot;Chocolate City.&quot; The album is creative mix of folk, funk, motown and doo-wop that flows together effortlessly.\n\n&quot;I Call My Baby Pussycat&quot; an early concert favorite, starts off the album. This track features great vocals by the group, most notably Ray Davis. One of the best numbers on the album. It would later the redone on &quot;America Eats It's Young&quot; but this version, with its raw playing and soulful singing, is superior. The intro was later pieced into the song &quot;Hardcore Jollies&quot; off the album by the same name. &quot;Put Love In Your Life&quot; is another great number that changes form many times, almost inheriting a progressive rock feel to it. Again featuring great vocals by Ray Davis and Fuzzy Haskins.\n\nNext is my personal favorite on the album: &quot;Little Old Country Boy.&quot; This is a hilarious song about a young man who is sent to jail for spying on his cheating girlfriend. The song has a great groove that is brightened by Fuzzy's over the top vocalizing. Invictus records loved this song so much that it put it as the b-side for all of Parliament's single releases during the time. &quot;Moonshine Heather&quot; is an okey jam song. Not one of the more notable on the album, but nevertheless good. &quot;Oh Lord Why Lord/Prayer&quot; is a heartfelt tribute to god. This song is amazingly beautiful but very unlike Parliaments style. &quot;My Automobile&quot; is a great doo- wopish number that celebrates the casual fun of George Clinton while still making you groove. &quot;Nothing Before Me But Thang&quot;, &quot;Funky Woman&quot; and &quot;Living the Life&quot; are your basic rockish tracks. While they are good, they aren't as notable as other songs on this album. &quot;The Silent Boatman,&quot; while very out of place, is beautiful on its own right.\n\nThe real treat of this album are the bonus tracks. &quot;Red Hot Mama&quot; is an interesting example of this song before it transformed into the version we know on &quot;Standing On The Verge Of Getting It On.&quot; Both versions of &quot;Breakdown&quot; are groovetastic and it is very obvious why these songs were successful singles. &quot;Come In Out Of The Rain&quot; is probably one of Parliament's most criminally underrated songs. The song is political cry for change in a troubled era. It contains some of the most soulful moments of George Clinton\\'s career. &quot;Fantasy Is Reality&quot; is another great soulful song that has a very interesting keyboard line. &quot;Unfinished Instrumental&quot; is good and so is &quot;Loose Booty&quot; which later ended up on &quot;America Eats It's Young.&quot;\n\nThis is the English Import version - it has bonus tracks matching anything on the original record, including a rougher, early version of &quot;Red Hot Mama&quot;, and &quot;Fantasy is Reality&quot; which Parliament resurrected in the later, dance-funk-oriented incarnation of the band. \n\nEnjoy and please seed!!!","torrent":{"xt":"urn:btih:2dfd5abd881f3c5cb85b145012b8d1c86cb2156c","amp;dn":"Paliament+-+Osmuim+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dfd5abd881f3c5cb85b145012b8d1c86cb2156c","infoHashBuffer":{"type":"Buffer","data":[45,253,90,189,136,31,60,92,184,91,20,80,18,184,209,200,108,178,21,108]},"announce":[],"urlList":[]}}