{"title":"Coast to Coast AM - 2011-02-03 - Star Visitors &amp; Internet Privac","uid":6170838,"size":56153895,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2fab0a94c0183fdfd4d57967b610918873017c7b&amp;dn=Coast+to+Coast+AM+-+2011-02-03+-+Star+Visitors+%26+Internet+Privac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297566697,"description":"Date: \t02-03-11\nHost: \tGeorge Noory\nGuests: \tDr. Richard J. Boylan, Katherine Albrecht, Joshua P. Warren\n\nFirst hour guest, consumer privacy expert Katherine Albrecht reacted to a proposed bill that would give the US president the power of an Internet &quot;kill switch&quot; in a cyber emergency. The bill doesn't really define what such an emergency would be, and presents a &quot;frightening scenario&quot; for curtailing free speech, she said, citing the current situation in Egypt. She also spoke about search engines gathering and collecting information on consumers based on their searches, and recommended the privacy search engine, startingpage.com.\n\n---------------\n\nAppearing in the second hour, anthropologist specializing in Star Cultures, and certified clinical hypnotherapist, Dr. Richard Boylan shared updates on ET visitors and 'star children.' According to his information, a powerful ruling cabal plans to conduct a fake alien invasion, to divert attention away from their oppressive tactics. The recent UFO sighting in Jerusalem is an example of this, he added.\n\nHumans were bio-engineered by ETs 275,000 years ago, and they continue to upgrade human genetics, with some 96% of grade school children being &quot;star seeds&quot; or &quot;star children,&quot; he cited. There are some 1,483 separate alien races who have visited Earth, including two groups that reside here-- the Tall Whites in Nevada, and the Saami people who came from Barnard's star, and now live above the Arctic Circle, he claimed.\nOpens Lines &amp; Joshua P. Warren\n\nThe latter half of the show featured Open Lines, with callers sharing accounts that included encounters with small aliens, and the Old Hag. Paranormal investigator Joshua P. Warren joined George to field the calls in the last hour, and related how he was saved during an angelic intervention as a young boy. He also commented that humans may be developing a new sensory organ that will allow them to view astral entities around us.\nWebsite(s):\n\n    * drboylan.com\n    * katherinealbrecht.com\n    * joshuapwarren.com\n\nBook(s):\n\n    * Project Epiphany\n    * Spychips\n    * How to Hunt Ghosts\n","torrent":{"xt":"urn:btih:2fab0a94c0183fdfd4d57967b610918873017c7b","amp;dn":"Coast+to+Coast+AM+-+2011-02-03+-+Star+Visitors+%26+Internet+Privac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fab0a94c0183fdfd4d57967b610918873017c7b","infoHashBuffer":{"type":"Buffer","data":[47,171,10,148,192,24,63,223,212,213,121,103,182,16,145,136,115,1,124,123]},"announce":[],"urlList":[]}}