{"title":"Edward Scissorhands(1990)DVDRip.AC3(ENG)-DROCK","uid":6260803,"size":733812801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3009373e4be83f73ab4bb34d4a4f52866d273ef5&amp;dn=Edward+Scissorhands%281990%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300746040,"description":"Tim Burton's Edward Scissorhands opens as an eccentric inventor (Vincent Price) lovingly assembles a synthetic youth named Edward (Johnny Depp). Edward has all the essential ingredients for today's standard body, with the exception of a pair of hands. For what is initially thought to be a temporary period, he is fitted with long, scissor-like extremities that, while able to trim a mean hedge, are hardly conducive to day-to-day life. When the kindly inventor dies, however, Edward is left lonely and cursed with some very heavy metal for hands. He is eventually taken in by Peg Boggs (Dianne Weist), an Avon lady who takes pity on him after seeing his bleak existence. Edward, in spite of his inherent ability to slay anyone he comes across, is a gentle soul whose only wish is to be loved. His impromptu family has, at best, a limited understanding of Edward, but he finds himself drawn to Peg's weary but sympathetic daughter, Kim (Winona Ryder), who is dating Jim (Anthony Michael Hall), the neighborhood bully. Meanwhile, Edward finds himself a local celebrity after the town realizes that his talents include creative hedge trimming and an unrivaled ability to cut hair. His so-called friends are proven fair-weather when Edward is accused of a crime, after which his only supporters are Peg and Kim. \n\nRipped with Handbrake.\n\nLength: 1 Hour 45 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:3009373e4be83f73ab4bb34d4a4f52866d273ef5","amp;dn":"Edward+Scissorhands%281990%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3009373e4be83f73ab4bb34d4a4f52866d273ef5","infoHashBuffer":{"type":"Buffer","data":[48,9,55,62,75,232,63,115,171,75,179,77,74,79,82,134,109,39,62,245]},"announce":[],"urlList":[]}}