{"title":"Air Bucks [dos]","uid":6222462,"size":919570,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30de01a09189300862f5b0def6892ef6dd0703a9&amp;dn=Air+Bucks+%5Bdos%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtSposh","files":1,"time":1299386986,"description":"Air Bucks is an excellent business simulation game from the company now famous for Caesar series. The game succeeds in capturing the ins and outs of the airline industry without bogging the player down with details. It is not a realistic business sim by any means: it is clear that Impressions place more emphasis on the fun factor than on financial accuracy. Impressions' notorious &quot;spreadsheet syndrome,&quot; i.e. too many statistics presented in unattractive format, stil persists in Air Bucks, although to a much lesser extent than their earlier titles. There are many fun details in the game-- you can buy rights to airports, arrange seats on the planes to carry more or less first class passengers, decide on the quality of in-flight food or entertainment, and more. The game even has interesting &quot;special events&quot; similar to Railroad Tycoon, which require quick, astute changes in your plane operations to accommodate.My only gripe is the economic model is somewhat flawed-- that it is often difficult. Nevertheless, the game's attention to industry-specific details is excellent: you will design global routes and pay for landing rights, tinker with plane layouts, and determine fares for each leg. The 1.2 version (the one on this site) improves upon the original release significantly with better graphics, the ability to zoom in to watch your planes following their routes, and better cargo model\n\nhave fun... and seed ;) neat little Airline-sim wich runs fine even on xpsp3/SgtS","torrent":{"xt":"urn:btih:30de01a09189300862f5b0def6892ef6dd0703a9","amp;dn":"Air+Bucks+%5Bdos%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30de01a09189300862f5b0def6892ef6dd0703a9","infoHashBuffer":{"type":"Buffer","data":[48,222,1,160,145,137,48,8,98,245,176,222,246,137,46,246,221,7,3,169]},"announce":[],"urlList":[]}}