{"title":"James Ellroy, BloodÃ‚Â´s a rover","uid":6184152,"size":945557664,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:32360c1e3fb7f77e6d8278799bd0ee7a786dd29b&amp;dn=James+Ellroy%2C+Blood%C3%82%C2%B4s+a+rover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"dsgjsd2","files":238,"time":1298059285,"description":"The Underworld USA trilogy began in 1995 with publication of American Tabloid and covered events in the early sixties. Five years passed before readers could dig into The Cold Six Thousand. Blood's a Rover (title taken from a poem by Houseman) begins shortly after the King and Kennedy assasinations in 1968 and takes us through the Chicago riots and Nixon's elections. Like previous entries, the book delivers an alternate, underground history of the partnership between Hoover's FBI and various criminal elements. Ellroy entices us through the looking glass to demonstrate the impact of that unsavory alliance on modern political history. Characters from previous books abound (Dwight Holley, Wayne Tedrow) as well as public figures both significant (Nixon, Howard Hughes) and obscure (Sal Mineo)\n\nEllroy's Hoover is not much concerned with organized crime. Instead he is obsessed with student protesters, civil rights demonstrators, non-existant domestic Reds, and any politician he believes to be aligned with these groups. In this dark world, former cop Wayne Tedrow meets with mob heads after a drop off of cash to candidate Nixon and notices on the wall, a photo showing one of the gangsters playing golf with Pope Pius.\n\nThe author's style is stacatto, high-adrenaline narrative alternating with newspaper headlines and supposed excerpts from personal journals. A chapter begins: &quot;Dwight read files. A radio spritzed the news. Nixon and Humphrey grubbed for votes and see-sawed poll-wise. Jimmy Ray and Sirhan Sirhan fermented in custody.&quot; Using this approach, Ellroy packs a great deal of action and emotional impact into a few paragraphs. Over hundreds of pages, the result can be exhausting.\n\n\nMOST OF ALL THE SEEDER IS NEWBIE AND I DONT HAVE LISTEN TO THE WHOLE BOOK BEFORE DL. PLEASE NOTICE ME FOR FAULTS.","torrent":{"xt":"urn:btih:32360c1e3fb7f77e6d8278799bd0ee7a786dd29b","amp;dn":"James+Ellroy%2C+Blood%C3%82%C2%B4s+a+rover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32360c1e3fb7f77e6d8278799bd0ee7a786dd29b","infoHashBuffer":{"type":"Buffer","data":[50,54,12,30,63,183,247,126,109,130,120,121,155,208,238,122,120,109,210,155]},"announce":[],"urlList":[]}}