{"title":"coast to coast. 2011-03-17 - Future Science","uid":6253187,"size":55199809,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:34cbf755ede6d5a0037faa03d28f0fa3f32181d2&amp;dn=coast+to+coast.+2011-03-17+-+Future+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1300475349,"description":"Future Science\n--------------\nDate: 03-17-2011\nHost: George Noory\n\nGuests: Michio Kaku, Dr. John Apsley\n\n\nTheoretical physicist Dr. Michio Kaku discussed where science is taking us over the next century, and presented revolutionary developments in medicine, computers, quantum physics, and space travel. He pointed to four areas which will propel the evolution of science over the next 100 years: biotechnology, artificial intelligence, nanotechnology, and telecommunications. To that end, he surmised that someone from the year 2100 would be able to move things with their mind, possess &quot;near perfect&quot; ageless bodies, travel via flying vehicles propelled by super magnets, and have the ability to create a variety of unique creatures using genetics. &quot;We're going to become the Gods that we once feared and worshipped,&quot; Kaku foretold.\n\nOne advancement which Kaku foresees arriving in the &quot;near future&quot; is a form of contact lens which will be connected to the Internet. This &quot;augmented reality,&quot; Kaku said, would allow for scenarios like being able to know all about a person as soon as you meet them and having subtitles printed beneath their face if they are speaking in a foreign language. He noted that such a device would be particularly popular for artists, since they could &quot;conjure up new worlds because it is in your contact lens.&quot; Additionally, it would also provide a boon for industries like architecture and tourism as well as the military, who are well on their way to designing an eye piece with these specifications. &quot;Virtual reality is for children,&quot; quipped Kaku, &quot;but augmented reality is for adults, because it will help us work, play, and meet people.&quot;\n\nKaku also detailed how &quot;programmable matter&quot; is leading towards a world where shape shifting could become a reality. He explained that, by creating a charged chip that is the size of a grain of sand, scientists could then program the tiny particles to stick to each other in a myriad of ways. Presently, the chips are being used to create simple shapes, but in time they could be used to construct more complex structures such as cars and stoves. &quot;In the future,&quot; he envisioned, &quot;we could create an entire city with the push of a button.&quot; While such advancements may sound like pure fantasy, Kaku stressed that these insights come from his conversations with cutting edge researchers. &quot;I'm not a science fiction writer, I'm a scientist,&quot; he said, &quot;and I've interviewed my colleagues and they tell me stories you wouldn't believe about what's possible in the future.&quot;\n\nRadiation Protection:\nIn the first hour, cancer researcher Dr. John Apsley talked about natural methods for radiation protection. He warned that &quot;there is really no safe level of radiation&quot; and lamented that, since it has a half-life of 25,000 years, it is &quot;constantly emitting destructive effects upon our cells&quot; once inside the body. Apsley advocated the benefits of kelp as a means of warding off the damage of radiation and shared the tale of two different Japanese hospitals which were about one mile away from the atomic blasts of World War II. One hospital used all natural seaweed and vegetables and the other used commercial foods. In the former institution, &quot;virtually 100 percent&quot; of the people lived, while, in the latter hospital, all of the people died.\n\n\nNews segment guests: Katherine Austin Fitts talked about how the disaster in Japan affects the US economy and Dr. Bob Curran talked about St. Patrick's Day.\n\n\nWebsites:\nmkaku.org\ndoctorapsley.com\n\nBooks:\nPhysics of the Future\nThe Regeneration Effect\n\n","torrent":{"xt":"urn:btih:34cbf755ede6d5a0037faa03d28f0fa3f32181d2","amp;dn":"coast+to+coast.+2011-03-17+-+Future+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34cbf755ede6d5a0037faa03d28f0fa3f32181d2","infoHashBuffer":{"type":"Buffer","data":[52,203,247,85,237,230,213,160,3,127,170,3,210,143,15,163,243,33,129,210]},"announce":[],"urlList":[]}}