{"title":"A Better Finder Rename v.8.77 + sn","uid":6228653,"size":3248071,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3605a51e60ca21bb15a671ae3cacd8e9e447f60e&amp;dn=A+Better+Finder+Rename+v.8.77+%2B+sn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1299615732,"description":"Official Web Site:  &lt;a href=&quot; http://www.publicspace.net/ABetterFinderRename/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.publicspace.net/ABetterFinderRename/&lt;/a&gt;\n\nA Better Finder Rename has long been the file renamer of choice for tens of thousands of professionals, businesses and hobbyists across the world\n\nA Better Finder Rename's huge array of renaming options are organized into 7 intuitive categories that cover all the text, character, position, conversion and truncation features that you would expect from a great file renamer. On top of this, \n\nA Better Finder Rename provides more advanced features that answer the prayers of many professionals and hobbyists alike.\n\nFeatures\n\nPhotographers in particular will find the advanced sequence number and date &amp; time features a joy to behold. \n\nA Better Finder Rename knows how to extract EXIF shooting date and time information from your digital camera images and exploit them in creating sequence numbers or adding time and date information to the file name. Support for all major RAW formats (including JPEG, CRW, CR2, THM, NEF, TIFF, RAJ, ORF , MRW, DNG, PEF, SRF, etc.) extends this to professional photographers. \n\nVersion 8 now also deals gracefully with multiple shots captured in the same second.\n\nMusic lovers will be delighted by our MP3/AAC renaming feature that allows you to exploit the id3 meta-data tags embedded in your music files to create your own naming scheme for your music collection. Meta-data information from mp3, aac and iTunes music store files are supported.\n\nWhats new:\n\nThe new release adds new options for inserting space saving alphabetical sequences into file names.\n\nSystem Requirements:\n\nMac OS X.6 (Intel only)\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:3605a51e60ca21bb15a671ae3cacd8e9e447f60e","amp;dn":"A+Better+Finder+Rename+v.8.77+%2B+sn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3605a51e60ca21bb15a671ae3cacd8e9e447f60e","infoHashBuffer":{"type":"Buffer","data":[54,5,165,30,96,202,33,187,21,166,113,174,60,172,216,233,228,71,246,14]},"announce":[],"urlList":[]}}