{"title":"Warriors.199C.TVrip.352p.H264","uid":6284787,"size":592409847,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3693e56641e5567c7ad063ccc0824defe01fb3e2&amp;dn=Warriors.199C.TVrip.352p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":-1,"time":1301530603,"description":"Broadcast: BBC 1: 29 November 1999\n\nDuration: 02:50:00\n\nDirector: Peter Kosminsky\n\nThe cast list reads like a Who's Who of British television drama.\n\nAlmost every actor went on to star in a major series: Matthew Macfadyen (Spooks, Pride &amp; Prejudice), Damian Lewis (Life US, Band of Brothers, The Forsyth Saga), Ioan Gruffudd, (Hornblower, Black Hawk Down), Tom Ward (Silent Witness), Jodhi May (The Amazing Mrs Pritchard. The Other Boleyn Girl, The Mayor of Casterbridge, Tipping The Velvet).\n\n\nQuote:\nAmazon.co.uk Editorial Review\n\nIf the conflict in Bosnia has become something of a forgotten war, it's not for the want of trying from the immensely powerful BBC film Warriors, the story of five young soldiers and their harrowing experiences in the region.\n\nOpening with an extended view of the five's home lives--all are on leave when called up to form part of the UN peacekeeping mission-- director, Peter Kosminksy, invites the viewer to experience the war at a strictly personal level.\n\nAnd while this leaves little scope for any general political overview of events (aside from the horror of war) this is a piece of drama and not a documentary.\n\nOnce transported to Bosnia, the protagonists find that their role as peacekeepers leaves them largely sidelined and unable to intervene and save lives, often forced to stand by and watch mass slaughter.\n\nNot since M*A*S*H have the absurdities of &quot;the rules of engagement&quot; been so eloquently examined.\n\nIt is the darkening spiral that the five are sent on by these events and the relationships they form throughout them that forms the crux of the film, never demonstrated more clearly than by the return to the friends and families who see them as heroes.\n\nBloody and sickening in parts, Warriors is given extra poignancy by the fact that it is based on the real-life testimony of British soldiers.\n\nA million miles away from the Rambos of this world this is the war film coming of age. --Phil Udell\n\n============================\n\nAmazon Reviews:\n\nAverage Customer Review: 5 Stars (based on 17 Amazon reviews.)\n\nQuote:\nA Must See! (5 Stars)\n\nWOW!!! What an amazing film.\n\nI first watched this when it was aired on the BBC a few years ago and I have been meaning to buy it for a long time.\n\nI have not for many years seen a film that evokes such an emotive reaction, you will experience grief, anger, sympathy &amp; guilt watching this highly emotive and accurate portrayal of our British troops as UN peace keepers in Bosnia.\n\nLets hope this film will remain a stark reminder of the horrific war crimes and ethnic cleansing that happened during that time and no doubt similar atrocities which still happen all over the world to this day. How easy it is to forget.\n\nCongratulations to the beeb for portraying this difficult story with such humility as it deserves. A must, must, must buy!!\n\n\n\nQuote:\nPowerful and Moving...(5 Stars)\n\nWarriors is a hard hitting drama from the BBC. I first watched it 4 years ago, and watching again recently still left me in awe. The soldiers are human and humane, but hamstrung by the UN regulations.\n\nUnable to help people directly due to fears of 'ethnic cleansing' they leave people to die at the hands of monsters who used to be there neighbours.\nThe drama also shows the effects of the conflict on their lives when they return to Britain.\n\nA number of outstanding performances lend realism to the production. None more so than Matthew MacFadyen, who plays the scouser Pvt James, who deals with what he experiences in a simple, humane way.\n\nHe is left baffled by the authorities unwillingness or inability to do the right thing. His passage from a joker to a hurt human being is the pivot of the drama.\n\n\n\nQuote:\nFlashback Time!... (5 Stars)\n\nI was &quot;lucky enough&quot; to serve as a volunteer in Bosnia during and after the war, from april 1995 till june 1996 as a UN/ NATO peacekeeper.(All Norwegians and Swedes were volunteers).\n\nThe story being told in the film was so real to me, that when I saw it in 2003 I had flashbacks for the first, and hopefully last, time since my time in Bosnia.\n\nI could feel the humidity and feel the taste of the air in central Bosnia.\n\nTo me this film shows a realistic image of what happened in Bosnia. Just don't forget that there were saints and sinners on all sides in the conflict!!\n\n\n\nQuote:\nGone But Not Forgotten(5 Stars)\n\nI was one of the soldiers interviewed for my accounts of the conflict and even 15 years later i still suffer from the reminder of this UN peace keeping force.\n\nTop marks to the film crew and the director for making an honest drama for the world to see, what the troops had to endure during their tour of duty and remain unaffected is beyond belief i hope we never have another conflict like this again.\n\nTo my comrades that we lost on our tour you're gone but never forgotten\n\n\n*************************************************************************\n\nNOTE: Be reasonable about quality. It VERY good having in mind that this is TV capture and more than decade old.","torrent":{"xt":"urn:btih:3693e56641e5567c7ad063ccc0824defe01fb3e2","amp;dn":"Warriors.199C.TVrip.352p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3693e56641e5567c7ad063ccc0824defe01fb3e2","infoHashBuffer":{"type":"Buffer","data":[54,147,229,102,65,229,86,124,122,208,99,204,192,130,77,239,224,31,179,226]},"announce":[],"urlList":[]}}