{"title":"Coast to Coast AM - 2011.02.10 - Multiverse &amp; Parallel Worlds","uid":6183471,"size":55256251,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3ab1bbcc5f08586a38e2ad95ff390bd25317d722&amp;dn=Coast+to+Coast+AM+-+2011.02.10+-+Multiverse+%26+Parallel+Worlds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pegasus77","files":5,"time":1297988297,"description":"Multiverse &amp; Parallel Worlds\n  \nDate: \t02-10-11\nHost: \tGeorge Noory\nGuests: Brian Greene, Steve Quayle\n\nTheoretical physicist Brian Greene discussed ideas about the multiverse and parallel worlds, as well as a variety of cosmology topics. The scenario of a multiverse (that we exist in only one of many universes) was actually first proposed back in the 1950s by Hugh Everett at Princeton, but has only recently gained more traction in the physics community, he noted. According to this way of thinking, &quot;our universe would be one flavor of universe in a spectrum of flavors that would have other physical features,&quot; Greene noted.\n\nIn a scenario that there were multiple Big Bangs, different universes could be embedded in the same substrate but separated by an &quot;inflaton field,&quot; a kind of energy that gives rise to repulsive gravity, he explained. Understanding the issue via string theory, Greene said one could &quot;think of our universe as a big huge slice of bread in a large cosmic loaf that has other slices of bread near by us. Now those other slices could actually be a tiny fraction of a millimeter away from us, but in another dimension,&quot; so we can't see or travel to them, and they remain hidden from us.\n\nYet we might eventually find evidence of a collision or interaction between parallel universes, he continued. Greene also explored the idea that our universe could be a kind of computer simulation, which exemplifies the idea that mathematics doesn't just describe reality, but is reality. He is currently researching the idea that the extradimensional shape of our universe can undergo a dramatic change via the processes of quantum mechanics.\nVimana Report\n\nFirst hour guest, Steve Quayle discussed a report which alleges that a vimana (flying machine described in ancient Sanskrit epics) was entrapped in a &quot;time well&quot; in an Afghanistan cave, and that various world leaders had made recent trips there to view the discovery. &quot;There's a war going on, the Chinese, and the Russians, and the US, and everybody else is vying for the ancient technology,&quot; he commented.\n\nNews segment guest: Charles R. Smith\n\nWebsite(s):\ncolumbia.edu\nstevequayle.com\n\nBook(s):\nThe Hidden Reality: Parallel Universes and the Deep Laws of the Cosmos\nThe Elegant Universe","torrent":{"xt":"urn:btih:3ab1bbcc5f08586a38e2ad95ff390bd25317d722","amp;dn":"Coast+to+Coast+AM+-+2011.02.10+-+Multiverse+%26+Parallel+Worlds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab1bbcc5f08586a38e2ad95ff390bd25317d722","infoHashBuffer":{"type":"Buffer","data":[58,177,187,204,95,8,88,106,56,226,173,149,255,57,11,210,83,23,215,34]},"announce":[],"urlList":[]}}