{"title":"Blakstone: Dark Days Album","uid":6227035,"size":73796172,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ae8f2da0b3d340ac21f31c70ce9fdabd2808b17&amp;dn=Blakstone%3A+Dark+Days+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"demahmud","files":15,"time":1299554963,"description":"&quot;Blakstones Music is a sound born out of provocation due the unprecedented suffering of our people (be it in Iraq, Palestine, Lebanon, Afghanistan, Chechnya, Kosovo, Bosnia, Darfur, Gujarat, Kashmir, Angola, Rawanda etc) as well as the continuous subjugation of the impoverished of this earth at the hands of capitalism due to western foreign policy and eastern home-grown treachery.\n        Simply speaking folks we are sick and tired of governments and so called politicians getting away with murder in all its guises and hence we speak out through our music. If we as a collective can galvanise generation X, if we can make them aware of the atrocities committed in their name, if we can remind them of the hardships that others endure,\n        If we can politicise and inspire them into direct action accountability of government and self, if we can educate and entertain at the same time, if we can peddle knowledge instead of death, if we can murder ignorance and apathy instead of each other, if we can glorify the truth instead of falsehood, if we can rep those without a voice and stand up against injustice and oppression, then we have made a difference, then the collective becomes a movement and a movement is a vehicle for change.&quot;","torrent":{"xt":"urn:btih:3ae8f2da0b3d340ac21f31c70ce9fdabd2808b17","amp;dn":"Blakstone%3A+Dark+Days+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae8f2da0b3d340ac21f31c70ce9fdabd2808b17","infoHashBuffer":{"type":"Buffer","data":[58,232,242,218,11,61,52,10,194,31,49,199,12,233,253,171,210,128,139,23]},"announce":[],"urlList":[]}}