{"title":"AMS Photo Effects Studio","uid":6302241,"size":24425514,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3b57c8caeeb491cdea3604e77a4b05842343136a&amp;dn=AMS+Photo+Effects+Studio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djjlicious","files":2,"time":1302192616,"description":"AMS Photo Effects\n\nPhoto Effects is a new program for processing photos with the help of various filters. With it, you can completely transform any image. The program allows you to use more than 50 effects, including both traditional and original ones. You will be able to take a look at your photos in the rain and snow, in fog and up in the sky, add some sun light to it or swirl it in a typhoon...\n\nYou can combine effects and create truly fantastic compositions. It is possible to apply the selected filters both to the entire image and to its parts highlighting the most important fragment of the photo. Photo Effects will help to decorate your home photo album, website and will even allow you to create an original greeting card.\n\nPhoto Effects makes it possible to not only process, but also decorate photos. It offers you more than 100 frames and masks that will decorate portraits, landscapes and even simple casual shots. It is important that you can apply effects both before and after you decorate a photo. Combining effects and frames is one of the main features of the program. For example, you can apply a classic frame and then use lighting effects to add realistic sunlight to its contour. Try to use this feature more often and you will see how pretty the images Photo Effects creates are.\n\nAfter registration you can download new frames and clipart.\n\nRead the ReadMe file and enjoy!\n\nAnd please seed!! Sharing is caring :)","torrent":{"xt":"urn:btih:3b57c8caeeb491cdea3604e77a4b05842343136a","amp;dn":"AMS+Photo+Effects+Studio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b57c8caeeb491cdea3604e77a4b05842343136a","infoHashBuffer":{"type":"Buffer","data":[59,87,200,202,238,180,145,205,234,54,4,231,122,75,5,132,35,67,19,106]},"announce":[],"urlList":[]}}