{"title":"EastDraw 3.6.1 [K]rack'd","uid":6188211,"size":22367002,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3b9e26eca0b67b3ee69dbe0b9fbc468b89a7039f&amp;dn=EastDraw+3.6.1+%5BK%5Drack%5C%27d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1298194603,"description":"I'm a pro Photoshop and Illustrator person, so I seen all the product out there for you to be able to use to make images. You might like to get the KIDS interested in computer graphics is easy enough to learn - it has a very soft learning curve....\n\nOfficial Web Site:  &lt;a href=&quot; http://www.eazydraw.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.eazydraw.net/&lt;/a&gt;\n\nFeatures:\n\nSimple enough for a beginner yet powerful enough for the professional.\nUse EazyDraw to create illustrations, logos, floor plans and elevations, technical diagrams, flow charts, maps, web graphics and more.\nThis program is fun and designed for ultimate ease of usew\n\nVersion 3-It Just Keeps Getting Better\n\n\nReviews v.3\n\nEazyDraw version 3.6 provides several new features and robust performance on OS X versions 10.4 (Tiger), 10.5 (Leopard), and the newest version 10.6 ( Snow Leopard ).\n\nVector drawing without boundaries. Gone are the limitations found in applications constrained by other operating systems or based on technologies of the last century. Layout your illustration with multiple pages. Assemble new designs with the convenience of multiple drawings open and accessable on the desktop. Drag and drop a single paragraph or entire layer from a reference drawing to design in progress.\n\nEazyDraw provides expanded text capability &quot;...has the BEST text engine of any of the major design studio software... Lauryn from Australia&quot;, making EazyDraw ideal for page layout and logo design. Easily place text on curves, typeset at angles, flow text around graphics, link text boxes, flow text inside any shape, convert text to outlines, gradient fill characters, set tabs with leaders, and more; all easy to learn and use with the modern intuitive interactive user interface.\nTechnical drawing made easy. Draw to scale, auto-dimensioning, precision numeric readout and entry, fractions with feet and inches or metric, graphic grids and guides, on-drawing tape measure, vertex and geometric snapping, advanced duplicate, spokes and gear tools, schematic cross-overs, auto numbering, math function curves, graphic axes and labels, tangents and normals, professional grade tools that everyone can use.\n\n\n\nTechnical Drawings\n\nGet your designs on paper without the &quot;CAD&quot; hassle. EazyDraw has all the capability needed to draw efficiently and accurately: draw to scale(s), use a grid, enter sizes numerically, wall and window tools, automatic dimensions, pattern fills, auto-number -- all with with vector quality and PDF output\n\n\n\n\nSystem Requirements: \n\nMAC OS X.4.11 - and up......Leopard, Snow and INTEL RECOMMENDED\n\nonline manual link:  &lt;a href=&quot; https://www.eazydraw.com/cgi-bin/ezdManualLoad.cgi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://www.eazydraw.com/cgi-bin/ezdManualLoad.cgi&lt;/a&gt;\n\n---PLEASE SEED ---\t\t\n","torrent":{"xt":"urn:btih:3b9e26eca0b67b3ee69dbe0b9fbc468b89a7039f","amp;dn":"EastDraw+3.6.1+%5BK%5Drack%5C%27d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9e26eca0b67b3ee69dbe0b9fbc468b89a7039f","infoHashBuffer":{"type":"Buffer","data":[59,158,38,236,160,182,123,62,230,157,190,11,159,188,70,139,137,167,3,159]},"announce":[],"urlList":[]}}