{"title":"My.So.Take.2010.DVDRip.XviD-AMiABLE","uid":6177422,"size":731601362,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ced9fc8400b2c3163a4b3f4102e21276fc07fe2&amp;dn=My.So.Take.2010.DVDRip.XviD-AMiABLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XoLWoX","files":-1,"time":1297817700,"description":"Genre: Horror, Thriller\n\nRating:4.5\n\nCountry:USA\n\nPlot Outline:In the sleepy town of Riverton, legend tells of a serial killer who swore he would return to murder the seven children born the night he died. Now, 16 years later, people are disappearing again. Has the psychopath been reincarnated as one of the seven teens, or did he survive the night he was left for dead? Only one of the kids knows the answer. Adam &quot;Bug&quot; Heller (Max Thieriot) was supposed to die on the last night the Riverton Ripper wrecked havoc on that terrifying night. Unaware of terrifying crimes being committed to the seven children, he has been plagued by nightmares of their murders while not aware if they hold true or if he is simply imagining the images that haunt him. But if Bug hopes to save his friends from the monster that's returned, he must face an evil that won't rest...until it finishes the job it began the day he was born.\n\n\nPlot: In the sleepy town of Riverton, legend tells of a serial killer who swore he would return to murder the seven children born the night he died. Now, 16 years later, people are disappearing again. Has the psychopath been reincarnated as one of the seven teens, or did he survive the night he was left for dead? Only one of the kids knows the answer. Adam &quot;Bug&quot; Heller (Max Thieriot) was supposed to die on the last night the Riverton Ripper wrecked havoc on that terrifying night. Unaware of terrifying crimes being committed to the seven children, he has been plagued by nightmares of their murders while not aware if they hold true or if he is simply imagining the images that haunt him. But if Bug hopes to save his friends from the monster that's returned, he must face an evil that won't rest...until it finishes the job it began the day he was born.","torrent":{"xt":"urn:btih:3ced9fc8400b2c3163a4b3f4102e21276fc07fe2","amp;dn":"My.So.Take.2010.DVDRip.XviD-AMiABLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ced9fc8400b2c3163a4b3f4102e21276fc07fe2","infoHashBuffer":{"type":"Buffer","data":[60,237,159,200,64,11,44,49,99,164,179,244,16,46,33,39,111,192,127,226]},"announce":[],"urlList":[]}}