{"title":"Project Blackout, free2play lobby based FPS","uid":6301674,"size":1997312,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3e129afb49b527c54db6791e134d11d2fc270ddf&amp;dn=Project+Blackout%2C+free2play+lobby+based+FPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DamienT81","files":1,"time":1302173174,"description":"The download server was offline last night due to a patch and since I didn't see an installer on tpb and this game is raising in populairity I thought let's share this with my fellow TPB-ers. \n\n\n\nOfficial site: [URL]http://pb.ntreev.net/[\\URL]\n\n\nDecription from the site:\n\n\nTest your limits!\n\n Project Blackout will test your skills as gamer with fast paced action, precision shooting, and twitch response times. Project Blackout\\'s graphics, surround sound, and camera effects will put you in the middle of the action and test your skills at a whole new level. Lock and load! Immersive Battlefields!\n Every map in Project Blackout is carefully crafted to give operators an immersive experience. With realistically skinned models and destructible environments, Project Blackout raises the bar for immersion in MMO shooters. Shoot through barriers to take out hiding enemies, employ explosives, dust, realistic ballistics, and utilize the environment to gain the edge and destroy your enemies!\n\nNeed a quicker route through a map? Make your own! Destroyable architecture makes it possible to create a shortcut through a map to gain a tactical advantage when you really need it. As the environments change, so will the operators need to adjust tactics to survive.\n\nEffective use of the environment is key to an operator\\'s survival.\n \nWeapon Extensions\n A well trained operator knows that without a weapon you might as well be dead already. In Project Blackout many weapons come with extensions that augment the functionality of your weapon. Whether its dual magazines, holo sights, scopes, or red dots these extensions will give you an edge in battle. But it\\'s all up to Operator preference; you need to pick the weapon you\\'re most efficient with! \n\n\n \nProtect that thick skull!\n Body armor and helmets give operators the ability to protect vital organs and their heads from enemy fire. Enemies will be watching for you to poke your head out and take you down, so don\\'t be caught without proper protection!\n\nIn Project Blackout, operators can shoot through enemies and barriers, so don\\'t rely on others or walls to protect you from that sniper. Smart tactics and good use of body armor will save an operator in a pinch!\n\nWith the desire for customization always on the rise, operators will have choices of special defensive and offensive bonuses, and equipment to improve battlefield experience! \nCall to Duty!\n There\\'s more to war than killing! You need training, you need equipment, and you need experience. Operators in Project Blackout are expected to keep at the top of their game. Project Blackout offers special missions in game that will reward operators with special perks, items, and ranks. These missions will drive you to be more than just another grunt with a gun, they\\'ll turn you into an elite operator.\n\nFortunately, these missions, while challenging, can be accomplished during regular play so you won\\'t need to be distracted while trying to complete your missions.\n\n\nFREE TO PLAY. PLEASE SHARE.","torrent":{"xt":"urn:btih:3e129afb49b527c54db6791e134d11d2fc270ddf","amp;dn":"Project+Blackout%2C+free2play+lobby+based+FPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e129afb49b527c54db6791e134d11d2fc270ddf","infoHashBuffer":{"type":"Buffer","data":[62,18,154,251,73,181,39,197,77,182,121,30,19,77,17,210,252,39,13,223]},"announce":[],"urlList":[]}}