{"title":"Philippines' Population Debate  2011 03 10  Aljazeera 101 East","uid":6258976,"size":317748190,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e55ca2c364af41a915ea4a061b9a8952a885f03&amp;dn=Philippines%5C%27+Population+Debate++2011+03+10++Aljazeera+101+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1300688346,"description":"Philippines' Population Debate  2011 03 10  Aljazeera 101 East\n\n303mb/24.59mns/avi\n\n\n101 East investigates why family planning remains a highly controversial issue in the Philippines.\n\nFamily planning is one of the Philippines' most volatile policy areas.\n\nA reproductive health bill which would give information and access to all forms of contraception has been delayed in Congress for more than 16 years. In that time, the population in the predominantly Roman Catholic country has almost doubled, draining health and economic resources.\n\nWith some two million children born every year, the UN warns that by 2025 the Philippines will not have enough resources to feed its population.\n\nThe bill is strongly opposed by the Church, which says it would promote promiscuity and abortion.\n\nBut supporters of the bill say birth control could help stem the nation's rapid population growth and give women more choice over the size and health of their families.\n\nA recent national survey showed that about one-in-three births in the Philippines were either unwanted or unplanned.\n\nMeanwhile, a tough anti-abortion law has driven abortions underground, with half a million Filipino women risking their lives each year to unsafe procedures with more than 80,000 women suffering complications and 1,000 dying.\n\nOn this edition of 101 East we look at one of Asia's most densely populated countries, the Philippines, and ask if the Catholic Church is affecting the nation's health.\n\n\n\n\nWatch Aljazeera Live at: http://english.aljazeera.net/watch_now/\n\n\nOther shunster posts\n\n","torrent":{"xt":"urn:btih:3e55ca2c364af41a915ea4a061b9a8952a885f03","amp;dn":"Philippines%5C%27+Population+Debate++2011+03+10++Aljazeera+101+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e55ca2c364af41a915ea4a061b9a8952a885f03","infoHashBuffer":{"type":"Buffer","data":[62,85,202,44,54,74,244,26,145,94,164,160,97,185,168,149,42,136,95,3]},"announce":[],"urlList":[]}}