{"title":"Funkadelic -Tales of Kidd Funkadelic .flac files","uid":6262635,"size":318880807,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3fbd1f698275a6e4ef5e773d44c8c75e705fb087&amp;dn=Funkadelic+-Tales+of+Kidd+Funkadelic+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ulikes","files":14,"time":1300799048,"description":"the highlights of this album were:\n\n&quot;Butt-To-Butt&quot;--for it's sheer weirdness and that sick guitar\nsolo towards the end. which I don't know if it's the late\nEddie Hazel, Michael Hampton, or Ron Brykowski\n(an unsung white member of the early funk mob!)\nwho was playing it, but whomever it was, they were killing it!\n\n&quot;Let's Take It To The People&quot;--Just a groovy little clavinet &amp; guitar\ndriven ditty that's short and sweet. I like the vocal arrangement and\noverall attitude of the song, though it's quite nonsensical.\n\n&quot;Undisco Kidd&quot; was just BAAADDD!!--Like the song says!\nSo dang funky with Bootsy bubblin' and thumpin' on his\nmutron spacebass, Bernie &quot;Da Vinci&quot; Worrell creating whole\nnew soundscapes on synthesizers and piano that were then unheard of!\n(Dr. Dre would capitalize off of them big time 20 yrs later!),\nand ol' George signifying and recanting his tale of\n&quot;The Kidd V.S. The Freaky Little Groovy From The Funky Side Of Town&quot;\nin his cool laid back pre-hip hop era style!\n\n&quot;Take Your Dead Ass Home&quot; gets a mention not for it's music,\nbut for it's rawkus chorus, which was a regular chant at P-Funk\nshows, and it's naughty nursery rhyme style limericks\n&quot;There once was a man from Peru!&quot;...etc.\nSounds harmless and silly by today's profane &amp; in-your-face\nstandards, but it was taboo wicked stuff to my\n12 yr old ears back then! (-:\n\n&quot;I'm Never Gonna Tell It&quot; was an unusual approach,\nchordally and vocally for a love song with a soulful &amp; funky edge.\nP-Funk wasn't so much into the schmaltzy syrupy romantic ballads\nof the time, so they had to funk them up to make it fit\nwithin their concept.\n\n&quot;Tales Of Kidd Funkadelic&quot; was a 12 minute and 56 minute\nexperimental synthesizer opus by one of the unsung innovators\nand geniuses of modern popular music!\nBernie &quot;Da Vinci&quot; &quot;The Insurance Man For The Funk&quot; Worrell\nwas well versed in the classical, jazz, R&amp;B and rock idioms\non keyboards since the age of 5, when he composed his own\nfirst concerto! Though the keyboard sounds sound outdated\nby today's standards, remember this was all analogue stuff!--\nSo Bernie was literally creating his own sounds that nobody\nelse was using at that time, and pushing the envelope for\nwhat the synthesizer could do!--Creating a language for pop,\nrock, alternative, techno, and everything that came after it!\nJust smoke you a good joint or take you a few sips of a\ngood drink, turn this up in your headphones or your speakers\nand take the journey! (Go on!--Don't be scuuurrrd!)\nSparse, ominous, weird vocals, congas...POST MODERN TRIBALISM!!\n\nLast but not least, is still a favorite of mine...\n&quot;How Do You View Yeaw?&quot; is basically metaphysical theory\nin a slow sinewy funky grooved out 3 minute &amp; 39 second sermon!\n(Hear &quot;LIBERATION&quot; by Outkast, and you'll see where they got\nthe vibe of that song from!)\n&quot;Have You Ever Known Someone Who Takes Personal The Rain?&quot;\n&quot;Sees His Glass Half-Empty, Rather Than Half-Full?&quot;\nBasically, how you see yourself inside manifests itself\nin the result of your life's experiences!--FUNK IS ZEN!!\nBootsy thumpin', Bernie whizzin', the KF girls sounding like\nspace sirens, George and the boys musin' together in key!\n---Fade Out---\nThis album sounds great digitally remastered, and is essential\nif you are just discovering what the whole P-Funk Movement\nwas about and collecting crucial albums in it's\nevolutionary development. Don't let the unfunky, stodgy,\nPlacebo Syndrome-effected hum-drums turn you from your path!\nDiscover the hidden fun, smokin' groove, and subliminal brilliance\nthat was THE PARLIAFUNKADELICMENT THANG!! Funk On Y'all! \n\nAs soon as I can find it I'll put the last Funkadelic album I haven't posted, &quot;Cosmic Slop,&quot; up.\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:3fbd1f698275a6e4ef5e773d44c8c75e705fb087","amp;dn":"Funkadelic+-Tales+of+Kidd+Funkadelic+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fbd1f698275a6e4ef5e773d44c8c75e705fb087","infoHashBuffer":{"type":"Buffer","data":[63,189,31,105,130,117,166,228,239,94,119,61,68,200,199,94,112,95,176,135]},"announce":[],"urlList":[]}}