{"title":"3DRT Pinball 1.0","uid":6257910,"size":3199720,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:40481e0dbae2adfb2b2d975a0853c24834ce0a97&amp;dn=3DRT+Pinball+1.0+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lapu2006","files":1,"time":1300645574,"description":"TLK Games 3DRT Pinball machine looks and reacts like a real bar machine with fantastic ballistics effects and realistic sounds. Each of the four tables is a complete game with great graphic works, full sound effects, music and decor and its own rules. It offers a challenge to all levels of players. Real connoisseurs will enjoy it most. The high-tech ballistics is faultless, real 3D Real Time. The table can be adjusted for best visual comfort and you even may shake the table to a tilt. After a few minutes of games, you are immerged in the atmosphere of a Tin Pan Alley bar on a classy SPACE ATTACK PIN BALL MACHINE, fingers studded on the flipper commands, ready to fire to save the ball and reach a million BONUS. Minutes later, you will play more leisurely on the Western table on a background of grass root music. If you like SOCCER but do not like the wet benches of the stadium, you will go for the FOOTBALL Association table of your computer, flippers turning into gold soccer shoes to beat the goal keeper, according to the 17 Cambridge rules. You can also look for nightmares playing on the table SWAMP OF TERROR under moonlight with classy light and transparency effects.\n\n\n\nSoftware OS: \tWin98,WinME,WinXP,Windows2000\nSetup Filename: \t3drt_pinball_share.exe\nSystem Requirements: \tPentium 400, 128 MB, 3D Graphic Card, Sound Card, DirectX\n\n\nSeeD,SeeD!!","torrent":{"xt":"urn:btih:40481e0dbae2adfb2b2d975a0853c24834ce0a97","amp;dn":"3DRT+Pinball+1.0+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40481e0dbae2adfb2b2d975a0853c24834ce0a97","infoHashBuffer":{"type":"Buffer","data":[64,72,30,13,186,226,173,251,43,45,151,90,8,83,194,72,52,206,10,151]},"announce":[],"urlList":[]}}