{"title":"Scar.HDRip.Castellano.avi","uid":6174140,"size":1729441792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42906809bc8f63aa81eb91c050f5e029d5fba118&amp;dn=Scar.HDRip.Castellano.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"erato99","files":1,"time":1297702944,"description":"Calidad de video: HD Rip\nPeso: 1610 mb\nIdioma del audio: Castellano AC3 5.1\n\nLa historia de Ernie Bishop (Ben Cotton), el enterrador local, sigue en boca de todos en Ovid, un pueblo de Colorado. La terrible leyenda nacio hace 16 anos, pero el pueblo aun no se ha recuperado. Ernie Bishop secuestraba a adolescentes y los encerraba en el sotano de la funeraria, en los cajones destinados a los cadaveres. Torturaba e infligia cortes a sus victimas y les ensenaba el reflejo de su sadismo en un pequeno espejo. Los recuerdos de esa epoca no se han borrado. Una de sus victimas, Joan Burrows (Angela Bettis), consiguio escapar, matando a Bishop en su huida, y se convirtio en la heroina local. Joan, que se fue del pueblo despues del incidente y ahora es una agente inmobiliaria de exito, regresa por primera vez al cabo de 16 anos con ocasion de la coronacion de su sobrina Olympia (Kirby Bliss Blanton) como %u201CReina Pescadora%u201D.\n\nPero en cuanto llega, alguien empieza a imitar a Bishop. Secuestran a varios adolescentes, todos amigos de Olympia, y aparecen sangrientas pistas. Al principio, Joan teme que Bishop haya regresado y cree que se esta volviendo loca. Pero cuando Olympia tambien desaparece, Joan decide seguir las huellas del asesino... \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:42906809bc8f63aa81eb91c050f5e029d5fba118","amp;dn":"Scar.HDRip.Castellano.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42906809bc8f63aa81eb91c050f5e029d5fba118","infoHashBuffer":{"type":"Buffer","data":[66,144,104,9,188,143,99,170,129,235,145,192,80,245,224,41,213,251,161,24]},"announce":[],"urlList":[]}}