{"title":"Glenn Beck 2011-02-09 (Radio Web Rip)","uid":6163049,"size":37261607,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:42b3ed63e45478f3b8c070ad76b3215ea5e89bcd&amp;dn=Glenn+Beck+2011-02-09+%28Radio+Web+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saturn.tpb","files":3,"time":1297280774,"description":"Ripped from the new live stream from Glenn Beck\\'s web site. I have edited out the music played during the commercial breaks.\n\nI need input on something.  Normally I edit out the live commercials Glenn does if they are just the boring old straight commercial (ie he\\'s reading copy).  If during my preparation I notice the live commercial is actually funny, entertaining, and/or informative I will leave them in (as much as necessary).  I also like leaving the funny, etc ones in because it might help support Glenn Beck in some way.\n\nSo the question is this:  Do you care if I leave in the live commercials?  Please choose one of the following:\n\nA) Who is Glenn Beck?\nB) Leave the live commercials in if they are funny, entertaining, or informative.\nC) Edit out ALL the live commercials.\nD) Leave in ALL the live commercials.\nE) I hate Glenn Beck because I\\'m afraid to do my own research and find out the truth and would rather have sound bites of Glenn taken out of context and spun to the point they are entirely untrue so I can live in my progressive little cocoon of government/liberal media supplied misinformation.\nF) Everything E said and fuck you and Glenn Beck too!\nG) None of the above and here\\'s why... (please elaborate if you choose G).\n\nThe most chosen response of B, C, D, or G will heavily influence my work.\n\nBTW, in case anybody\\'s still reading, the reason I ask this is because lately rest of the guys have been really involved in the live commercials so I find myself leaving more in.","torrent":{"xt":"urn:btih:42b3ed63e45478f3b8c070ad76b3215ea5e89bcd","amp;dn":"Glenn+Beck+2011-02-09+%28Radio+Web+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b3ed63e45478f3b8c070ad76b3215ea5e89bcd","infoHashBuffer":{"type":"Buffer","data":[66,179,237,99,228,84,120,243,184,192,112,173,118,179,33,94,165,232,155,205]},"announce":[],"urlList":[]}}