{"title":"Democracy Now - 06 apr 2011","uid":6299859,"size":456201043,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4319d9c2d1088ad84b022e31fa4da27a1f956d86&amp;dn=Democracy+Now+-+06+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1302116937,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 06, 2011\n\n- Radioactive Water Leak Plugged at Fukushima Plant\n- Tokyo Electric Power Proposed New Nuclear Reactors at Fukushima After Disaster\n- Libyan Rebels Criticize NATO Mission\n- Ouattara Forces Enter Gbagbo Residence\n- ICC Prosecutor Calls for Ivory Coast War Crimes Probe\n- Budget Talks at Impasse as Shutdown Looms\n- GOP Calls for $5.8T in Budget Cuts, Lower Taxes for Corporations and Top Earners\n- Wisconsin Holds Key Judicial Vote; GOP May Renew Anti-Union Legislation\n- U.S. Accused of Killing 6 Afghan Civilians\n- Saleh Forces Fire on Protesters; U.S. Calls for &quot;Quick&quot; Transition\n- Syrian Death Toll Rises to 173\n- Ecuador Expels U.S. Ambassador over WikiLeaks Cables\n- Texas Measure Would Force Schools to Promote Heterosexual Lifestyle\n- Study: African Americans Worse Off than in 2010\n\n\nSpecial reports\n\n- Freed from Captivity in Libya, Anthony Shadid of the New York Times Recounts Ordeal under Gaddafi's Forces\n\nAnthony Shadid is one of four New York Times reporters who were captured in Libya last month by forces loyal to Muammar Gaddafi. They were held for nearly a week, during which they were beaten and threatened before ultimately being set free. Just two weeks after their release, Shadid joins us for an extensive interview on his ordeal in Libya, the outlook of the conflict, and his thoughts on the rolling rebellions sweeping the Middle East and North Africa. A two-time Pulitzer winner, Shadid is the New York Times Beirut bureau chief.\n\n\n- Intervention Could Make Things Worse: New York Times' Anthony Shadid on Rebellions in Libya and the Middle East\n\nIn Libya, government and rebel forces remain locked in a deadly stalemate as rebels fight for an end to Col. Muammar Gaddafi's nearly 42-year rule. We speak with New York Times correspondent and two-time Pulitzer Prize-winning reporter Anthony Shadid, who covered the conflict between government and rebel forces before he and three colleagues were kidnapped and beaten by Gaddafi's forces. They were released two weeks ago. We speak with Shadid about the situation in Libya and the popular rebellions rising up across the Middle East and North Africa. &quot;There's going to be a desire to intervene, I think, as this gets more dangerous and more complicated and more violent, but I think that intervention [by allied forces], that very intervention, could very well make things worse,&quot; says Shadid.\n\n\n- New York Court to Hear Case Against Psychologist Accused of Torture in GuantÃƒÂ¡namo Interrogations\n\nThe Obama administration has announced that key suspects in the 9/11 attacks will be tried by military commissions at the U.S. military base at GuantÃƒÂ¡namo Bay-not in U.S. civilian court. There will, however, be one GuantÃƒÂ¡namo case tried in New York. Today the New York State Supreme Court will hear the case against Dr. John Leso, a psychologist accused of participating in torture during interrogation of detainees in GuantÃƒÂ¡namo. The case was brought on behalf of Dr. Steven Reisner, who is at the center of a growing group of medical professionals campaigning against the participation of psychologists in the U.S. government's interrogation programs.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:4319d9c2d1088ad84b022e31fa4da27a1f956d86","amp;dn":"Democracy+Now+-+06+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4319d9c2d1088ad84b022e31fa4da27a1f956d86","infoHashBuffer":{"type":"Buffer","data":[67,25,217,194,209,8,138,216,75,2,46,49,250,77,162,122,31,149,109,134]},"announce":[],"urlList":[]}}