{"title":"Como.funciona.la.mente.-.Steven.Pinker.(ebook).","uid":6132322,"size":4012643,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4430be0fa2ca5138089f48c855216913654cbec2&amp;dn=Como.funciona.la.mente.-.Steven.Pinker.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1296173303,"description":"Este libro se inicia con una nota de humildad y termina con otra. Son de naturaleza muy diferente y el espacio que hay entre ellas aclara la razÃƒÂ³n de ser de esta obra. La primera hace referencia al tÃƒÂ­tulo del libro, que podrÃƒÂ­a dar la impresiÃƒÂ³n de que el conocimiento de la mente ha concluido y no queda nada por hacer.\n\nNada mÃƒÂ¡s lejos de la realidad.\n\n\n\nEl propio autor aclara que nadie sabe cÃƒÂ³mo funciona la mente, o al menos, nadie sabe cÃƒÂ³mo funciona la mente al mismo nivel que se conoce el funcionamiento de otros muchos fenÃƒÂ³menos. Pero para explicar el tÃƒÂ­tulo toma prestada de Noam Chomsky la interesante distinciÃƒÂ³n entre misterios y problemas:\n\n    Cuando abordamos un problema, puede que no sepamos su soluciÃƒÂ³n, pero tenemos intuiciÃƒÂ³n, un conocimiento cada vez mayor y ciertas ideas de quÃƒÂ© andamos buscando. Cuando nos enfrentamos a un misterio, sin embargo, sÃƒÂ³lo podemos quedarnos mirando fijamente, maravillados y desconcertados, sin siquiera saber quÃƒÂ© aspecto tendrÃƒÂ­a una explicaciÃƒÂ³n.\n\nY ÃƒÂ©se se convierte en el tema central del libro: la mente concebida como un problema al que se entrevÃƒÂ© una soluciÃƒÂ³n. Y el camino de la soluciÃƒÂ³n se inicia sosteniÃƒÂ©ndose sobre dos pilares fundamentales para comprender CÃƒÂ³mo funciona la mente: la computaciÃƒÂ³n y la evoluciÃƒÂ³n por selecciÃƒÂ³n natural. Son de tal importancia y fundamento y a la vez estÃƒÂ¡n tan repletos de mitos e ideas errÃƒÂ³neas que el autor dedica todo el capÃƒÂ­tulo inicial a aclararlos y despejar posibles obstÃƒÂ¡culos","torrent":{"xt":"urn:btih:4430be0fa2ca5138089f48c855216913654cbec2","amp;dn":"Como.funciona.la.mente.-.Steven.Pinker.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4430be0fa2ca5138089f48c855216913654cbec2","infoHashBuffer":{"type":"Buffer","data":[68,48,190,15,162,202,81,56,8,159,72,200,85,33,105,19,101,76,190,194]},"announce":[],"urlList":[]}}