{"title":"Garmin AdriaRoute 3.11 Update Mapsource 624 MB","uid":6143952,"size":593324050,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:456431e7239e435b5688c2686e040802e8bea43d&amp;dn=Garmin+AdriaRoute+3.11+Update+Mapsource+624+MB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"b-anonym","files":1,"time":1296599833,"description":"AdriaROUTE map is detailed routable map of SouthEast Europe. AdriaROUTE includes maps of 8 countries: Croatia,Slovenia,Bosnia \nand Herzegovina,Serbia,Montenegro,Kosovo,FYRO Macedonia and Albania. In AdriaROUTE map there are more then 100 000 \nsearchable points of interest (POI-a) and over 350 000 km of roads. Cartographical details include: urban areas,forests \n(Croatia,Slovenia and Bosnia\nand Herzegovina),islands,rivers,railway network,and parks.\nAdriaROUTE map will guide you to the street level detail in all included cities,and in many you can use street number (exact \naddress) as your destination. In Slovenia all towns (villages included) have street level and house number detail. In Croatia,\n749 towns have street name detail and 625 towns have house numbers. Database includes settlements: 6850 for Croatia (all \naccording to the list from 2001.),6000 in Slovenia and 5800 in Bosnia and Herzegovina,10000 in Serbia,1200 in Montenegro,\n3000 in Kosovo,2400 in Macedonia and 3000 in Albania. In Serbia 716 towns have street name detail and 654 towns have house \nnumbers. In Bosnia and Herzegovina 93 towns are covered with street names,in Montenegro 14,in Kosovo 9 and in FYRO Macedonia \n26 biggest towns are covered with street names. In Albania are 12 biggest towns covered with street names. List od all covered \nplaces with street names and house numbers could be found on our web page. Multi-body search is enabled (searching based on a \nknown part in name),as well as full POI search. Descriptions of POIs include additional info such as: classification of point,\nfull address and phone number which can be automatically dialed using the devices witch support Bluetooth connection to your \nGSM phone. You can choose shortest,fastest or off-road route. Updates are free\nAdriaROUTE map can calculate direct route towards any place in western or eastern Europe (on devices with preloaded City \nNavigator maps).\nMain features:\nroute calculation and auto-routing through 8 countries (Slovenia,Croatia,Bosnia and Herzegovina,Former Yugoslav Republic \nof Macedonia,Albania,Serbia,Montenegro and Kosovo)\nroute calculation and auto-routing to and from western European countries\nguidance to the exact address\nchoice of shortest,fastest or off-road route\nchoice of vehicle for route calculation: car/motor,bike,pedestrian (soon: taxi,bus,truck,ambulance)\nautomatic switching from day-time to night-time map view\nautomatic zooming for turns\ndetailed trip computer\npossibility of creating the optimal route for goods deliveries\npossibility of marking points\nitinerary preparation on the PC and point,route,and track transfer between GPS and PC\n3D map view and navigation\n","torrent":{"xt":"urn:btih:456431e7239e435b5688c2686e040802e8bea43d","amp;dn":"Garmin+AdriaRoute+3.11+Update+Mapsource+624+MB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456431e7239e435b5688c2686e040802e8bea43d","infoHashBuffer":{"type":"Buffer","data":[69,100,49,231,35,158,67,91,86,136,194,104,110,4,8,2,232,190,164,61]},"announce":[],"urlList":[]}}