{"title":"Kaufen fuer die Muellhalde - Arte Doku 2010","uid":6194520,"size":368198780,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4752330e35d07b5b54cc8097a6b65520758d5ec7&amp;dn=Kaufen+fuer+die+Muellhalde+-+Arte+Doku+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"avergeesc","files":1,"time":1298414910,"description":"Kaufen fÃƒÂ¼r die MÃƒÂ¼llhalde\n\n\nGlÃƒÂ¼hbirnen, NylonstrÃƒÂ¼mpfe, Drucker, Mobiltelefone - bei den meisten dieser Produkte ist das Abnutzungsdatum bereits geplant. Die Verbraucher sollen veranlasst werden, lieber einen neuen Artikel zu kaufen, als den defekten reparieren zu lassen. Die bewusste VerkÃƒÂ¼rzung der Lebensdauer eines Industrieerzeugnisses, um die Wirtschaft in Schwung zu halten, nennt man &quot;geplante Obsoleszenz&quot;. Bereits 1928 schrieb eine Werbezeitschrift unumwunden: &quot;Ein Artikel, der sich nicht abnutzt, ist eine TragÃƒÂ¶die fÃƒÂ¼rs GeschÃƒÂ¤ft&quot;.\nGestÃƒÂ¼tzt auf mehr als drei Jahre dauernde Recherchen, erzÃƒÂ¤hlt die Dokumentation die Geschichte der geplanten Obsoleszenz. Sie beginnt in den 20er Jahren mit der Schaffung eines Kartells, das die Lebensdauer von GlÃƒÂ¼hbirnen begrenzt, und gewinnt in den 50er Jahren mit der Entstehung der Konsumgesellschaft weiter an Boden.\nHeute wollen sich viele Verbraucher nicht mehr mit diesem System abfinden. Als Beispiel fÃƒÂ¼r dessen verheerende Umweltfolgen zeigt die Dokumentation die riesigen Elektroschrottdeponien im Umkreis der ghanaischen Hauptstadt Accra. Neben diesem schonungslosen Blick auf die Wegwerfgesellschaft stellt Filmemacherin Cosima Dannoritzer auch die LÃƒÂ¶sungsansÃƒÂ¤tze von Unternehmern vor, die alternative Produktionsweisen entwickeln. Und Intellektuelle mahnen an, die Technik mÃƒÂ¶ge sich auf ihre ursprÃƒÂ¼ngliche Aufgabe zurÃƒÂ¼ckbesinnen, auf die dauerhafte Erleichterung des Alltags ohne gleichzeitige VerwÃƒÂ¼stung des Planeten.","torrent":{"xt":"urn:btih:4752330e35d07b5b54cc8097a6b65520758d5ec7","amp;dn":"Kaufen+fuer+die+Muellhalde+-+Arte+Doku+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4752330e35d07b5b54cc8097a6b65520758d5ec7","infoHashBuffer":{"type":"Buffer","data":[71,82,51,14,53,208,123,91,84,204,128,151,166,182,85,32,117,141,94,199]},"announce":[],"urlList":[]}}