{"title":"Spec Ops (Full PSX Collection) (PS1) (Army Games) (Use ePSXe)","uid":6294695,"size":360611946,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:486ce75578915a16d4f8fab9ccd7156a57752bee&amp;dn=Spec+Ops+%28Full+PSX+Collection%29+%28PS1%29+%28Army+Games%29+%28Use+ePSXe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":10,"time":1301948217,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n----------\n----------\n----------\n\nSpec Ops: Airborne Commando:\nSpec Ops: Airborne Commando is a third-person action shooter that sends you deep behind enemy lines to carry out top-secret operations: you must rescue friendly forces, destroy strategic military structures, secure intelligence information, and eliminate high-profile targets. You'll have to remember your training, skills, and actions in order to survive in the missions.\n\n    * Features: Dive into hostile territory as an expertly trained and superbly equipped U.S. Airborne Ranger.\n    * Execute precise maneuvers during 16 challenging missions to rescue hostages, destroy bridges, disable radar sites, and more.\n    * Engage the enemy with weapons like the M4 Machine Gun, LAW Rockets, and Hand Grenades.\n    * Gain the tactical advantage in dense jungles, barren deserts, rugged mountains, and snow-filled forests.\n    * Rely upon superior equipment such as Laser Targeters, Mine Detectors, and advanced computers to accomplish mission goals!\n-------------------------\n-------------------------\n-------------------------\n\nSpec Ops: Covert Assault:\nYour team of Rangers is depending on you to lead the way past enemy lines You're not going to let them down, are you? As with previous series installments, you can choose a two-man team from a group of six unique Rangers. Combining snipers, gunners, grenadiers, and others, you'll try to put together a crack pair to take on the enemy forces without faltering. The action takes place over the course of four unique locales, including the likes of Sicily and the Longtain Airbase. Strategy, of course, will be your greatest ally, but a little firepower never hurt an operation either: More than 10 weapons types including M16s, shotguns, and grenade launchers will be at your disposal throughout the experience. The game's graphics are stellar, and sound effects like explosions, weapons firing, and commands being shouted out only add to the realistic nature of the adventure. You can command the two-man team by yourself, but dual-player cooperative missions are fun, too. \n-------------------------------\n-------------------------------\n-------------------------------\n\nSpec Ops: Ranger Elite\nThe thugs and creeps of the world's underbelly are about to meet their match you! Following in the footsteps of earlier releases in the acclaimed SPEC OPS series, SPEC OPS: Ranger Elite lets you select two characters from a pool of tough guys. Choose your team carefully, as each soldier has a unique set of skills, and some pairings will work better than others. Once you've got your duo, guide them through intense, 3D environments, taking out smugglers, terrorists, and other bad dudes. Each international location is based a real-world setting, and the graphics are detailed enough to take the breath right out of your lungs. If you're playing alone, the computer will control one of you two characters, while two-player action is a cooperative mission in split-screen fashion. With so many operatives to choose from, this installment guarantees high replay value and maximum excitement for series fans and newcomers alike. \n--------------------------------------------\n--------------------------------------------\n--------------------------------------------\n\nSpec Ops: Stealth Patrol:\nSpec Ops: Stealth Patrol is a game that tries to mix the realistic art of tactical warfare with elements of an action game. The end result is a game that looks and feels like a typical action game but punishes you for trying to play it as such since the AI and missions require you to use more tactics than bullets.\n\nAt the beginning of each level, you must choose two rangers to control from a team of five. Each of the rangers is skilled in various forms of combat - some are better with a shotgun at close quarters while others are better suited to sniping from a distance. Understanding each of the ranger's special skills makes choosing the correct team for a particular mission one of the keys to success in the game.\n\nEach of the five stages in the game takes you to a different location where there is a political situation that needs to be rectified by force. Once your rangers are on the scene, it's up to you to guide the two-man team to victory. Some missions are the standard &quot;shoot everyone you see and go home&quot; type, while others are more involved and objective-based. Some of the more difficult missions require you to slip behind enemy lines and plant explosives while avoiding enemy detection.\n\nControlling the game is a little more difficult than most other action games since you must manage both members of your team. You can direct the two rangers on a mission in two different ways. One is to simply push a button that switches your control between the two soldiers. While neat at first, this method tends to wear thin after a while since you have to keep switching back and forth to move them along. The other way to control the team is to simply issue one of four orders to the other ranger like &quot;follow me&quot; or &quot;move up.&quot; While controlling two different soldiers is interesting and one of the best things about the game, the best way by far to play Spec Ops: Stealth Patrol is to play in the game's two-player, split-screen co-op mode with a friend. This co-op mode is similar to Perfect Dark's two-player mode in that each one of the players can play independently of one another at the same time in the same mission. You and a friend can choose to complete the mission objectives separately or attack the enemy in the standard two-man cover formation.\n\nVisually, Spec Ops: Stealth Patrol is a little on the weak side. The 3D models used for the soldiers are fair, but some of the animations - such as performing rolls and other maneuvers - ruin the illusion of reality. The environments are simple in design and look. The textures used in the game don't look very convincing, nor do the majority of the 3D models used for many of the vehicles and objects within the levels. The biggest problem with the Spec Ops visuals, however, is the terribly short distance at which the level draws in before your character. As you progress through a level, you must constantly keep checking up ahead with binoculars or a sniper rifle to see if any enemies lie in your path. If you don't keep checking, you are sure to come into contact with an enemy soldier who not only appears out of thin air right in front of you but also starts shooting as soon as he does.\n\nIn the audio department, the game has several things going for it. The music has a broad range that really adds tension and suspense to some of the missions where stealth is the key. In addition, most of the sound effects of the various weapons and explosions come across fairly realistically.\n\nAt any rate, Spec Ops: Stealth Patrol isn't the most spectacular game on the PlayStation, but it does deliver enough basic fundamentals like control, gameplay, and presentation to make it easily worth Your While\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:486ce75578915a16d4f8fab9ccd7156a57752bee","amp;dn":"Spec+Ops+%28Full+PSX+Collection%29+%28PS1%29+%28Army+Games%29+%28Use+ePSXe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"486ce75578915a16d4f8fab9ccd7156a57752bee","infoHashBuffer":{"type":"Buffer","data":[72,108,231,85,120,145,90,22,212,248,250,185,204,215,21,106,87,117,43,238]},"announce":[],"urlList":[]}}