{"title":"James Walbourne - The Hill (2011) Mp3 320 vtwin88cube","uid":6248631,"size":94758574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:492ca028c345737149c76d876c71c8a613f07848&amp;dn=James+Walbourne+-+The+Hill+%282011%29+Mp3+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1300320465,"description":"James Walbourne\nThe Hill (2011)\n\n\nBest-selling novelist and part-time music critic Nick Hornby once described James Walbourne's guitar work as &quot;an unearthly cross between James Burton, Peter Green, and Richard Thompson,&quot; and went on to add &quot;Walbourne's fluid, tasteful, beautiful solos drop the jaw, stop the heart, and smack the gob, all at the same time.&quot; Hornby is hardly Walbourne's first or only famous admirer, and he racked up an impressive list of credits before making his solo debut in 2011 with his album The Hill.\n\nBorn in 1980 in the North London community of Muswell Hill, James Walbourne developed an enthusiasm for American roots music styles as a young man, and by 1999 he was playing with former Long Ryders leader Sid Griffin in his U.K.-based group the Coal Porters. In 2000, Walbourne made his recording debut with the British alt-country act the Peter Bruntnell Combination on their album Normal for Bridgwater, and recorded and toured with them through 2003. As word about Walbourne's talents spread, he became an in-demand sideman, recording with Dust, Death in Vegas, and the Arlenes. Joe Pernice of the Pernice Brothers met Walbourne in 1998 when they were both booked on an ill-fated multi-artist tour of Holland; the two struck up a friendship, and in 2003 Walbourne joined the Pernice Brothers in time to tour with them in support of the album Yours, Mine &amp; Ours. That same year, Walbourne was recruited to play guitar with Uncle Tupelo and Son Volt founder Jay Farrar on a string of solo shows. When Farrar relaunched Son Volt in 2005, Walbourne sat in with the band for some live dates and temporarily replaced departing guitarist Brad Rice in 2007, becoming a full member of the group in 2009.\n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\t\t\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop/Rock\nLabel:\t\t\tHeavenly\n\nTrack List:\n\n01.The Hill\n02.Road\n03.Songbird\n04.Northern Heights\n05.Waiting Room Blues\n06.Fool\n07.Never Going To Leave\n08.Sailed The Seas\n09.Cocaine Eyes\n10.BBC\n\n\nCheers!","torrent":{"xt":"urn:btih:492ca028c345737149c76d876c71c8a613f07848","amp;dn":"James+Walbourne+-+The+Hill+%282011%29+Mp3+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492ca028c345737149c76d876c71c8a613f07848","infoHashBuffer":{"type":"Buffer","data":[73,44,160,40,195,69,115,113,73,199,109,135,108,113,200,166,19,240,120,72]},"announce":[],"urlList":[]}}