{"title":"Coast to Coast AM - 2011-02-02 - Optimism, Technology, &amp; the Fut","uid":6170837,"size":55893463,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4a2520a9327c9499470ccfe9f786d298183aa517&amp;dn=Coast+to+Coast+AM+-+2011-02-02+-+Optimism%2C+Technology%2C+%26+the+Fut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297566645,"description":"Date: \t02-02-11\nHost: \tGeorge Noory\nGuests: \tMark Stevenson, Dr. Sherri Tenpenny\n\nWriter, deep-thinker, and stand-up comedian Mark Stevenson shared his journey to find out what the future holds, and how we can approach it with a sense of pragmatic optimism. He discussed his meetings and interviews with a variety of forward-thinking people including farmers in the Australian Outback who devised an ingenious but low-tech method of sustaining their grasslands, and the President of the Maldives, Mohamed Nasheed, who invited him to participate in an underwater cabinet meeting.\n\nStevenson also interviewed George Church, a molecular geneticist, who is trying to bring forward a \\&quot;personal genomics revolution,\\&quot; which could reveal how an individual\\'s genetic code interacts with the environment. He is currently sequencing the genomes of 100,000 volunteers and correlating it with their health and medical information. Eventually, this could lead to specific diet and pharmaceutical recommendations based on a person\\'s genetic markers, Stevenson explained.\n\nHe discussed the transhumanist movement to extend people\\'s lifespans, and the continued development of robots. Based on his research, he\\'s concluded that we don\\'t need to worry about \\&quot;robotic overlords\\&quot; taking over anytime soon, as they continue to have difficulty in doing basic tasks like walking. Stevenson also touched on the positive and negative aspects of interconnectivity through the Internet and mobile devices, how human organs are now being grown in labs, and nanotechnology-enabled printers that can manufacture anything from the ground up.\nVaccine Update\n\nFirst hour guest, Dr. Sherri Tenpenny talked about the hazards of vaccines. A just issued report by the International Medical Council on Vaccination outlines a variety of safety issues and problems with vaccines, and Tenpenny has set a goal of gathering 1 million digital signatures in support of the principles put forth in the report.\n\nNews segment guests: Doug Hagmann, Richard C. Hoagland\nWebsite(s):\n\n    * anoptimiststourofthefuture.com\n    * drtenpenny.com\n\nBook(s):\n\n    * An Optimist\\'s Tour of the Future\n    * Saying No to Vaccines\n","torrent":{"xt":"urn:btih:4a2520a9327c9499470ccfe9f786d298183aa517","amp;dn":"Coast+to+Coast+AM+-+2011-02-02+-+Optimism%2C+Technology%2C+%26+the+Fut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2520a9327c9499470ccfe9f786d298183aa517","infoHashBuffer":{"type":"Buffer","data":[74,37,32,169,50,124,148,153,71,12,207,233,247,134,210,152,24,58,165,23]},"announce":[],"urlList":[]}}