{"title":"Prayer Timings","uid":6276993,"size":35827531,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a5789b407cdc9957a5cc93794b93f4be71b01bb&amp;dn=Prayer+Timings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sayara69","files":1,"time":1301297831,"description":"Features\n\nPrayer Timings\nSalah is one of the most important obligation of a Muslim's daily life and needs to be performed at fixed times during the day. Take the guess work out of calculating prayer times - make your computer benefit you by calculating accurate prayer timings for you. You get daily as well as monthly timings throughout the year. Millions of cities available at your finger tips - absolutely FREE.\n\nFavourite Cities\nSet and retrieve favourite cities with ease. If you travel a lot with your laptop, you might want to save a lot of cities. Save upto 50 cities!\n\nHijri Date Adjustments\nPrayer Times allows you to adjust the hijri calendar by subtracting or adding days in order to reflect your current date.\n\nAdd Custom Cities\nCan't find the city you're looking for? No problem - enter details of your city and Prayer Times will remember them for you. Add custom cities with ease!\n\nAdd Custom Athans\nDo you like a particular Athan that you'd like to be played at prayer times? You can add your custom Athan now to Prayer Times for PCs. Included Athans are from: Mekkah, Medina, Yusuf Islam and other cities round the globe.\n\nMoon Phase display\nFor the curious, we have added a moon phase plugin to Prayer Times for PCs, which gives you a graphic indication of the current moon phase, along with percentage of moon illuminated. Stay ahead from the rest and know when important events and months begin, such as the begining of the month of Ramadan or arrival of Eid.\n\nFive Calculation Methods\nPrayer Times offers five famous prayer times calculation methods so that you may be able to switch between them based on your personal preference and locality.\n\nUsing custom prayer calculation method\nIf the built in calculations aren't good enough for you, you can set custom Fajr and Isha angles to compute prayer times\n\nAsr calculation methods\nPrayer Times has both standard (Imam Shafi', Hanbali, Maliki) as well as Hanafi method.\n\nAdd safety minutes to Zawal or Sunset\nPrayer Times comes with 1 minute of safety to Zawal and Sunset, if you feel that is not enough, feel free to add more minutes.p\n\nDua after Athan\nListen to Dua after Athan, can be switched on or off\n\nIslamic Events\nUse the Islamic Events of the Year feature to find out when's what! It provides dates of important Islamic events and festivals both in Hijri and Gregorian for the current year. Prayer Times PC is the only Athan Software you'll ever need for your Desktop!\n\nQibla Direction\nDid you know that magnetic compasses are incorrect and cannot be trusted for getting the direction of Kabah? This is because the magnetic field changes and does not point to the TRUE North. Prayer Times for mobiles gives you an accurate direction of the Qibla based on True North as well as the relative direction from the current position of the Sun or the Moon in the sky. Prayer Times PCs Pro has its own dedicated screen for Qibla direction (from North and the relative position from the Sun/Moon), distance to kaabah etc.\n\nAdjust individual prayer times\nYou can adjust prayer times individually by adding/subtracting minutes to individual prayer times.\n\nMany other features\nPrayer Times for PCs Pro is jam-packed with many features. The main screen is a unique design with various interactive features. We would suggest you play around to find its many powerful features.\n","torrent":{"xt":"urn:btih:4a5789b407cdc9957a5cc93794b93f4be71b01bb","amp;dn":"Prayer+Timings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a5789b407cdc9957a5cc93794b93f4be71b01bb","infoHashBuffer":{"type":"Buffer","data":[74,87,137,180,7,205,201,149,122,92,201,55,148,185,63,75,231,27,1,187]},"announce":[],"urlList":[]}}