{"title":"Sniper Elite (Online Playable) (Army Game)","uid":6138861,"size":4260586945,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4a6f8cdca86712121008a30f062474bdac3f9421&amp;dn=Sniper+Elite+%28Online+Playable%29+%28Army+Game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":5,"time":1296416722,"description":"INSTALLATION:\nExtract using 7-zip or winrar (www.7-zip.org, it's free)\nMount or Burn\nInstall\nCopy Over Crack (located on the disk/Iso Image) to game Directory, Replacing Existing File\nPlay (Online Or Single Player)\n-------------------------------------------------------\n-------------------------------------------------------\n-------------------------------------------------------\n\nStory:\nThe game follows protagonist Karl Fairburne as he attempts to prevent the Soviet Union taking control of Germany's nuclear secrets in and around Berlin, April 1945. Very little information is known about his background, other than he was raised in Berlin as the son of an U.S. ambassador to Germany before the war broke out, that he studied at West Point shortly after America's entrance into the war, and the fact that he was chosen for this mission because the city was his childhood home.\n\nThere are several factions contending for supremacy in the city, including the German resistance, who wish to aid Karl, the Soviet NKVD, and the Nazi forces. Martin Bormann, an extremely powerful figure within the Third Reich, is one of Karl's targets for assassination as he plans to meet up with an NKVD contact at the Brandenburg Gate to defect to the Soviet Union; the real Bormann mysteriously disappeared without trace during the fall of Berlin. The rest of the characters (such as Dr. Max Lohmann, a key German scientist who Fairburne is assigned to help capture and escort out of Berlin to America in order to prevent him from falling into the hands of the NKVD) are fictional with exception of General Patton who has sent Fairburne on his mission.\n---------------------------------------------\n---------------------------------------------\n---------------------------------------------\n\nGameplay:\nSniper Elite is a third-person shooter that involves much stealth and patience. To reinforce the stealth aspect, there is a camouflage index measured in percentage that displays the visibility of the protagonist. Fairburne uses several WWII-era weapons, including sniper rifles (Gewehr 43, SVT-40, Mosin-Nagant M91/30), a silenced pistol (Walther P38), submachine guns (MP 40, PPSh-41), machine guns (MG 42, DP), an anti-tank weapon (Panzershreck), and German and Soviet hand grenades (which can be also used to make tripwire boobytraps).[1] Only one weapon of each class may be carried at a time.\n\nOne of the main features of the game is the option of realistic ballistics, involving factors such as bullet drop, wind strength, and breathing when attempting a shot. Sniping gameplay is in first person scope view, whereas movement and use of all other weapons is in third person view. When the player makes an extreme sniper shot, the view follows the path of the bullet in slow motion, while the camera rotates around the bullet.\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 2 Share The Pain\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nSniper Elite\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:4a6f8cdca86712121008a30f062474bdac3f9421","amp;dn":"Sniper+Elite+%28Online+Playable%29+%28Army+Game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a6f8cdca86712121008a30f062474bdac3f9421","infoHashBuffer":{"type":"Buffer","data":[74,111,140,220,168,103,18,18,16,8,163,15,6,36,116,189,172,63,148,33]},"announce":[],"urlList":[]}}