{"title":"Greg Goodman - Construction of Ruins (Avant Garde Project 169)","uid":6236647,"size":580132388,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a755346ccc57f3e38f0f1de0ee93434dbad1a23&amp;dn=Greg+Goodman+-+Construction+of+Ruins+%28Avant+Garde+Project+169%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"human2011","files":8,"time":1299897183,"description":"The Avant Garde Project is a series of 20th-century classical, experimental, and electroacoustic torrents digitized from LPs whose music has in most cases never been released on CD, and so is effectively inaccessible to the vast majority of music listeners today. This is wild stuff, so check it out if you've never heard this sort of music before. The analog rig used to extract the sound from the grooves is near state-of-the-art, producing almost none of the tracking distortion or surface noise normally associated with LPs.\n\nAGP1-157 are available for direct download in the archive at the AGP mirror site:\n\nAGP163-168 will hopefully be available soon at a location to be named later.\n\n=======================================\n\nThe Avant Garde Project celebrates its fifth anniversary with its first new installment in over a year. AGP169 is a 24-bit, 44.1 kHz transcription of a remarkable, long out-of-print LP from 1982 on The Beak Doctor label, featuring the prepared piano of Greg Goodman with guest artistry by Jon Rose on violin and Henry Kaiser on electric guitar. It's a beautifully recorded LP in excellent condition with essentially no surface or pressing noise. The music occupies the shared outlands of extreme jazz and modern classical. With the exception of the last track, piano and violin are played more percussively than melodically, and the sounds of the prepared piano together with Henry Kaiser's idiosyncratic guitar is a real timbre-fest. \n\nNotes on the release can be found at The Beak Doctor website. While you're there, be sure to check out their other recordings, many of which are in print and available for purchase internationally:\n &lt;a href=&quot;\nhttp://www.thebeakdoctor.com/bd4history.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thebeakdoctor.com/bd4history.htm&lt;/a&gt;\n\nEquipment used for A/D conversion: Linn Akiva phono cartridge, Linn LP12/Lingo turntable, Linn Ekos SE tonearm, Audioquest LeoPard tonearm cable, PS Audio PS2 preamplifier, Kimber PBJ interconnect, M-Audio Audiophile USB A/D converter.\n\n01 - The Nullabor is Not Flat [23:33]\n02 - U-DAG [8:20]\n03 - Dingos in Quest [10:10]\n04 - Notes [9:59]\n\nNOTE: To the best of my knowledge, these recordings are not currently available commercially. If you know otherwise, please let me know ASAP, as I do not wish any artists to be deprived of the royalties that they so richly deserve.\t","torrent":{"xt":"urn:btih:4a755346ccc57f3e38f0f1de0ee93434dbad1a23","amp;dn":"Greg+Goodman+-+Construction+of+Ruins+%28Avant+Garde+Project+169%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a755346ccc57f3e38f0f1de0ee93434dbad1a23","infoHashBuffer":{"type":"Buffer","data":[74,117,83,70,204,197,127,62,56,240,241,222,14,233,52,52,219,173,26,35]},"announce":[],"urlList":[]}}