{"title":"JJ CALE - AFTER MIDNIGHT (k Minus 1's Slight remix).flac","uid":6145667,"size":14033356,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b2eab092ef9d9c38275a346445df9d8b9cd32a9&amp;dn=JJ+CALE+-+AFTER+MIDNIGHT+%28k+Minus+1%5C%27s+Slight+remix%29.flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kMinus1","files":1,"time":1296664219,"description":"J.J. Cale \nHe was born in 1938...... \n\nAn American original of the highest order, J.J.Cale is an architect of the &quot;Tulsa sound,&quot; a laid-back blend of rock 'n' roll, country, folk, blues and jazz. His trademark guitar style and songwriting have had an impact far beyond his own recordings. \n\nWidely admired and emulated by his peers, a staggering number of artists have covered Cale's songs including Johnny Cash, Santana, Captain Beefheart, Bryan Ferry, Deep Purple, and Chet Atkins. Cale's influence was the blueprint for Dire Straits' sound and it impacted an entire era for Eric Clapton, who not only absorbed Cale's style but made classic hits of his songs &quot;After Midnight&quot; and &quot;Cocaine&quot;. \n\n\nFor a man who wrote such rock standards as &quot;After Midnight,&quot; &quot;Cocaine,&quot; &quot;Call Me the Breeze&quot; and &quot;Magnolia,&quot; J.J. Cale maintains a surprisingly low profile. \n\nThe Oklahoma singer-songwriter pioneered the fluid, laid-back country-blues shuffles that provided the aural blueprint for Mark Knopfler and Eric Clapton, but not one of Cale's 12 albums have penetrated the Top-40 charts. \n\nOne reason is his husky mumble which makes Knopfler and Clapton sound like Roy Orbison by comparison; another is his tendency to weave his elegant guitar lines into the arrangement rather than making them out boldly where the masses can't miss them. And it can't be denied that Cale never again matched his debut album's brilliant crop of songs. \n\n&quot;Guitar Man,&quot; Cale's 12th album, is his strongest in a long time for several reasons. He recorded it almost all by himself out in his California desert studio, and his imagination seems to have been stimulated by his experiments with drum machines, synthesizers and sequencers. \n\nA bluesy rootsiness still dominates his sound, but around the edges is a new high-tech crispness that provides a welcome edge to his lazy drawl. This is especially effective on such understated protest songs as &quot;Death in the Wilderness&quot; and &quot;This Town.&quot; \n\n\nCale's better songs, though, boast a droll humor. &quot;Days Go By,&quot; for example, is a tongue-in-cheek, talking blues that pokes fun at both potheads and anti-drug fanatics. &quot;Doctor Told Me&quot; begins as a chauvinist tribute to old- chauvinist straight. \n\nAll the songs feature astonishing, filigree guitar work, but the best songs also contain an irresistible melodic hook. Several of the new tunes -- &quot;Low Down,&quot; &quot;Miss Ol' St. Louie,&quot; &quot;If I Had a Rocket&quot; and the title track -- boast Cale's best hooks in year\nlyrics\nAfter midnight, we're gonna let it all hang out \nAfter midnight, we're gonna chug-a-lug and shout \nWe're gonna cause talk and suspicion \nGive an exhibition \nFind out what it is all about \nAfter midnight, we're gonna let it all hang out \nAfter midnight, gonna shake your tambourine \nAfter midnight, it's gonna be peaches and cream \nWe're gonna cause talk and suspicion \nGive an exhibition \nFind out what it is all about \nAfter midnight, we're gonna let it all hang out \nAfter midnight, we're gonna let it all hang out\ncredits\nreleased 18 January 2011 \nThanks to JJ Cale for the inspiration.","torrent":{"xt":"urn:btih:4b2eab092ef9d9c38275a346445df9d8b9cd32a9","amp;dn":"JJ+CALE+-+AFTER+MIDNIGHT+%28k+Minus+1%5C%27s+Slight+remix%29.flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b2eab092ef9d9c38275a346445df9d8b9cd32a9","infoHashBuffer":{"type":"Buffer","data":[75,46,171,9,46,249,217,195,130,117,163,70,68,93,249,216,185,205,50,169]},"announce":[],"urlList":[]}}