{"title":"The Hurt Locker(2008)DVDRip.AC3(ENG)-DROCK","uid":6268282,"size":734178715,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4b4279b296a7b7c2a385373952fa0dfb172e20ba&amp;dn=The+Hurt+Locker%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300981310,"description":"Based on the personal wartime experiences of journalist Mark Boal (who adapted his experiences with a bomb squad into a fact-based, yet fictional story), director Kathryn Bigelow's Iraq War-set action thriller The Hurt Locker presents the conflict in the Middle East from the perspective of those who witnessed the fighting firsthand -- the soldiers. As an elite Army Explosive Ordnance Disposal team tactfully navigates the streets of present-day Iraq, they face the constant threat of death from incoming bombs and sharp-shooting snipers. In Baghdad, roadside bombs are a common danger. The Army is working to make the city a safer place for Americans and Iraqis, so when it comes to dismantling IEDs (improvised explosive devices) the Explosive Ordnance Disposal (EOD) crew is always on their game. But protecting the public isn't easy when there's no room for error, and every second spent dismantling a bomb is another second spent flirting with death. Now, as three fearless bomb technicians take on the most dangerous job in Baghdad, it's only a matter of time before one of them gets sent to &quot;the hurt locker.&quot; Jeremy Renner, Guy Pearce, and Ralph Fiennes star. \n\nRipped with Handbrake.\n\nLength: 2 Hours 10 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:4b4279b296a7b7c2a385373952fa0dfb172e20ba","amp;dn":"The+Hurt+Locker%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b4279b296a7b7c2a385373952fa0dfb172e20ba","infoHashBuffer":{"type":"Buffer","data":[75,66,121,178,150,167,183,194,163,133,55,57,82,250,13,251,23,46,32,186]},"announce":[],"urlList":[]}}