{"title":"iAntares_10.6.3_v2.2.iso","uid":6290831,"size":2942511104,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4cf838b55c499d0700f5de797771b61d1ecca265&amp;dn=iAntares_10.6.3_v2.2.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sadwjp","files":1,"time":1301805751,"description":"Version (v2.2), while retainingv2.0, based on the increase for AMD users can enter the installation interface to modify the probability, not very different installation options (the difference between the specific instructions below) mainlyit compatible with as many platforms as possible can use the CD-ROM installation guide, here are gratefultired of white hair and blackbrothers and AMD help me in the test in his pre-boot, thanks thanks. This version of the, the same as v2.0.\nIf you previously used can properly enter the installation interface v2.0, then download the v2.2 have basically no difference, you can not download.\nMaybe v2.2 will again let you down, you can install, not on behalf of others can be installed; \nSimilarly, you can not install, not on behalf of others can not be installed. So please think twice before downloading,no one forced you to download and use, once you download it to use, all the consequences from downloaders own, remember!\nUnless the pre-SL to be able to find a system modification method, otherwise,v2.2 package is probably the system Ireceived for the hills. At present the knowledge in this area has reached the limit, I only know how to package the resources collected, do not know how to develop, modify third-party driver patch.\n[Translated from Chinese by Google]\n","torrent":{"xt":"urn:btih:4cf838b55c499d0700f5de797771b61d1ecca265","amp;dn":"iAntares_10.6.3_v2.2.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cf838b55c499d0700f5de797771b61d1ecca265","infoHashBuffer":{"type":"Buffer","data":[76,248,56,181,92,73,157,7,0,245,222,121,119,113,182,29,30,204,162,101]},"announce":[],"urlList":[]}}