{"title":"Cypheros_TS_Doctor_1.0.89.319","uid":6265664,"size":10478569,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d910569d0f72921e5ca3ce4c359410fb2673e6d&amp;dn=Cypheros_TS_Doctor_1.0.89.319&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"andishe_egold","files":2,"time":1300898053,"description":"\nMany modern satellite and cable receivers offer the ability to record television and radio programs by a so called PVR function. Such recordings are stored usually in the transport stream format (ts) or in a kindred format.\n\nUnfortunately, such recordings often contain errors or incompatibilities that lead to incompatible recordings that can't be played back on other devices without problems.\nHere, the TS-Doctor can help more than any other tool, for both SDTV and HDTV recordings. It verifies the recordings for errors, adapts the format to eliminate compatibility issues and cleaned up the recordings without changing the actual video and audio data.\nIn the end you will get a compatible transport stream (ts), that can be played easily on the computers or hardware media players such as Popcornhour A100/A110/B200/C200, WDTV, Xtreamer and many other similar devices.\n\nThe TS-Doctor works easy, fast and without quality loss !!!\n \nIn addition, the TS-Doctor provides several tools for analyzing, processing and conversion of recordings.\n\nUp to 70% size reduction without lost in quality and time consuming reencoding for HDTV recordings by simple removing of ballast data (Nalu Filler Data, commercials and unneeded streams).\n","torrent":{"xt":"urn:btih:4d910569d0f72921e5ca3ce4c359410fb2673e6d","amp;dn":"Cypheros_TS_Doctor_1.0.89.319","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d910569d0f72921e5ca3ce4c359410fb2673e6d","infoHashBuffer":{"type":"Buffer","data":[77,145,5,105,208,247,41,33,229,202,60,228,195,89,65,15,178,103,62,109]},"announce":[],"urlList":[]}}