{"title":"Roccos Dirty Teens[PORNO][HARDCORE]","uid":6250970,"size":1466077184,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4e1e542db2813cb8ced37e260ca90d7aa4c06947&amp;dn=Roccos+Dirty+Teens%5BPORNO%5D%5BHARDCORE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1300407261,"description":"Category \tAll Sex, Anal, Legal Teen, Threesomes &amp; More, Reverse Gang Bang\nDirector \tRocco Siffredi\nStarring \tGeorge Uhl, Naomi, Roxy, Bella, Mike Angelo, Kylie, Omar Galanti, Goldie, Kathy Sweet, Candy Sweet, Viktoria, Bessy, Louise, Rosee, Sandra Rodriguez, Barbie White, David Perry, Rocco Siffredi\n\nPerformer/director Rocco Siffredi presents Rocco's Dirty Teens, featuring as a centerpiece an hour-long scene wherein superstud Rocco takes on seven nubile volleyball players, working his way through 35 feet of teen girl flesh. The girls ...    Full Descriptionmassage him with their breasts and feet and take turns giving him blow jobs and fucking him, playing with each other in between, until he can't hold out any longer and cums across their upturned faces. In other scenes, tutor Omar Galanti leaves his mature mistress for a fling with two teenage students; youthful studio secretary Rosee gets the attention and hard cocks of David Perry and Mike Angelo when they show up early for a scene; and wide-eyed innocent Goldie finds that George Uhl's bedroom decor includes Kathy Sweet hooked up to a wooden frame. The scenes are shot with close-up intensity and raw sexuality, reflecting Rocco's 20-year career of shooting and performing in adult video.","torrent":{"xt":"urn:btih:4e1e542db2813cb8ced37e260ca90d7aa4c06947","amp;dn":"Roccos+Dirty+Teens%5BPORNO%5D%5BHARDCORE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e1e542db2813cb8ced37e260ca90d7aa4c06947","infoHashBuffer":{"type":"Buffer","data":[78,30,84,45,178,129,60,184,206,211,126,38,12,169,13,122,164,192,105,71]},"announce":[],"urlList":[]}}