{"title":"A View To A Gape (2011) ","uid":6249465,"size":1457485824,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4e20ddd04a18208f52df9dd5937ccb86e27c5e44&amp;dn=A+View+To+A+Gape+%282011%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":2,"time":1300356689,"description":"A View To A Gape (2011) \n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/827747D1_Omars_View_To_A_Gape_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/827747D1_Omars_View_To_A_Gape_dvd.htm&lt;/a&gt;\n\nStudio  Evil Angel Ea-Productions \nRelease Date  Feb 09, 2011 \nCategory  All Sex, Anal, P.O.V. - Point of View \nDirector  Omar Galanti \nStarring  Jennifer, Omar Galanti, Linda, Aspen, Lana Blond \n\nPowerful Anal Gapes! Throat Fucking! Big Toys!\n\nIn POV From The Moment The Movie Start, You Get A Feeling About If You Like The Director/Cameraman.\n\nI really like Omar. He is a very personable pervert. He respects the girls and ...    Full Descriptionhe respects the viewer in all his perversions. Omar delivers great, hard sex; real intimacy; good feelings with the girls; and amazing, beautiful gapes. His positions and his lighting are the best I have ever seen for this. I am very happy to have him at Evil Angel. And he shows lots and lots of gapes Superstar 18-year-old Lana Blond gapes huge! - John 'Buttman' Stagliano\n\nIn A View To A Gape, his first official release on the Evil Angel roster, sex fiend Omar Galanti works his way into some tight teen openings and makes them gape graphically. Much of the action is captured in POV-style, putting the viewer in the fucker's position. Four delightful Russian cuties submit to personable pervert Omar's rude Italian sausage.\n\nFirst, stunning brunette Aspen, dressed in pink fishnets and bunny ears, gives Omar an oily hand job, then sucks his uncircumcised knob. Aspen uses his cock and some Omar-sized (extra large) toys to spread her butthole wide, and jacks him off onto his belly before lapping up the cum. Blonde Jennifer, in stockings and garters, stops applying her makeup so she can wrap her painted lips around Omar's dick. He decorates her pussy with lipstick and pumps her butt with phalluses both real and replica. After lots of tasty ass-to-mouth fun, Jennifer takes a messy facial. Linda, a lovely, blue-eyed blonde in transparent white pantyhose, teases the camera, expanding her anus with a couple of dildos.\n\nSoon, all three of her holes have been conquered by Omar's fat, hooded cock. After relentlessly reaming Linda's perfect ass until it gapes like a tunnel, Omar shoots a load on her pretty face. Finally, Lana Blond's amazingly elastic asshole stretches to enormous proportions, taking in everything from a huge painted egg to Omar's big prick. This sexy slut gives her talented rectum a severe workout, and gets her face splattered with jizz. Omar's 'View' turns out to be nastily scenic!\n\n\n","torrent":{"xt":"urn:btih:4e20ddd04a18208f52df9dd5937ccb86e27c5e44","amp;dn":"A+View+To+A+Gape+%282011%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e20ddd04a18208f52df9dd5937ccb86e27c5e44","infoHashBuffer":{"type":"Buffer","data":[78,32,221,208,74,24,32,143,82,223,157,213,147,124,203,134,226,124,94,68]},"announce":[],"urlList":[]}}