{"title":"MASTER VOYAGER LATEST 2.74","uid":6153141,"size":8520787,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e7da96cd3dc8c4957d5593e14088582052f888c&amp;dn=MASTER+VOYAGER+LATEST+2.74&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":-1,"time":1296941260,"description":"Master Voyager is the convenient program for creating password protected DVD/CD and USB Flash Drives\nMaster Voyager program can create and password protected CD/DVD and protected USB flash drives. It has two file panes and provides convenient way to drag and drop files between unsecure folder on internal hard drive and secure partition on DVD/CD/USB Stick.\n\nMaster Voyager includes internal tool to burn/erase compact discs. Just create secure partition, drag and drop files to the partition and click Burn DVD or Burn CD button. \n\nSee ScreenShots: How to create protected DVD with encryption\n\nSafely transfer large data ammounts via usual postal mail. No need to have Master Voyager on other side.\nOnce copied to the protected CD/USB Drive, the documents/files/video files can be safely sent via usual postal mail.  Your Compact Disc with impotant information can be lost by postal mail or even intercepted by third side. But nobody can read these documents without password and there is absolutely no way to break this password.\n\nWhen you burn sensitive files to compact disc, Master Voyager adds some small executable modules to the compact disc automatically.\n\nThe recipient will not need to have Master Voyager to open your DVD/CD or USB Flash Drive. He/She just uses autoplay feature of this media and enters password. No any file is copied to the target computer.\n\nBonus! Every protected CD/USB stick includes the Partition Explorer module to work with protected disc/usb drive even without administrator's rights on computer\n\nWindows Security Model prevents the ability to add any drive letters to the list of available drives under limited user account.\n\nBut since version 2.20, Master Voyager adds additional utility to evey protected media: The Partition Explorer.\n\nThis utility allows to open password encrypted partitions on the media in read-only mode and copy files from the partition to any folder on hard drive.\n\nThis utility works even in the situation when administrator's rights are not available on target computer\n","torrent":{"xt":"urn:btih:4e7da96cd3dc8c4957d5593e14088582052f888c","amp;dn":"MASTER+VOYAGER+LATEST+2.74","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7da96cd3dc8c4957d5593e14088582052f888c","infoHashBuffer":{"type":"Buffer","data":[78,125,169,108,211,220,140,73,87,213,89,62,20,8,133,130,5,47,136,140]},"announce":[],"urlList":[]}}