{"title":"Democracy Now - 21 mar 2011","uid":6260117,"size":443135355,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4e98917a9d6c974c325b2478c603bac795469be2&amp;dn=Democracy+Now+-+21+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1300721648,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 21, 2011\n\n- Japanese Death Toll to Top 18,000; Food &amp; Water Supplies Contaminated\n- U.S. &amp; Allies Begin Bombing of Libya to Enforce No-Fly Zone\n- Yemeni Generals and Officials Defect After Killing of 35 Protesters\n- Leaked Photos Show U.S. Soldiers Posing With Dead Afghan Civilians\n- Over 130 Arrested At Iraq War and Bradley Manning Protests\n- Wisconsin Judge Blocks Union-Busting Bill\n- Israeli Military Intelligence Targets Foreign Activist Groups\n- U.N. Warns About Crimes Against Humanity in Ivory Coast\n- Obama Kicks Off Latin American Tour\n- Newspaper Guild Calls For Boycott of Huffington Post\n\n\nSpecial reports\n\n- Libyan Citizen Journalist Mohammed Nabbous Killed By Gunfire While Reporting on the Battle for Benghazi\n\nA coalition of forces from the United States, U.K. and France launched air strikes against Libya over the weekend after the U.N. Security Council on Friday approved a no-fly zone. On Saturday morning, Muhammad Nabbous, a Libyan citizen journalist in Benghazi, was shot and killed. Nabbous established Libya Al Hurra TV to broadcast online live feeds and commentary from the popular uprising that began last month. Described as the face of citizen journalism in Libya, Nabbous was killed while reporting on attacks by pro-Gaddafi forces. We play a clip of his final report and an excerpt of an emotional message from his wife urging people to continue to fight for democracy in Libya. Democracy Now! correspondent Anjali Kamat interviewed Nabbous last month at the media center he helped to build.\n\n\n- No-fly Zone Enacted as U.S. and Allied Forces Launch Air Strikes on Libya Amid Growing Concerns for Civilian Safety\n\nU.S. and allied forces have launched a second wave of air strikes on Libya to enforce a no-fly zone. Targets have included Libya's air defenses, forces loyal to Col. Muammar Gaddafi and Gaddafi's fortified compound. The attacks on Libya began on Saturday, the eighth anniversary of the U.S.-led invasion of Iraq. The Arab League had supported the establishment of a no-fly zone over Libya, but Arab League Chief Amr Moussa criticized the U.S.-led air strikes. For analysis, we speak to Phyllis Bennis with New Internationalism Project at the Institute for Policy Studies. &quot;The [U.S.] government is going to great lengths to convince the public and world that we are not leading, but right now, at this beginning stage, there is no question the U.S. is in command,&quot; Bennis says.\n\n\n- Former President Aristide On His Party's Exclusion from Haiti's Election: &quot;Exclusion is the Problem, Inclusion is the Solution&quot;\n\nIn this broadcast exclusive, Democracy Now! follows former President Jean-Bertrand Aristide flight's out from South Africa and his historic return to Haiti after seven years of exile. Aristide returned two days before a delayed presidential run-off election was held on Sunday between pop star Michel Martelly and former First Lady Mirlande Manigat. Special thanks to Hany Massoud and Sharif Abdel Kouddous, Nicole Salazar, K.K. Kean and Kim Ives.\n\n\n- Democracy Now! Exclusive Interview with Jean-Bertrand Aristide: If Haiti's Military is Restored, &quot;We Are Headed Back to Misery&quot;\n\nFormer Haitian President Jean-Bertrand Aristide and his family were flown on Friday by the South African government back to their home in Haiti after seven years in exile. Just before their journey, President Obama called South African President Jacob Zuma to try to prevent the trip. But the South African Government said it would not bow to pressure, so the Aristides boarded the flight in Johannesburg on Thursday night. Democracy Now!'s Amy Goodman was the only reporter to join them on the journey. This is part one of our global broadcast exclusive conversation with Aristide as he flew over the Atlantic Ocean, approaching Haiti. &quot;If we decide to go back when we had an army of 7,000 soldiers controlling 40 percent of the national product that would mean we are headed back to misery, instead of doing something to move from that misery to poverty with dignity,&quot; Aristide says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:4e98917a9d6c974c325b2478c603bac795469be2","amp;dn":"Democracy+Now+-+21+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e98917a9d6c974c325b2478c603bac795469be2","infoHashBuffer":{"type":"Buffer","data":[78,152,145,122,157,108,151,76,50,91,36,120,198,3,186,199,149,70,155,226]},"announce":[],"urlList":[]}}