{"title":"Ivo Malec II - Sigma, Lumina, etc... (Avant Garde Project 170)","uid":6253552,"size":530645580,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f8a27b3089fd2504c7c21340e976bcc655886c2&amp;dn=Ivo+Malec+II+-+Sigma%2C+Lumina%2C+etc...+%28Avant+Garde+Project+170%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"human2011","files":7,"time":1300508306,"description":"The Avant Garde Project is a series of 20th-century classical, experimental, and electroacoustic torrents digitized from LPs whose music has in most cases never been released on CD, and so is effectively inaccessible to the vast majority of music listeners today. This is wild stuff, so check it out if you've never heard this sort of music before. The analog rig used to extract the sound from the grooves is near state-of-the-art, producing almost none of the tracking distortion or surface noise normally associated with LPs.\n\nAGP1-157 are available for direct download in the archive at the AGP mirror site:\n\nAGP163-168 will hopefully be available soon at a location to be named later.\n\nAGP169 is also available at http://thepiratebay.se/user/human2011\n\n=======================================\n\nAGP170 is the first of two devoted to the music of the Croatian composer Ivo Malec, who was one of the founding members of the Groupe de Recherches Musicales (GRM) in Paris. This and AGP171 comprise a transcription of a long out-of-print 2LP set on INA-GRM records (9105 MA): \n &lt;a href=&quot;\nhttp://www.discogs.com/Ivo-Malec-Sigma/release/320882&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Ivo-Malec-Sigma/release/320882&lt;/a&gt;\n\nThe works on these LPs were composed between 1963 and 1981, and range from orchestra to vocal to computer. They make up a nice cross-section of this remarkable composer's work. The installment includes a PDF with scans of the LP inner covers and the accompanying eight-page booklet with extensive notes and commentary in French. Other works by Ivo Malec were included in AGP148. If you like these tracks, many more works by GRM composers can be found at electrocd.com or at ina.fr. More information on the composer can be found here:\n &lt;a href=&quot;\nhttp://www.musicweb-international.com/classrev/2005/Apr05/malec_orchestralworks_timpani1C10786.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.musicweb-international.com/classrev/2005/Apr05/malec_orchestralworks_timpani1C10786.htm&lt;/a&gt;\n\nEquipment used for A/D conversion: Linn Akiva phono cartridge, Linn LP12/Lingo turntable, Linn Ekos SE tonearm, Audioquest LeoPard tonearm cable, PS Audio PS2 preamplifier, Kimber PBJ interconnect, M-Audio Audiophile USB A/D converter.\n\n01 - Sigma [10:46]\n02 - Dodecameron [18:42]\n03 - Lumina [14:11]\n04 - Carillon Choral [10:50]\n\nNOTE: To the best of my knowledge, these recordings are not currently available commercially. If you know otherwise, please let me know ASAP, as I do not wish any artists to be deprived of the royalties that they so richly deserve.\t","torrent":{"xt":"urn:btih:4f8a27b3089fd2504c7c21340e976bcc655886c2","amp;dn":"Ivo+Malec+II+-+Sigma%2C+Lumina%2C+etc...+%28Avant+Garde+Project+170%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f8a27b3089fd2504c7c21340e976bcc655886c2","infoHashBuffer":{"type":"Buffer","data":[79,138,39,179,8,159,210,80,76,124,33,52,14,151,107,204,101,88,134,194]},"announce":[],"urlList":[]}}