{"title":"Listening Post~ Buzz About Japan 2011 03 19 Aljazeera","uid":6256450,"size":339795848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4fa160e6bd6fbcb3b3e60b3eec9ecd2d2ec61571&amp;dn=Listening+Post%7E+Buzz+About+Japan+2011+03+19+Aljazeera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1300590966,"description":"Listening Post~ Buzz About Japan 2011 03 19 Aljazeera\n\n324mb/24.59mins/avi\n\n\nFLV:http://english.aljazeera.net/programmes/listeningpost/2011/03/2011318124919880942.html\n\nOn Listening Post this week: Global media struggle to decipher fact from fear mongering in the Japan nuclear reactor leak story, while in Pakistan, debating the anti-blasphemy law is being deemed blasphemous itself.\ne Buzz About Japan\n\nFirst came the earthquake, then the &quot;ten meter high&quot; tidal wave, then the threat of a nuclear meltdown. The string of disasters in Japan has grabbed headlines across the globe but when you are dealing with a story of this magnitude, it is always difficult to accurately convey the reality in a single headline, by-line or bulletin.\n\nThe dominant narrative in this case has been the threat of Japan''s damaged nuclear reactors leaking radiation. No matter how hard the experts try to pull the Chernobyl/Three Mile Island/nuclear buzzwords out of the headlines, they keep finding their way back in.\n\nOur News Divide this week is the fault line that runs through the Land of the Rising Sun - and the chasm that lies between fact and what some call fiction in the reporting of the earthquake story.\n\nNewsbytes\n\nMedia snippets from around the world: In Libya an Al Jazeera cameraman becomes the first international journalist to die in the unrest while BBC and CNN news crews get harassed and a group of local reporters is still unaccounted for.\n\nThe Bahraini government cracks down on protests and the media. Cote d''Ivoire''s media continues to suffer under the political divide in the country. The US state department spokesman loses his job after commenting on the treatment of Private Bradley Manning. And the screening of a controversial new movie at the UN general assembly in New York angers Israeli officials.\n\nBlasphemy in Pakistan\n\nPakistan is being torn apart by people who want to take it in different directions. This struggle is reflected in the country''s media and nowhere is it more apparent than in the debate over Pakistan''s anti-blasphemy laws.\n\nThey are so strict that while the media can report on blasphemy cases, it can not disclose the details of the alleged offences. The laws - and the void in reporting they have created - are polarizing the country even further.\n\nWatch Aljazeera Live at: http://english.aljazeera.net/watch_now/\n\nOther shunster posts","torrent":{"xt":"urn:btih:4fa160e6bd6fbcb3b3e60b3eec9ecd2d2ec61571","amp;dn":"Listening+Post%7E+Buzz+About+Japan+2011+03+19+Aljazeera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fa160e6bd6fbcb3b3e60b3eec9ecd2d2ec61571","infoHashBuffer":{"type":"Buffer","data":[79,161,96,230,189,111,188,179,179,230,11,62,236,158,205,45,46,198,21,113]},"announce":[],"urlList":[]}}