{"title":"LA_JOVEN_DE_LAS_ESPECIAS.avi","uid":6201780,"size":734689344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4fad0da6011553187c2b92aebdd3c8e417466cac&amp;dn=LA_JOVEN_DE_LAS_ESPECIAS.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1298643897,"description":"Calidad del video: DVD RIP\nPeso: 701 mb\nIdioma del audio: EspaÃƒÂ±ol EspaÃƒÂ±a\n\nTilo es una bella joven formada en el antiguo y mÃƒÂ¡gico arte de las especias. Ordenada con poderes especiales para ayudar a los que acuden a ella, Tilo tiene una habilidad sorprendente para sentir los problemas de los demÃƒÂ¡s y visualizar su futuro y su pasado. Tilo trabaja en San Francisco, en una pequeÃƒÂ±a tienda llamada El Bazar de las Especias donde, guiada por los consejos de sus especias, encuentra el remedio perfecto para todo el que cruza su puerta. Para que sus poderes funcionen, debe obedecer siempre tres simples, aunque estrictas, reglas: sÃƒÂ³lo debe utilizar las especias para ayudar a los demÃƒÂ¡s, no debe tocar nunca la piel de otra persona y nunca debe abandonar la tienda. Cuando Doug, un guapo y enigmÃƒÂ¡tico arquitecto, estrella su Harley Davison fuera de su tienda de San Francisco, Tilo tiene que curarle las heridas y su vida cambia para siempre. Por primera vez en su vida, los deseos de Tilo se despiertan y comienza a cuestionar su existencia: Ã‚Â¿la vida constarÃƒÂ¡ de algo que no sea ayudar a los demÃƒÂ¡s? Tilo conoce las reglas y sus especias le advierten que se aleje, pero no hay especias que le digan a Doug lo que debe hacer y pronto regresa a la tienda armado con un ramo de flores para pedirle una cita a la joven.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:4fad0da6011553187c2b92aebdd3c8e417466cac","amp;dn":"LA_JOVEN_DE_LAS_ESPECIAS.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fad0da6011553187c2b92aebdd3c8e417466cac","infoHashBuffer":{"type":"Buffer","data":[79,173,13,166,1,21,83,24,124,43,146,174,189,211,200,228,23,70,108,172]},"announce":[],"urlList":[]}}