{"title":"Metal Church - The Human Factor (1991) WMA320","uid":6253434,"size":125718045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:506419fb26b8baf9d082dc0f1ae46dd4c011cd5c&amp;dn=Metal+Church+-+The+Human+Factor+%281991%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1300504769,"description":"Coming off the excellent but commercially unsuccessful &quot;Blessing In Disguise&quot;, Metal Church released Human Factor right about the time grunge started making metal it's punching bag. The success of the album suffered though not because of lack of good material.\nMetal Church came out with a chip on their shoulder on this album. They tackle a wide range of controversial subjects from child abuse, flag burning, and bands being sued for subliminal lyrics to greed, debt, and bands ripping off other bands. As one prominent magazine of the time pointed out Metal Church unfortunately had a song that sounded almost identical to the opening riff of a Prong song. No matter.\n\nThe album opens with the very average title track attacking the obvious ... late 80's hair bands and rap sampling. &quot;Date With Poverty&quot; is built upon a classic Metal Church verse riff and features a frustrated chorus acknowledging the average debt-ridden american. &quot;In Harm's Way&quot; is a great power metal ballad similar to &quot;Anthem To The Estranged&quot; taking aim at child abusers with a mix of tasteful acoustic passages with a distorted bridge and chorus.\n\nPerhaps the most memorable track is &quot;Agent Green&quot; which has a tremendous middle section and fine drum and guitar work from the band. Despite these strong tracks there are some weaker efforts. &quot;Betrayed&quot; and the &quot;Fight Song&quot; never really seem to get off the ground and seem a bit rushed as opposed to the careful compostion of some of the other tracks. &quot;Flee From Reality&quot; is pretty basic also but none of these songs are actually bad. Mike Howe's vocals sound great and the production is good but when stacked up agaist Blessing In Disguise it falls short.\n\nDepending on who you talk to most Metal Church fans cite this album as their best or their worst. However you look at it, it is hard to go wrong with a Metal Church album and this one is well worth the purchase even if it is slightly inferior to some of their other albums.\n\nby Melkor &quot;Librarian, Reviewer&quot;\n\nTRACKLIST:\n\n01 - The Human Factor.wma                              \n02 - Date With Poverty.wma                             \n03 - The Final Word.wma                                \n04 - In Mourning.wma                                   \n05 - In Harm's Way.wma                                 \n06 - In Due Time.wma                                   \n07 - Agent Green.wma                                   \n08 - Flee From Reality.wma                             \n09 - Betrayed.wma                                      \n10 - The Fight Song.wma\n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:506419fb26b8baf9d082dc0f1ae46dd4c011cd5c","amp;dn":"Metal+Church+-+The+Human+Factor+%281991%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506419fb26b8baf9d082dc0f1ae46dd4c011cd5c","infoHashBuffer":{"type":"Buffer","data":[80,100,25,251,38,184,186,249,208,130,220,15,26,228,109,212,192,17,205,92]},"announce":[],"urlList":[]}}