{"title":"I HATE PHP EBOOK MRR FREE PDF.","uid":6226409,"size":344836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51bc2e90b5a323dbbf8e95bd3b639348050709b4&amp;dn=I+HATE+PHP+EBOOK+MRR+FREE+PDF.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boricua909","files":1,"time":1299529698,"description":"I Hate PHP\n\nPUT THE POCKET PROTECTORS AWAY... \n...and learn PHP without becoming a part of the geek patrol. \n\nDear Fellow Webmaster; \n\nI've wasted probably a thousand bucks on PHP books. Sold 'em on eBay after getting frustrated. So I wrote one. \n\nYeah, I'm a web designer by trade. I &quot;do&quot; HTML and ColdFusion. But, it took me a long time to &quot;get&quot; PHP. I wasn't exactly sure why at first, but as I looked more and more into PHP development, I finally figured it out. IT LOOKS LIKE A PROGRAMMING LANGUAGE. Gross. Not a good thing for web designers who want functionality that PHP offers but hate the fact that they have to add &quot;Programmer&quot; to their resume. So, What's cool about PHP?? \n\nIt's free - You don't need to buy some special development tool to code in it. \nIt's widely supported - Web hosts EVERYWHERE have PHP installed, and often in their cheapest plans too. Try that with ColdFusion or ASP. \nIt's functional - Most everything you might want to do with a website can be done with PHP - it has very few limitations. \n\nMy pain is your gain. I never found &quot;the&quot; product that would help me learn PHP the way I needed to...so I wrote this for myself over several months' time, and you are cashing in on my suffering. Anyone got some aspirin?? \n\nOK, Why &quot;I HATE PHP&quot; over someone else's book? \n\nPeople that have a lot of knowledge in a specific area have a difficult time looking at it from a newcomer's perspective, and writing as such. I'm not a PHP &quot;guru&quot; by any means - and I understand how hard it can be to grasp a concept. It's split up into 3 sections, specifically written to start simple and build skills...with real world usage examples included! \nI start with the basics of PHP - echoing to the screen, setting variables, using includes, etc. and move up from there to more advanced topics such as arrays, loops, and functions. Then it's on to MySQL - connecting, reading, inserting - enough to get you started. \n\nWho should read this e-book? \n\nIf you are familiar with HTML and can edit text documents in Notepad...you can understand this. I wrote this with novice-to-intermediate webmasters, designers, and internet marketers in mind. Don't expect a lot of high-level programming in here. You're not going to learn to build a complete shopping cart application from reading this - but it will help you understand functionality behind the cart.\n","torrent":{"xt":"urn:btih:51bc2e90b5a323dbbf8e95bd3b639348050709b4","amp;dn":"I+HATE+PHP+EBOOK+MRR+FREE+PDF.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51bc2e90b5a323dbbf8e95bd3b639348050709b4","infoHashBuffer":{"type":"Buffer","data":[81,188,46,144,181,163,35,219,191,142,149,189,59,99,147,72,5,7,9,180]},"announce":[],"urlList":[]}}