{"title":"Democracy Now - 14 feb 2011","uid":6174093,"size":447918018,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:53296053d03cdc8524cf9692afda7a2dd15513df&amp;dn=Democracy+Now+-+14+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1297701271,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 14, 2011\n\n- Egypt Celebrates Mubarak's Resignation, Military Imposes Martial Law\n- Egyptian Military Takes Temporary Control, Bans Labor Union Meetings\n- Bahrain: Protesters Clash With Police\n- Hundreds Arrested in Algerian Protests\n- Iran Place Opposition Leader Mousavi Under House Arrest\n- Obama Slashes Assistance for Working Poor and Needy in New Budget\n- Wisconsin Governor Threatens to Use National Guard Against State Workers\n- Arrest Warrant Issued for Musharraf in Connection with Bhutto Assassination\n- Puerto Rican University President Resigns in Wake of Student Protests\n- Opponents on Mountaintop Removal Occupy Kentucky Governor's Office\n\n\nSpecial reports\n\n- &quot;This Is A Dream Come True&quot;: Egyptians Celebrate in Cairo After Mubarak Resigns\n\nDemocracy Now! correspondent Anjali Kamat was in the streets of Cairo as Egyptians erupted with joy after learning President Hosni Mubarak had stepped own following 18 days of street protests that began Jan. 25. In this video report, Kamat takes us to Cairo's Tahrir Square where people are not only cleaning up the streets and but are also maintaining their rights to public political expression and involvement in Egypt's uncertain future.\n\n\n- After the Revolution: Mubarak is Gone After 30 Years in Power, But Questions Remain as to How Transition Will Proceed\n\nWhile the Egyptian military has agreed some of the protesters demands, the military has refused to lift the emergency law or to release the thousands of political prisoners jailed by the Mubarak regime. Democracy Now! Senior Producer Sharif Abdel Kouddous and Issandr El Amrani, blogger at Arabist.net, join us from Cairo. Barnard College Political Science Professor Mona El-Ghobashy joins us in our studio.\n\n\n- &quot;There is a Pre-History to this Revolt&quot;: As Egypt's Military Bans Labor Strikes, Mona El-Ghobashy Examines How Egyptian Labor and Social Movements Laid the Roots For the Revolution\n\nJust days after the Egyptian labor movement joined the popular uprising that ousted Egyptian President Hosni Mubarak, the ruling military council has called on labor leaders to halt strikes and protests. &quot;Egyptian politics didn't begin Jan. 25,&quot; says Barnard College Professor Mona El-Ghobashy, who has written extensively on politics and social movements in the Middle East and North Africa, &quot;There is a pre-history to this revolt. For us to understand the significance of what is happening today, we have to link it to the fabric of the Egyptian politics starting in 2000.&quot;\n\n\n- Yemeni Forces Use Tasers, Batons, Knives and Rifles to Squash Anti-Government Protests\n\nThe popular uprisings in Tunisia and Egypt have raised questions about the stability of several other governments in the region. Over the weekend, thousands of peaceful demonstrators in Yemen clashed with police and pro-government supporters. Tasers, batons, knives, sticks, and assault rifles were directed at the peaceful crowds. We speak to Iona Craig, an editor at the Yemen Times, and Sarah Leah Whitson, the director of the Middle East and North Africa Division at Human Rights Watch.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:53296053d03cdc8524cf9692afda7a2dd15513df","amp;dn":"Democracy+Now+-+14+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53296053d03cdc8524cf9692afda7a2dd15513df","infoHashBuffer":{"type":"Buffer","data":[83,41,96,83,208,60,220,133,36,207,150,146,175,218,122,45,209,85,19,223]},"announce":[],"urlList":[]}}