{"title":"Xara Designer Pro 6 (2011) [Multilenguaje]","uid":6162833,"size":503938891,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:534b86ce26661148eaf2c7ff5e018c8cddb8c3d3&amp;dn=Xara+Designer+Pro+6+%282011%29+%5BMultilenguaje%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":13,"time":1297274064,"description":"Xara Designer Pro 6 (2011) [Multilenguaje]\n &lt;a href=&quot;\nhttp://www.xara.com/eu/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xara.com/eu/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.xara.com/us/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xara.com/us/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.xara.com/eu/products/designer/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xara.com/eu/products/designer/&lt;/a&gt;\n\n===========\n::English::\n===========\nPRO Xara Design (6.1.2.13287) Multilanguage\n\nXara Designer Pro (formerly Xtreme Pro) is the top of the range of products and includes all the features and web design templates and graphic design and photography. Besides adding additional features that designers need Pro includes support for PDF / X, PANTONE color separations, support for multi-core processors for more speed, more import / export filters, a professional version of the tool picture Xtreme more.Xara photos and is faster, simply, the world of graphics software, with truly flexible illustration tools and revolutionary photo handling. Photo composition is perfect.\n\nXara Xtreme is used by many different types of customers in a spectacular range of uses - for designs combining drawings, text and photos, for print and the Web - so we understand how important it is for compatibility with other products and users.\n\nXtreme offers support for a wide range of file formats, which facilitates the exchange of their work with other users and programs. This includes common types of bitmap (eg, GIF, JPEG, BMP, PNG, TIFF, PSD, and RAW photos) and key vector types (eg PDF and AI / EPS, WMF and EMF /). For text Xara Xtreme supports RTF (Rich Text Format).\n\nXara Xtreme has full support for import and export files from Adobe Photoshop PSD, including layer support.\n\nXara Xtreme offers industry-leading export of super-clean, very compact PDF files (including support for graduated color fills and flat / graduated transparency).\n\nXara Xtreme Pro offers the ability to produce CMYK color separations. This includes on-screen preview of CMYK and spot color plates, PANTONE color support, spot colors, preview screen printer and a much wider.\n\nXara Xtreme Pro is compatible with XPS import and export. This is a totally new page description file format invented by Microsoft that's vector based, making it ideal as a portable document format independent of the resolution.\n\nXara Xtreme offers the easiest way to create really efficient Flash animations.\n\nXara Xtreme has the world's most sophisticated, highest performance vector rendering engine. It simply makes it the fastest graphics software found \n\n===========\n::Spanish::\n===========\nXara PRO de diseÃƒÂ±o (6.1.2.13287) Multilenguaje\n\nDiseÃƒÂ±ador Xara Pro (anteriormente Xtreme Pro) es el superior de la gama de productos e incluye todas las caracterÃƒÂ­sticas y plantillas de diseÃƒÂ±o web y diseÃƒÂ±o grÃƒÂ¡fico y fotografÃƒÂ­a. AdemÃƒÂ¡s de que aÃƒÂ±ade caracterÃƒÂ­sticas adicionales que los diseÃƒÂ±adores necesitan Pro incluye soporte para PDF / X, PANTONE y separaciones de color, soporte para procesadores multi-core para obtener mayor velocidad, mayor de importaciÃƒÂ³n / exportaciÃƒÂ³n de filtros, una versiÃƒÂ³n profesional de la herramienta panorama de fotos y more.Xara Xtreme es mÃƒÂ¡s rÃƒÂ¡pido, simplemente, el mundo de software de grÃƒÂ¡ficos, con herramientas de ilustraciÃƒÂ³n verdaderamente flexible y manipulaciÃƒÂ³n de fotos revolucionario. Se fotos composiciÃƒÂ³n perfecta.\n\nXara Xtreme es utilizado por muchos diferentes tipos de clientes en una espectacular gama de usos - para los diseÃƒÂ±os de la combinaciÃƒÂ³n de dibujos, textos y fotos, para la impresiÃƒÂ³n y la Web - por lo que entendemos lo importante que es para ofrecer compatibilidad con otros productos y los usuarios.\n\nXtreme ofrece soporte para una amplia gama de formatos de archivo, lo que facilita el intercambio de su trabajo con otros usuarios y programas. Esto incluye los tipos comunes de mapa de bits (por ejemplo, GIF, JPEG, BMP, PNG, TIFF, PSD y RAW fotos) y los tipos principales de vectores (por ejemplo, PDF y AI / EPS, WMF y EMF /). Para el texto Xara Xtreme admite RTF (Rich Text Format).\n\nXara Xtreme tiene soporte completo para importar y exportar archivos PSD de Photoshop de Adobe, incluido el apoyo de la capa.\n\nXara Xtreme ofrece la exportaciÃƒÂ³n lÃƒÂ­der en la industria de super-limpio, los archivos PDF muy compacto (incluyendo soporte para el color rellenos graduados y plana / transparencia graduada).\n\nXara Xtreme Pro ofrece la capacidad de producir separaciones de color CMYK. Esto incluye vista previa en pantalla de CMYK y platos de colores, soporte PANTONE color, manchas de color, previsualizaciÃƒÂ³n en pantalla de la impresora y una gama mucho mÃƒÂ¡s.\n\nXara Xtreme Pro es compatible con XPS importaciÃƒÂ³n y exportaciÃƒÂ³n. Esta es una descripciÃƒÂ³n totalmente nueva pÃƒÂ¡gina Archivo en formato inventado por Microsoft que los basados en vectores, por lo que es ideal como un formato de documento portÃƒÂ¡til independiente de la resoluciÃƒÂ³n.\n\nXara Xtreme ofrece la forma mÃƒÂ¡s sencilla de crear animaciones en Flash realmente eficiente.\n\nXara Xtreme tiene el mundo mÃƒÂ¡s sofisticado, el mÃƒÂ¡s alto rendimiento motor de procesamiento de vectores. Sencillamente esto hace que sea el software mÃƒÂ¡s rÃƒÂ¡pido de grÃƒÂ¡ficos que se encuentran\n","torrent":{"xt":"urn:btih:534b86ce26661148eaf2c7ff5e018c8cddb8c3d3","amp;dn":"Xara+Designer+Pro+6+%282011%29+%5BMultilenguaje%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"534b86ce26661148eaf2c7ff5e018c8cddb8c3d3","infoHashBuffer":{"type":"Buffer","data":[83,75,134,206,38,102,17,72,234,242,199,255,94,1,140,140,221,184,195,211]},"announce":[],"urlList":[]}}