{"title":"A Hard Days Night great quality!!! 320kbps vbr ogg","uid":6293642,"size":70902905,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53517e5f7fd3d5b6820023d8617b07bfcd72598a&amp;dn=A+Hard+Days+Night+great+quality%21%21%21+320kbps+vbr+ogg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rajeevrn","files":14,"time":1301878092,"description":"A Hard Days Night\n\n&quot; Recording techniques and sound quality have improved significantly since The Beatles first recorded &quot;A Hard Day's Night&quot; almost 50 years ago in 1964. EMI Records has remastered 13 of The Beatles records and beautifully restored the detail and clarity of these timeless songs. I couldn't resist buying at least one CD to find out how much better the remastered versions sound. After hearing &quot;A Hard Day's Night&quot;, I'll likely buy the rest of the collection.\nA Brief History\n\nMost of the songs on &quot;A Hard Days Night&quot; were recorded in 1964 to accompany the release of the movie and following the group's historic appearance on The Ed Sullivan Show. According to the interesting liner notes that accompany the CD, &quot;A Hard Day's Night&quot; is the only Beatles album where every song was written by Lennon and McCartney, and several of the songs feature George Harrison's newly acquired Richenbacker 12-string guitar. It was also near the time when the Beatles started using four-track recording techniques instead of two-track. The remastered discs were made from the original stereo analog recordings and each one includes a short mini-documentary video playable on PC and Mac computers.\nWhat is Remastering?\n\nRemastering involves taking all of the separate elements of a recording and improving their quality to produce a new master recording for duplication. EMI Records used the original two-track and four-track analog tapes of the Beatles recordings to remaster them into new recordings with outstanding sonic results. They're not perfect, and they even reveal a few flaws, but if you have any Beatles LPs or CDs, you'll appreciate the improvements in sound quality in the remastered discs.\nWhat I Heard\n\nMost of the songs on &quot;A Hard Day's Night&quot; are among my favorite Beatles' recordings and I know what they sound like. I still have several Beatles LPs, but none of my records or discs sound this good. My first impressions were the clarity and details in the vocals, the separation of instruments and how clean the recordings sounded. There was still some subtle edginess and a bit of harshness, but only in very busy recordings and mostly in drums and percussion instruments.\nThe distinct separation of the left and right channels is a characteristic of 1960s recordings - guitar on the right and drums on the left with little in-between, but the clarity and definition of the instruments and vocals in &quot;Things We Said Today&quot; is outstanding. The vocal harmonies in &quot;If I Fell&quot; was so clear it was easy to pick out each voice. The spatial characteristics and three-dimensional depth in &quot;And I Love Her&quot; sounded as if it were recently recorded.\n\nThe dynamic range of the recordings is dialed-back a bit, but they originally recorded for LP, which has limited dynamic range anyway, but EMI has restored realism and life in these timeless songs even though they were recorded almost 50 years ago. If you like the Beatles' music, get these discs. They'll make a nice addition to your collection and make great gifts.&quot;\n\nCourtesy Gary Altunian About.com","torrent":{"xt":"urn:btih:53517e5f7fd3d5b6820023d8617b07bfcd72598a","amp;dn":"A+Hard+Days+Night+great+quality%21%21%21+320kbps+vbr+ogg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53517e5f7fd3d5b6820023d8617b07bfcd72598a","infoHashBuffer":{"type":"Buffer","data":[83,81,126,95,127,211,213,182,130,0,35,216,97,123,7,191,205,114,89,138]},"announce":[],"urlList":[]}}