{"title":"Wonders of the Universe - Part 1  (BBC 2011)","uid":6258006,"size":1140644931,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:53703883d96e2225a1f0537abebf78a1131a526d&amp;dn=Wonders+of+the+Universe+-+Part+1++%28BBC+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":2,"time":1300648430,"description":"Having explored the wonders of the solar system, Professor Brian Cox steps boldly on to an even bigger stage - the universe.\n\nWho are we? Where do we come from? For thousands of years humanity has turned to religion and myth for answers to these enduring questions. But in this series, Brian presents a different set of answers - answers provided by science.\n\nIn this episode, Brian seeks to understand the nature of time and its role in creating both the universe and ourselves. From an extraordinary calendar built into the landscape of Peru to the beaches of Costa Rica, Brian explores the cycles of time which define our experience of life on earth. But even the most epic cycles of life can't begin to compare to the vast expanse of cosmic time.\n\nFor instance, just as the earth orbits the sun, the solar system orbits the entire Milky Way galaxy. This orbit takes a staggering 250 million years to complete.\n\nUltimately, Brian discovers that time is not characterised by repetition but by irreversible change. From the relentless march of a glacier to the decay of an old mining town, the ravaging effects of time are all around us. The vast universe is subject to these same laws of change. As we look out to the cosmos, we can see the story of its evolution unfold, from the death of the first stars to the birth of the youngest. This journey from birth to death will ultimately lead to the destruction, not just of our planet, but also the entire universe, and with it the end of time itself.\n\nYet without this inevitable destruction, the universe would be without what is perhaps the greatest wonder of all; the brief moment in time in which life can exist.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:53703883d96e2225a1f0537abebf78a1131a526d","amp;dn":"Wonders+of+the+Universe+-+Part+1++%28BBC+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53703883d96e2225a1f0537abebf78a1131a526d","infoHashBuffer":{"type":"Buffer","data":[83,112,56,131,217,110,34,37,161,240,83,122,190,191,120,161,19,26,82,109]},"announce":[],"urlList":[]}}