{"title":"The Trials of Rumpole - John Mortimer  (Unabridged)","uid":6188528,"size":151855306,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:53bb0e6342e0e432f0a2aa3f74621b2d62d07559&amp;dn=The+Trials+of+Rumpole+-+John+Mortimer++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rosie1966","files":8,"time":1298161163,"description":"Unabridged and read by Bill Wallis. 7 hours duration. 6 CD's. (48 kbps / 44 kHz Mono, Fraunhofer CBR jetAudio 8+)\n\n \n[1979]\nIn &quot;Rumpole and the Man of God,&quot; an inoffensive minister who lives with his sister causes Rumpole to question the value of absolute truth and of memorabilia.\nIn &quot;Rumpole and the Showfolk,&quot; an actress accused of murdering her actor-husband causes the barrister to wonder if even he knows and understands the truth and its consequences.\nIn &quot;Rumpole and the Fascist Beast,&quot; he defends the unpopular cause of a whites-first rabblerouser accused of starting riots.\nIn &quot;Rumpole and the Case of Identity,&quot; there is a young man charged by the state with attacking an inoffensive Irishman with a knife while wearing a very identifiable cap, who loses everything in his life except his life and his freedom.\nIn &quot;Rumpole and the Course of True Love,&quot; he defends a teacher accused of seducing one of the pupils at a very liberal private school.\nFinally, in &quot;Rumpole and the Age of Retirement,&quot; he is faced with the manoeuvrings of his wife (She Who Must Be Obeyed) and his son, as well as several of his fellows in Chambers, to get him to retire from active practice and go live with his son's family in America.\nThese are interesting and habit-forming stories, which can start one thinking and wondering, not only about guilt and innocence, but about the effect (and consequently, the wisdom) of shattering their illusions on people's lives.\n\nBill Wallis sounds remarkably like Leo McKern.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:53bb0e6342e0e432f0a2aa3f74621b2d62d07559","amp;dn":"The+Trials+of+Rumpole+-+John+Mortimer++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53bb0e6342e0e432f0a2aa3f74621b2d62d07559","infoHashBuffer":{"type":"Buffer","data":[83,187,14,99,66,224,228,50,240,162,170,63,116,98,27,45,98,208,117,89]},"announce":[],"urlList":[]}}