{"title":"Parliament - P Funk Earth Tour Live (1991) 320 vtwin88cube","uid":6236127,"size":184760613,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:542b2acad5ae3837f11c79d17520ca32d5ae2a67&amp;dn=Parliament+-+P+Funk+Earth+Tour+Live+%281991%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1299878715,"description":"Parliament\nP Funk Earth Tour Live (1991)\n\n\nInspired by Motown's assembly line of sound, George Clinton gradually put together a collective of over 50 musicians and recorded the ensemble during the '70s both as Parliament and Funkadelic. While Funkadelic pursued band-format psychedelic rock, Parliament engaged in a funk free-for-all, blending influences from the godfathers (James Brown and Sly Stone) with freaky costumes and themes inspired by '60s acid culture and science fiction. From its 1970 inception until Clinton's dissolving of Parliament in 1980, the band hit the R&amp;B Top Ten several times but truly excelled in two other areas: large-selling, effective album statements and the most dazzling, extravagant live show in the business. In an era when Philly soul continued the slick sounds of establishment-approved R&amp;B, Parliament scared off more white listeners than it courted. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tSoul and R&amp;B\t\t\nSource:\t\t\tWeb\nLabel:\t\t\tIsland/Mercury\n\n\nThe only officially released in-concert Parliament-Funkadelic album, Live: P-Funk Earth Tour captures George Clinton and company at their peak in 1977, compiling recordings of a couple shows (January 19 at the Los Angeles Forum and January 21 at the Oakland Coliseum). The double-LP/single-CD album can't do justice to the group's extravagant theatrics, most memorably the landing of the mothership, but it's a wonderful showcase for their musical ability and their catalog of great songs, most of which come from the 1976 albums Mothership Connection and The Clones of Dr. Funkenstein. No performance was ever the same for these guys, and that's a major aspect of this album's entertainment value, for it's interesting to compare these live performances to their studio counterparts. Of particular note are the 15-minute extended performance of &quot;Dr. Funkenstein&quot; and the three-minute montage &quot;Landing (Of the Holy Mothership).&quot; Though unessential, Live: P-Funk Earth Tour is worth investigating for anyone curious about the Parliament-Funkadelic live experience and is a welcome alternative to the many bootlegs and latter-day P-Funk All Stars live recordings that have circulated over the years.\n\n\nTrack List:\n\n01.P Funk (Wants To Get Funked Up)\n02.Dr. Funkenstein's Supergroovalisticprosifunkstication Medley\n03.Do That Stuff\n04.The Landing (Of The Holy Mothership)\n05.Undisco Kidd (The Girl Is Bad!)\n06.Children Of Productions\n07.Mothership Connection (Star Child)\n08.Swing Down, Sweet Chariot\n09.This Is The Way We Funk With You\n10.Dr. Funkenstein\n11.Gamin' On Ya!\n12.Tear The Roof Off The Sucker Medley\n13.Night Of The Thumpasorus Peoples\n\n\n\nCheers!","torrent":{"xt":"urn:btih:542b2acad5ae3837f11c79d17520ca32d5ae2a67","amp;dn":"Parliament+-+P+Funk+Earth+Tour+Live+%281991%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"542b2acad5ae3837f11c79d17520ca32d5ae2a67","infoHashBuffer":{"type":"Buffer","data":[84,43,42,202,213,174,56,55,241,28,121,209,117,32,202,50,213,174,42,103]},"announce":[],"urlList":[]}}