{"title":"Breach(2007)DVDRip.AC3(ENG)-DROCK","uid":6165679,"size":733784656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5547e4fe45552100e46f772a397a53b870e392c0&amp;dn=Breach%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1297377455,"description":"Shattered Glass director Billy Ray directs Chris Cooper and Ryan Philippe in this fact-based drama concerning the FBI traitor who carried out what many historians refer to as the most notable national security breach in U.S. history. A key member of the FBI's elite Soviet Analytical Unit, Robert Hanssen (Chris Cooper) would, for 15 years beginning in 1985, sell thousands of pages of classified documents to the Soviets. After making roughly 600,000 dollars on his clandestine endeavor and compromising everything from the identities of KGB spies working for the American government to nuclear war contingency plans, Hanssen was eventually transferred to a newly created position at the FBI's Washington headquarters and assigned the task of guarding his country's most sensitive secrets. It was while working in this capacity that a young agent named Eric O'Neill (Phillipe) was assigned the task of keeping tabs on Hanssen by suspicious higher-ups. Later, after being arrested while delivering a cache of secret documents to a &quot;dead drop&quot; spot in a Virginia park, the notorious traitor was arrested and sentenced to life in prison with no chance for parole.\n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:5547e4fe45552100e46f772a397a53b870e392c0","amp;dn":"Breach%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5547e4fe45552100e46f772a397a53b870e392c0","infoHashBuffer":{"type":"Buffer","data":[85,71,228,254,69,85,33,0,228,111,119,42,57,122,83,184,112,227,146,192]},"announce":[],"urlList":[]}}