{"title":"Democracy Now - 25 mar 2011","uid":6271067,"size":456584438,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5576eb4ec7b8f4b68ccbc0171e3738ee9b2aca19&amp;dn=Democracy+Now+-+25+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1301105247,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 25, 2011\n\n- Japan Toll Passes 10,000; Leak at Reactor Core Probed\n- Quarter of U.S. Nuclear Plants Fail to Report Defects\n- NATO to Enforce Libya No-Fly Zone\n- U.N.: Libya in Breach of Ceasefire\n- Libyan Rebels Seeks International Military Aid\n- Gaddafi Regime: Civilian Casualties in U.S.-Led Strikes\n- Syria Gov't Pledges Reforms, But Protests Grow\n- Hundreds of Thousands Rally in Yemen\n- Protesters Launch Tent Camp in Jordan\n- 2 Afghan Civilians Killed in U.S. Attack\n- Wisconsin State Supreme Court to Rule on Anti-Union Bill Challenge\n- Indiana Prosecutor Resigns for Advising Staged Attack\n- Restrictive Voter ID Bills Advance in Ohio, Texas\n- Thousands Protest Georgia Immigration Bill\n- U.S. Reverses Visa Denial to Afghan Activist\n\n\nSpecial reports\n\n- 100th Anniversary of the Triangle Shirtwaist Factory Fire\n\nToday marks the centennial anniversary of the Triangle Shirtwaist Factory Fire, the deadliest workplace accident in New York City's history and a seminal moment for American labor. On March 25, 1911, 146 garment workers, mostly young immigrant women, died after a fire broke out at the factory. Many of them leaped to their deaths when they tried to escape and found the emergency exits locked. &quot;I saw people throwing themselves from the window. As soon as we went down, we could not get out because the bodies were coming down&quot; says the last survivor of the fire in a 1986 interview with Amy Goodman. Denied any collective bargaining rights, the Triangle workers were powerless to change the abysmal conditions in their factory: inadequate ventilation, lack of safety precautions and fire drills--and locked doors.\n\n\n- Labor Rights Legacy of the Triangle Shirtwaist Fire: Garment Unions Marched Out Of This Fire and Produced the New Unionism\n\nThe 1911 Triangle Shirtwaist Factory fire in New York City unleashed public outrage, forcing government action. Within three years, more than 36 new state laws had been passed on quality of work as conditions. The landmark legislation gave New Yorkers the most comprehensive workplace safety laws in the country and become a model for the nation. &quot;There's a straight line that runs from the fire right through the New Deal of labor legislation reform, the welfare state, and the creation of industrial unionism-and the right to collectively bargain in that time,&quot; says labor historian Steve Fraser.\n\n\n- 100 Years After Triangle Fire, Tragedy in Bangladesh and Anti-Union Bill in Wisconsin Highlight Workers' Enduring Struggles\n\nOne hundred years after the Triangle Shirtwaist Factory Fire, we look at some of the major struggles facing workers today in the United States and around the world. In one of many recent fires, 26 workers making clothes for U.S. companies were killed in Bangladesh last December. Workers across the United States, meanwhile, are facing a resurgent assault on salaries, benefits, and their right to organize-as epitomized in Wisconsin's anti-union bill.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:5576eb4ec7b8f4b68ccbc0171e3738ee9b2aca19","amp;dn":"Democracy+Now+-+25+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5576eb4ec7b8f4b68ccbc0171e3738ee9b2aca19","infoHashBuffer":{"type":"Buffer","data":[85,118,235,78,199,184,244,182,140,203,192,23,30,55,56,238,155,42,202,25]},"announce":[],"urlList":[]}}