{"title":"Proof (Jocelyn Moorhouse, 1991) [+ Extras]","uid":6281081,"size":1154076288,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5588a9d025a34926d0676d90fcd619892ce016ae&amp;dn=Proof+%28Jocelyn+Moorhouse%2C+1991%29+%5B%2B+Extras%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rpessoa","files":-1,"time":1301438302,"description":"Proof (1991)\nJocelyn Moorhouse\n\n============================================\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0102721/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0102721/&lt;/a&gt;\n\n============================================\n\nSUBS: English | PortuguÃƒÂªs (por Lu Stoker/Making Off)\n\n============================================\n\nStars: Hugo Weaving, GeneviÃƒÂ¨ve Picot and Russell Crowe\n\n\n&quot;Martin is a blind man who believes anyone might be lying to him.\n\nHis lack of trust, which runs so deep it has defined his entire life and personality, began in childhood. It was his mother's custom to describe the garden outside his window to him. One day she told him there was a man raking leaves in the garden. Martin could hear nothing, and decided his mother was lying. He used a camera to take a photograph of the garden.\n\nWhen we meet Martin, in the opening scenes of 'Proof,' years have passed, but he is still a photographer. It is his way of checking up on his friends. He takes pictures, has them developed, asks people to describe them to him, labels them in Braille, and is alert to any contradictions in what people tell him. Martin lives alone, in a rigid and compromising lifestyle, and is fiercely independent. If he feels he is being overlooked in a restaurant, for example, he is capable of taking a bottle of wine and pouring it out on the table until a waiter takes notice.\n\nCelia is Martin's housekeeper. Actually, she doesn't need the work to support herself. It is her way of getting into Martin's life. She is a photographer herself. Her walls are covered with photos of Martin. Their relationship is prickly and marked by anger; perhaps Celia enjoys the sharp edge of every conversation.\n\nOne day Martin, to his amazement, makes a friend, Andy, who works in the restaurant. They start hanging out together, which offends the possessive Celia.\n\nAnd so the long-established patterns of Martin's life begin to change, as Celia uses her sexuality as a device to control both men.\n\nThe ending of the film is a release of pent-up tension, a calling-due of all the emotional bills that Martin has never been willing to pay.\n\nAnd everything comes back to that picture he took of the garden: Was his mother lying to him, or not? &quot;Proof&quot; is a first film from Australia, written and directed by Jocelyn Moorhouse, who has the gift of creating characters who are interesting just because of who they are. The movie doesn't depend on a contrived plot or any manufactured surprises. It simply introduces us to Martin, Celia and Andy, and the situation Martin has carefully made for himself, and as they develop their games of power and control, we become completely absorbed.\n\nMartin, played by the tight-faced, rigidly controlled Hugo Weaving, is an original, a man who has protected himself so completely against the possibility of being hurt that he has cut off the possibility of feeling.\n\nCelia's need for just this sort of man is the most interesting thing about her. Andy is an innocent compared to the other two.\n\nMoorhouse has a way of putting all the pieces into place for a scene, so that it pays off in ways we could not anticipate.\n\nObserve, for example, the scene in the park, when Martin doesn't realize that the others are there. His camera becomes the occasion for comedy at the beginning, and for a troubling payoff later on. Or look at the way Moorhouse uses that original photo, the one of the garden which might or might not be empty.\n\nIf there is a kind of movie I like better than any other, it is this kind, the close observation of particular lives, perhaps because it exploits so completely the cinema's potential for voyeurism. There are not good or bad people here, simply characters driven by their needs and insecurities into a situation where something has to give. What could be more interesting?&quot;\n\n============================================\n\nFile Name .............: Proof.avi \nFile Size (in bytes) ..: 1,259,167,744 bytes \nRuntime (# of frames) .: 01:29:56 (129382 frames) \n\nVideo Codec ...........: XviD \nFrame Size ............: 640x352 () [=] [=1.818] \nFPS ...................: 23.976 \nVideo Bitrate .........: 1229 kb/s \nBits per Pixel ........: 0.228 bpp \nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[]...[]...[] \n\nAudio Codec ...........: 0x2000(AC3, Dolby Laboratories, Inc) AC3 \nSample Rate ...........: 48000 Hz \nAudio bitrate .........: 384 kb/s [5 channel(s)] CBR audio \nInterleave ............: 42 ms \nNo. of audio streams ..: 3\n","torrent":{"xt":"urn:btih:5588a9d025a34926d0676d90fcd619892ce016ae","amp;dn":"Proof+%28Jocelyn+Moorhouse%2C+1991%29+%5B%2B+Extras%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5588a9d025a34926d0676d90fcd619892ce016ae","infoHashBuffer":{"type":"Buffer","data":[85,136,169,208,37,163,73,38,208,103,109,144,252,214,25,137,44,224,22,174]},"announce":[],"urlList":[]}}