{"title":"Earthworm Jim PC-Hyperdrive25.exe","uid":6180981,"size":2497952,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:55d77ead47e56c2e52c72c46a1bf52858a34c834&amp;dn=Earthworm+Jim+PC-Hyperdrive25.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":1,"time":1297954637,"description":"                           EARTHWORM JIM PC\n                           ----------------\n\nJim used to be a garden-variety earthworm, but after discovering a high-tech space cybersuit, he became a super mean fighting machine known as Earthworm Jim. In this wacky platformer, you play as Jim as he tries to rid the world of evil, including a diabolical character known as Psy-Crow, who wants Jim's suit for his own needs. You'll lead Jim through 12 nutty levels, including New Junk City, What the Heck?, Down the Tubes, Snot a Problem, Level 5, For Pete's Sake, Buttville, and Andy Asteroids, as you run, jump, and fight your way to victory. Along the way, you'll find all kinds of power-ups that make you stronger and let you pull off moves you wouldn't otherwise be able to do. If the addictive gameplay and awesome graphics don't pull you in, then the fact that you play as an earthworm superhero definitely will!\n\nEarthworm Jim game was for 1 player only. You were Jim and you had to journey through 8 stages of craziness, and fun. You were equipped with your head whip and trusty plasma blaster. You also found one other weapon a mega plasma blaster that shot a powerful shot that destroyed everything on the screen. You also had moves that helped you get to places you needed to go like head helicopter and the head whip to the hooks. You had to fight bosses on each and every level unlike the sequel where you only had a boss on two stages. You also have a very fun side game that you can play. It is where you ride your pocket rocket and try to beat Psycrow in a race among the asteroid belt. If you lose however you and Psycrow have a little scuffle on the nearest moon or planet. There are some stages that are different than the others, and some parts of the game where you control Jim without the suit. The stage is where you have to fight Sergeant Sludge through and there is a big mouth on the bottom of a snot pit ready to eat you. You are budgie jumping from your head and so is Sludge you have to keep shoulder ramming him. This stage offers a lot of variety and it is also fun. The difficulty through out the game is adjustable and their isn't save or password feature.\n\nEarthworm Jim is pretty hard to beat in one sit through their should have been one.\n\nEarthworm Jim features:\n\n    * Features 12 cool levels of platforming action\n    * Power-ups to help your cause\n    * Tons of wacky enemies to fight \n    * Stellar graphics\n\nScreenshots: &lt;a href=&quot;\nhttp://cheats.ign.com/dor/earthworm-jim/6276/images/earthworm-jim-virtual-console-20081027013544232.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cheats.ign.com/dor/earthworm-jim/6276/images/earthworm-jim-virtual-console-20081027013544232.html&lt;/a&gt;\n\nHow to install\n--------------\nDouble-Click the Earthworm Jim PC-Hyperdrive25.exe and follow the instructions \nand Enjoy!!!\n...................................................................................\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\n\n \n\n","torrent":{"xt":"urn:btih:55d77ead47e56c2e52c72c46a1bf52858a34c834","amp;dn":"Earthworm+Jim+PC-Hyperdrive25.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d77ead47e56c2e52c72c46a1bf52858a34c834","infoHashBuffer":{"type":"Buffer","data":[85,215,126,173,71,229,108,46,82,199,44,70,161,191,82,133,138,52,200,52]},"announce":[],"urlList":[]}}