{"title":"The Serpent and the Rainbow (1988) x264 DVDRip","uid":6182243,"size":1460566783,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56f140ff8007e79472a38e83ef53e99445531e13&amp;dn=The+Serpent+and+the+Rainbow+%281988%29+x264+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"grebmops","files":1,"time":1297997405,"description":"The Serpent and the Rainbow is a 1988 American voodoo-horror film, directed by Wes Craven and starring Bill Pullman. The film is very loosely based on the non-fiction book of the same name by ethnobotanist Wade Davis.\n\nDavis' book recounted his experiences in Haiti investigating the story of Clairvius Narcisse. Narcisse was allegedly poisoned and buried alive. When he was released from the grave, he was given an herbal brew whose effects produced what was called a zombie.\n\nDennis Alan, an ethnobotanist/anthropologist from Harvard University, narrowly escapes the Amazon Jungle and returns to Boston. Word of his exploits gets around, and he is approached by a large pharmaceutical corporation looking to investigate a drug used in Voodoo religion in Haiti. They want to acquire it for mass production. They send him to Haiti to find out about the drug. He learns more about the process of making zombies instead. He discovers the drug is an alternate and less dangerous method of anesthesia.\n\nWhen Alan arrives in Haiti, the country is in the middle of a revolution. The government is imprisoning and killing all opponents. Alan meets another doctor, Marielle, who helps him research and investigate the so-called zombies. Alan finds the negative side of Vodou religion, which can destroy the mind.\n\nAlan's exploration in Haiti to find the &quot;zombie drug&quot; draws the attention of the authorities. As they have used the zombie legends to create fear in the population, they do not want the secrets revealed. The commander of the Tonton Macoute, Captain Dargent Peytraud, threatens Alan to get him to leave Haiti.\n\nAlan is at first not harmed by Peytraud, due to his status as a U.S. citizen and touchy diplomatic relations between Haiti and the US. Alan refuses to leave, however, and continues to investigate the zombie drug. He finds a local witch doctor, Mozart, who can produce it. Before gaining this knowledge, Alan is arrested a second time by the Tonton Macoutes and tortured. After having his scrotum nailed through, Alan is dumped on a street with the message clear that he had best leave Haiti before he is killed. Alan, however, still refuses to do so and meets with Mozart to create the zombie drug.\n\nA few hours before picking up the final product, however, Alan has a terrifying dream. This was planted in his head by Peytraud, revealed to be an evil bokor (sorceror). When Alan wakes up, he is lying next to a dead woman. The Tonton Macoutes enter, take photos, and frame Alan for murder.\n\nWhen Alan is brought to Peytraud a third time, Peytraud vows to torment him until he leaves the country. His forces put Alan on an airplane at gunpoint. Mozart sneaks onboard at the last minute and gives Alan the zombie drug for free. Mozart simply asks him to tell people about him, so the witch doctor can achieve international fame. Alan returns to Boston with his mission apparently completed.\n\nAt a celebration dinner, the wife of Alan's employer is possessed by the bokor Peytraud, who proclaims, &quot;You've been warned, you're going to die!&quot; Alan returns to Haiti, where he enters a nightmare world and is turned into a zombie and buried alive. He escapes from the grave as Haiti's government falls. Alan confronts Peytraud in the burning ruins of Tonton Macoute headquarters. After a final battle in Alan's soul, he sends Peytraud to Hell and emerges from his nightmare.","torrent":{"xt":"urn:btih:56f140ff8007e79472a38e83ef53e99445531e13","amp;dn":"The+Serpent+and+the+Rainbow+%281988%29+x264+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56f140ff8007e79472a38e83ef53e99445531e13","infoHashBuffer":{"type":"Buffer","data":[86,241,64,255,128,7,231,148,114,163,142,131,239,83,233,148,69,83,30,19]},"announce":[],"urlList":[]}}