{"title":"The Truman Show(1998)DVDRip.AC3(ENG)-DROCK","uid":6250649,"size":733428022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:570fe10dc958556ffe9e20bdc80d3ff08a56107d&amp;dn=The+Truman+Show%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300397061,"description":"Peter Weir directed this comedy-drama, a commentary on all-pervasive media manipulation. Scripted by Andrew M. Niccol (Gattaca), the film plays like a combination of the British TV series The Prisoner and Paul Bartel's The Secret Cinema. Truman Burbank (Jim Carrey) is unaware that his entire life is a hugely popular 24-hour-a-day TV series. In this real-time documentary, every moment of Truman's existence is captured by concealed cameras and telecast to a giant global audience. His friends and family are actors who smile pleasantly at Truman's familiar catchphrase greeting, &quot;In case I don't see you later, good afternoon, good evening, and good night!&quot; Employed at an insurance company, Truman is married to merry Meryl (Laura Linney), and they live in the cheerful community of Seahaven, an island &quot;paradise&quot; where the weather is always mild and no unpleasantness intrudes. This is the basic situation of the series, which has grown over the years into a billion-dollar franchise for the TV network. As an unwanted pregnancy, Truman was adopted by the network and raised in the zoolike environment of a TV soundstage. Thus, the TV audience became hooked when Truman was very young. Now, at age 30, he still doesn't know he's a prisoner on an immense domed city-size soundstage, simulating Seahaven. Both the illusion and the ratings will collapse if Truman ever leaves Seahaven. In addition to elaborate events staged to make sure he stays put, Truman is given constant reminders of how wonderful Seahaven is compared to dangers in other parts of the world. However, his growing suspicions make him curious enough to try to leave, and the show's director and master manipulator Christof (Ed Harris) must constantly devise ways to thwart Truman's escape attempts. To enter the harbor, Truman must overcome his fear of water, intentionally instilled in him when his father &quot;died&quot; in a boating accident and was written out of the script. Exteriors were filmed in the Victorian-styled upscale community of Seaside, Florida. In addition to the Burkhard Dallwitz score, original music by Philip Glass and classical excerpts are also featured.\n\nRipped with Handbrake.\n\nLength: 1 Hour 42 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:570fe10dc958556ffe9e20bdc80d3ff08a56107d","amp;dn":"The+Truman+Show%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570fe10dc958556ffe9e20bdc80d3ff08a56107d","infoHashBuffer":{"type":"Buffer","data":[87,15,225,13,201,88,85,111,254,158,32,189,200,13,63,240,138,86,16,125]},"announce":[],"urlList":[]}}