{"title":"HISTORY OF POP AND ROCK MUSIC - part 290","uid":6260896,"size":923966403,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:588c2526456e8292102261460335a876fce29d74&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+290&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1300750499,"description":"                  \n\n                    PART  290\n\n\n          01. THE FORTUNES  - Freedom Come Freedom Go  (1971)\n          02. THE TREMELOES  -  Hello Buddy  (1971)\n          03. GOLDEN EARRING  -  Buddy Joe  (1972)\n          04. THE TREMELOES  -  Blue Suede Tie  (1972)\n          05. CHICORY TIP - Son Of My Father Video (1972)\n                        \n\n\n     The Fortunes are an English harmony beat group. Formed in Birmingham, The Fortunes first came to prominence and international acclaim in 1965, when &quot;You've Got Your Troubles&quot; broke into the US and UK Top 10s. Afterwards they did a succession of hits including &quot;Here It Comes Again&quot; and &quot;Here Comes That Rainy Day Feeling Again&quot;; continuing into the 1970s with more globally successful releases such as &quot;Storm in a Teacup&quot; and  &quot;Freedom Come, Freedom Go&quot;.\n    The Tremeloes are an English rock and roll band founded in 1958 in Dagenham, Essex, and still active today.The Tremeloes proved to be a very talented band in their own right and had a successful career. Like the Beatles, every member of the Tremeloes was a strong singer and the band seamlessly combined rock and roll with a variety of other genres.Brian Poole and the Tremeloes first charted with a version of &quot;Twist and Shout&quot; (1963), a song ironically also recorded by the Beatles. This was followed by a chart topping cover of The Contours' U.S. million-seller &quot;Do You Love Me&quot; in the same year.After switching from Decca to CBS Records, the Tremeloes started a successful hit run from 1967 onwards with Cat Stevens' &quot;Here Comes My Baby&quot;; &quot;Hello World&quot;; three Italian hits translated into English (&quot;Suddenly You Love Me&quot;, which is Riccardo Del Turco's &quot;Uno tranquillo&quot; (&quot;One quiet man&quot;), &quot;I'm Gonna Try&quot;, which is Riccardo Del Turco's 1967 hit &quot;Luglio&quot; (&quot;July&quot;), and &quot;My Little Lady&quot;, based on Orietta Berti's &quot;Non illuderti mai&quot; (&quot;Never deceive yourself&quot;)); and their Number one recording of an old Four Seasons' B-side &quot;Silence is Golden&quot;. Both this last single and &quot;Here Comes My Baby&quot; also entered the Top Twenty of the U.S. Billboard Hot 100 on CBS' co-owned Epic Records. \n     &quot;Buddy Joe&quot;   is a song by Golden Earring  from their &quot;Together&quot; album, released in 1972. \n     &quot;Son Of My Father&quot; is a song popularised by Chicory Tip.Originally written by Giorgio Moroder and Pete Bellotte in Italian as &quot;Tu sei mio padre&quot; and recorded under the moniker Giorgio. A copy found its way to studio manager Roger Easterby who persuaded British band Chicory Tip to record it in English. The song produced by Easterby and Des Champ is notable as the first UK number one single to prominently feature a synthesizer, in this case a Moog synthesizer played by Chris Thomas. The song reached #1 on the UK singles chart for three weeks in February 1972. Moroder re-recorded his song in English shortly after, but it failed to chart in the UK, though it made the Top 50 in the United States.","torrent":{"xt":"urn:btih:588c2526456e8292102261460335a876fce29d74","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+290","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588c2526456e8292102261460335a876fce29d74","infoHashBuffer":{"type":"Buffer","data":[88,140,37,38,69,110,130,146,16,34,97,70,3,53,168,118,252,226,157,116]},"announce":[],"urlList":[]}}