{"title":"Coast to Coast AM - 2011-02-22 - Electronic Harassment &amp; Warfare","uid":6197902,"size":55002058,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5cdbde114ab66aa9c5991de104b2cf57c8f71b7c&amp;dn=Coast+to+Coast+AM+-+2011-02-22+-+Electronic+Harassment+%26+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pegasus77","files":5,"time":1298503461,"description":"Electronic Harassment &amp; Warfare\n\nDate: 02-22-2011\nHost: George Noory\nGuests: Fred Bell, Mitch Battros\n\nScientist and innovator Dr. Fred Bell discussed reports of electronic harassment and holographic warfare technology. Electronic harassment comes in a variety of forms-- it can be imposed surveillance of people's belongings or surroundings, sabotaging of computers, directed high energy devices, as well as voice/data imaging, in which voices are beamed into a person's head.\n\nThe symptoms of electronic harassment include unusual forgetfulness, suicidal &amp; homicidal thoughts, panic attacks, depression, and paranoia, he detailed. In some cases, he continued, it can include the stoppage of power to appliances, movement of objects that might fall of a shelf and break, and computer failures and problems. One type of attack, he said, is carried out by &quot;confusion weaponry&quot; which uses frequencies or impulses to disrupt thoughts. He cited an LA newscaster who garbled her words in a live report, as possibly being a target of the technology.\n\nBell also talked about the advancement of satellites, which can knock things out of the sky with EMP pulses. Law enforcement is developing devices to remotely shut down the electronic ignition of cars they're chasing, he added. Victims of electronic harassment can use counteraction technology to block energy or absorb microwave radiation, he stated. One of his recent inventions is the QBAM (Quantum Biological Administrating Machine), a quantum healing device.\n\nEarth Changes Update:\nFirst hour guest, earth changes expert Mitch Battros reported on the deadly New Zealand earthquake-- a shallow quake that hit in an area with soft dirt. He also made connections between recent volcanoes, solar flares, and the pole shift, citing the lessening of Earth's magnetic field.\n\nNews segment guests: Dr. Len Horowitz, Mish Shedlock\n\nWebsites:\npyradyne.com\nearthchangesmedia.com\n\nBooks:\nThe Inside Track\nRays of Truth - Crystals of Light\nSolar Rain","torrent":{"xt":"urn:btih:5cdbde114ab66aa9c5991de104b2cf57c8f71b7c","amp;dn":"Coast+to+Coast+AM+-+2011-02-22+-+Electronic+Harassment+%26+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cdbde114ab66aa9c5991de104b2cf57c8f71b7c","infoHashBuffer":{"type":"Buffer","data":[92,219,222,17,74,182,106,169,197,153,29,225,4,178,207,87,200,247,27,124]},"announce":[],"urlList":[]}}