{"title":"Internet Download Manager v6.05 Build 10 Final","uid":6280381,"size":7773829,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5d11990e08d6e687fbd1116c62b3f158e9643219&amp;dn=Internet+Download+Manager+v6.05+Build+10+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"adnan1102","files":-1,"time":1301410035,"description":"Internet Download Manager is a full-featured package that handles downloading tasks with aplomb. It conveniently integrates into your browser, even if you use Mozilla or Opera.\n\nIt automatically sorts incoming files by file type and puts them in the appropriate folder. Most importantly, it supercharges download speeds (it doubled ours). Its windowed interface is clean and easy to understand. Power users can take advantage of the command line interface to resume file transfers, schedule downloads, connect through dial-up, or log on to password-protected sites. Experienced users also can limit the number of connections, the download speeds for specific sites, and even create an exception list to block specific, user-defined sites.\n\nOther features include automatic virus checking and the ability to download all files linked to a page. The new version has a Web spider that can analyze a site and retrieve, for example, all the images on it.\n\nInternet Download Manager strikes us as a natural choice for users in need of a trusty transfer tool. Version 5.11 build 5 added FLV grabber that can be used to download videos from YouTube, Google Video, MySpaceTV, and other popular sites.\nPublisher's description\n\n\nInternet Download Manager is a tool for increasing download speeds by up to 5 times, and for resuming, scheduling, and organizing downloads. The program will resume unfinished downloads due to network problems, or unexpected power outages. The program features a full-fledged site grabber that downloads files that are specified with filters, for example, all pictures from a Web site, different parts of Web sites, or complete Web sites for offline browsing. The program supports HTTP, HTTPS, FTP and MMS protocols, and has an adaptive download accelerator for MP3 audio, FLV and MPEG video files. The program also features Download Video and Audio Panels for Internet Exporer, Chrome, Opera, Safari, Firefox and other Mozilla based browsers that appears on top of a web-player and can be used to download flash videos from sites like YouTube, MySpaceTV, Google Videos.\n\nWhat's new in this version: Version 6.05 build 10 made a workaround to resolve compatibility problems of IDM network drivers with antiviral software drivers which caused some sites to load slowly in browsers.\n\nImportance:\nIf ur AV shows it to be a virus just ignore it,its a false positive.","torrent":{"xt":"urn:btih:5d11990e08d6e687fbd1116c62b3f158e9643219","amp;dn":"Internet+Download+Manager+v6.05+Build+10+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d11990e08d6e687fbd1116c62b3f158e9643219","infoHashBuffer":{"type":"Buffer","data":[93,17,153,14,8,214,230,135,251,209,17,108,98,179,241,88,233,100,50,25]},"announce":[],"urlList":[]}}