{"title":"Public Enemy - New Whirl Odor .flac files","uid":6282804,"size":513615466,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5db01effb14f1ce3b90bcf7c06f3931b6f30f857&amp;dn=Public+Enemy+-+New+Whirl+Odor+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ulikes","files":24,"time":1301503797,"description":"The patented sound of rap mega stars Public Enemy has always been one of intense anger and frustration. On the group's newest album, their tenth, that sound finds new ways of releasing the pent-up reservoir of disillusionment that lead rapper Chuck D embodies.\n\nThe atmosphere of most of the tracks is dense and noisy, as is usual for PE. However, this album contains tracks like &quot;Bring That Beat Back&quot; and &quot;Makes You Blind&quot;, which feature calm enough arrangements to be possible hits in today's rap music scene, while still keeping enough of the hard-core sound that the group is so well known for.\n\nChuck's lyrics can be a bit confounding and sometimes it sounds as if the ideas covered in one song are all over the place and un-focused; instead of hitting upon one topic per song, for example, he may hit upon ten. Also, surprisingly, there are no songs from humorous side-kick Flavor Flav this time out, but Professor Griff (once kicked out of the group before being reinstated years later) gets a chance on the mic with guest spots on two tracks as well as his own song, &quot;Y'all Don't Know&quot;.\n\n&quot;MKLVFKWR&quot; features an intense, exhilarating beat constructed by Moby and powerful, vehement lyrics from Chuck which call out desperately for world peace. It is the type of song for which Public Enemy initially became famous, and it's message and non-stop sonic assault are so invigorating, it forces you to get up and pump your fist in the air.\n\nDJ Lord Aswod has filled the position which Terminator X used to occupy, and he does so very admirably. Listen to his technically amazing scratch work on &quot;Preaching to the Quiet&quot; and &quot;Check What You're Listening To&quot;.\n\nThe album ends up with &quot;Superman's Black in the Building&quot;, an almost 12- minute long odyssey put together in a format which is new for the group. Overall, the exciting beats and angry, yet intelligent lyrics win you over- especially when you consider the low artistic quality of so much of other hip-hop music being released today.\n\nPublic Enemy is back! They have returned with an album so good that it nearly equals the artistic heights they achieved with their classics, &quot;It Takes a Nation...&quot; and &quot;Fear of a Black Planet&quot;. \n\nTrack Listing:\n\n1. ...And No One Broadcasted Louder Than... (Intro) \t\n2. New Whirl Odor \t\n3. Bring That Beat Back \n4. 66.6 Strikes Again \t\n5. MKLVFKWR \t\n6. What a Fool Believes \n7. Makes You Blind \t\n8. Preachin' to the Quiet \n9. Either We Together or We Ain't (S1W Stepstrumental) \t\n10. Revolution \t\n11. Check What You're Listening To \n12. As Long as the People Got Something to Say \n13. Y'All Don't Know \t\n14. Either You Get It by Now or You Don't \n15. Superman's Black in the Building \n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:5db01effb14f1ce3b90bcf7c06f3931b6f30f857","amp;dn":"Public+Enemy+-+New+Whirl+Odor+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db01effb14f1ce3b90bcf7c06f3931b6f30f857","infoHashBuffer":{"type":"Buffer","data":[93,176,30,255,177,79,28,227,185,11,207,124,6,243,147,27,111,48,248,87]},"announce":[],"urlList":[]}}