{"title":"Satya Sai Maitreya Kali - Apache-Inca (1971-72) (2CD) [FLAC]","uid":6305262,"size":402697746,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ddd9445ce32f065a338467caed66c73978c2d86&amp;dn=Satya+Sai+Maitreya+Kali+-+Apache-Inca+%281971-72%29+%282CD%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zibbik","files":29,"time":1302303747,"description":"\nArtist: Satya Sai Maitreya Kali\nTitle: Apache-Inca\nGenre: Psychedelic Folk Rock\nOrigin: US\n\n\nAt one point, the two albums credited to Satya Sai Maitreya Kali were paired together on a double LP; both of these LPs were so rare that few knew of their existence.\nThe music's a lot easier to hear now that Normal/Shadoks has reissued both LPs on this double-CD package.\nAlthough issued in the early '70s, the records often sound a lot more in line with circa 1967 folk-rock, primarily because about half the cuts were actually recorded during that era by Craig Smith's band of the time, the Penny Arkade.\nThe Penny Arkade tracks are slightly odd but accessible Californian country-influenced folk-rock. The acoustic ballads were recorded by Craig Smith solo after the Penny Arkade; these have a gentle yet spooky mysticism that recalls the fine (and almost as obscure) solo albums by the legendary Dino Valenti and Skip Spence.\nOn Apache, &quot;Color Fantasy,&quot; with its full harmonies and tremolo guitars, recalls a lighter, spacier Buffalo Springfield (a group that not many artists could sound like).\nSomething like &quot;Voodoo Spell,&quot; by contrast, sounds like a tougher Monkees. The weirdness continues on &quot;Love Is Our Existence&quot; and &quot;Revelation,&quot; both of which have truly eerie disembodied vocals, apparently getting run through a Leslie speaker to the accompaniment of underdeveloped, interesting backing tracks. Inca is really not that much different from Apache, having also been assembled from the same pool of sessions (by both the Penny Arkade and Smith solo).\nIf there's any difference between Apache and Inca, it's that the more extreme numbers seem weirder and more ambitious.\nForemost among these is the Penny Arkade's 12-minute &quot;Knot the Freize&quot; (sic), which despite its length is a pretty well-thought-out combination of differing sections, not a long jam; it's far more pop/rock than it is indulgent psychedelia.\nThe occasional insertion of lo-fi spoken word recordings between the tracks makes it seem as though the artist was determined to deliberately sabotage conventional commercial strategies, even though much of the music is actually rather commercial.\nIt's that irony, among other enigmatic qualities, that makes this among the more interesting small-press psychedelic reissues you're likely to find, though much of the enigma has been resolved after the discovery that this was a mix of tracks by the Penny Arkade and later solo recordings by Smith (by Richie Unterberger).\n\nTracklist:\n\nDisc 1 - Apache\n1. Ice and Snow\n2. Black Swan\n3. Color Fantasy\n4. Voodoo Spell\n5. Salesman\n6. Music Box\n7. Love Is Our Existence\n8. One Last Farewell\n9. I'm Walkin' Solo\n10. Silk and Ivory\n11. Swim\n12. Revelation\n\nDisc 2 - Inca\n1. Lights of Dawn\n2. Thesis\n3. Knot the Freize\n4. Jesus Owns\n5. Sam Pan Boat\n6. Fearless Men\n7. Cheryl\n8. Country Girl\n9. Old Man\n10. King \n","torrent":{"xt":"urn:btih:5ddd9445ce32f065a338467caed66c73978c2d86","amp;dn":"Satya+Sai+Maitreya+Kali+-+Apache-Inca+%281971-72%29+%282CD%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ddd9445ce32f065a338467caed66c73978c2d86","infoHashBuffer":{"type":"Buffer","data":[93,221,148,69,206,50,240,101,163,56,70,124,174,214,108,115,151,140,45,134]},"announce":[],"urlList":[]}}