{"title":"King Rat 1965 book film OST Honeyko x264 aac  DVDrip proper 24fp","uid":6231169,"size":2665593713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5fdbae1753c167a24d713e896ad4fad756e3c882&amp;dn=King+Rat+1965+book+film+OST+Honeyko+x264+aac++DVDrip+proper+24fp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike18xx2","files":43,"time":1299716479,"description":"Torrent includes book, film, and film soundtrack (lossless FLAC).\n\nKing Rat: 1965 - Drama, Prisoners of War, George Segal, Tom Courtney, James Fox\n\nVideo Codec ........... x264, CQ16, LEM, Lanczosmtplus, MVDegrain3\nFrame Size ...........: 704x464 PAR, 838x464 Anamorphic DAR\nVideo FPS ............: 23.976fps\nAudio ................: Mono 0.35 Nero AAC\n\nSubjective appearance compared to original dirty, grainy DVD source VOB:\nconsiderably superior. As good as it gets prior to a blu-ray release.\n\nLanguage audio: English; ... Subtitles: 16 languages (see file contents).\n\n\n\nA pitiless world, 11 March 2003\nAuthor: dsmith-7 from San Francisco\n\nI saw this movie again recently and had forgotten how great it was. It shows how people behave towards each other when the thin veil of civil society is torn away.In a brilliant performance, George Segal plays the wheeler-dealer 'King Rat, a cynical hustler whose only real interest is himself. His counterparts in the Japanese POW camp are the British officers who seem to maintain the rules and courtesies of civilized life. As the movie, unfolds, though, we see the senior officers using their position to steal food from the lower ranks. Even the British provost marshal, or camp policeman (another great performance by Tom Courtenay), is shown to be a weak character, vengeful and sanctimonious, who must believe in retribution to bolster his fragile ego.\n\n'King Rat's' one true friend in the camp is played by James Fox. But the Segal character can't really be a friend to anyone. One of the prices of cynicism is emotional shallowness. In the end Segal tells his best friend - 'You worked for me, I paid you a few bucks, that's all there was between us.' The film makes it clear that the action applies to the wider world. Unlike the other prisoners, the Segal character is neither shocked nor excited by liberation. To him, the everyday world is as pitiless as the POW camp.\n\n\n\nA grimly humorous meditation on power, class, privilege and character difficult to ever forget., 10 July 2004  8/10  Author: Arbarbiter from Omphalos DC\n\nI saw this grainy black and white film sometime in 1967 one steamy evening in a tin hooch Army movie theatre at TSN airfield on the outskirts of Saigon. The movie was punctuated by the sounds of mortars on the perimeter and the occasional flash from an aerial flare. I never forgot it. It rang true there. So true that no-one could say a word after. We just got drunk -- as usual. I haven't talked to many others who saw this movie. It hit right in the middle of the rising tide of despair over Vietnam. And since it wasn't actually an anti-war movie, I think it went nowhere. I believe it's origin is a short novel, possibly autobiographical by J.B. Clavell, author of Tai Pan and other sagas set in the 19th C orient. No matter what George Segal has done since, I have known that he has the heart of a rat. His King was a natural ruler in a perverse state of nature -- and his fate the fate of all maverick rulers in the end. If you can find it and see it, it will take on the character of a lost dream. ","torrent":{"xt":"urn:btih:5fdbae1753c167a24d713e896ad4fad756e3c882","amp;dn":"King+Rat+1965+book+film+OST+Honeyko+x264+aac++DVDrip+proper+24fp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fdbae1753c167a24d713e896ad4fad756e3c882","infoHashBuffer":{"type":"Buffer","data":[95,219,174,23,83,193,103,162,77,113,62,137,106,212,250,215,86,227,200,130]},"announce":[],"urlList":[]}}