{"title":"Radio Energy Weapons - Conspiracy Con (2009)","uid":6284711,"size":323969116,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:60b960be76f97daaec62d9fa7d4fc3b4bc964857&amp;dn=Radio+Energy+Weapons+-+Conspiracy+Con+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"naba888","files":8,"time":1301569626,"description":"1) Electronic Harassment, Surveillance, Police State - Roger Tolces _ Conspiracy Con _ 2009.mp4\n\n480 x 360 pixels\n331.34 kbits/s\n01:30:47.48\n\nby Roger Tolces, Private Investigator, Advanced Electronic Security Co.\n\nPrivate investigator Roger Tolces speaks at the Conspiracy Con, 2009, about the Patriot Act, the NSA, illegal government surveillance, and his experience with clients who report U.S. government electronic harassment via microchip implants and directed energy weapons.\n\n2) Coast to Coast AM - 2011-02-22 - Electronic Harassment &amp; Warfare\n\nDate: 02-22-2011\nHost: George Noory\nGuests: Fred Bell, Mitch Battros\n\nScientist and innovator Dr. Fred Bell discussed reports of electronic harassment and holographic warfare technology. Electronic harassment comes in a variety of forms-- it can be imposed surveillance of people's belongings or surroundings, sabotaging of computers, directed high energy devices, as well as voice/data imaging, in which voices are beamed into a person's head.\n\nThe symptoms of electronic harassment include unusual forgetfulness, suicidal &amp; homicidal thoughts, panic attacks, depression, and paranoia, he detailed. In some cases, he continued, it can include the stoppage of power to appliances, movement of objects that might fall of a shelf and break, and computer failures and problems. One type of attack, he said, is carried out by &quot;confusion weaponry&quot; which uses frequencies or impulses to disrupt thoughts. He cited an LA newscaster who garbled her words in a live report, as possibly being a target of the technology.","torrent":{"xt":"urn:btih:60b960be76f97daaec62d9fa7d4fc3b4bc964857","amp;dn":"Radio+Energy+Weapons+-+Conspiracy+Con+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b960be76f97daaec62d9fa7d4fc3b4bc964857","infoHashBuffer":{"type":"Buffer","data":[96,185,96,190,118,249,125,170,236,98,217,250,125,79,195,180,188,150,72,87]},"announce":[],"urlList":[]}}