{"title":"Rock Star Supernova - Supernova (2006) 320 vtwin88cube","uid":6247779,"size":100302997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61466db46ed2b32986a9ca4a731068b608a983ca&amp;dn=Rock+Star+Supernova+-+Supernova+%282006%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1300292343,"description":"Rock Star Supernova\nSupernova (2006)\n\n\nInstead of finding the lead singer for an existing rock band, which was the goal of the CBS reality TV show Rock Star: INXS, the second season of Rock Star, Rock Star: Supernova, searched for a vocalist to front the supergroup of drummer Tommy Lee, bassist Jason Newsted, and guitarist Gilby Clarke. Beginning in July 2006, the trio auditioned 16 rockers, several of whom had albums of their own under their belts, including Icelandic rocker Magni, alt-rocker Patrice Pike, petite belter Jill Gioia, brooding Ryan Starr, and iconoclastic Zayra Ruleta. In September, Clarke, Newsted, and Lee chose Canadian singer Lukas Rossi as their frontman. Rossi, who had played with the bands Cleavage and Rise Electric before the show, had also worked with producer/Rush guitarist Alex Lifeson and the Philosopher Kings' Jay and John Levine. Rossi also did TV and radio work, with his vocals featured in a national ad campaign for McDonald's and the themes for the animated TV shows Beyblade and Rescue Heroes.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\nSource:\t\t\tWeb\nLabel:\t\t\tSony\n\n\nIn retrospect, it should have been obvious that the prefab supergroup Rock Star Supernova -- originally just &quot;Supernova&quot; before an older band of the same name won its injunction against them, so their name became a clumsy compound of the name of their reality TV show and their chosen name -- would choose wannabe goth superstar Lukas Rossi as their singer. Really, there was no other choice: as good as Storm Large looked naked and as powerful as Dilana was on-stage, there was no way that a group awkwardly led by a disinterested Tommy Lee would choose a female as a singer, and even if Toby Rand had the best original song, he was too much of a party-hearty frat boy to fit in with the rest of the crew (plus, he was Australian and Lee had already gotten enough mileage out of his Crocodile Dundee impression, which started to look a little tacky around the time of Steve Irwin's death, anyway). So, it was down to Rossi, the heavily made-up runt who carried the weight of the world on his shoulders as only a former Hooters line cook could, since he was perhaps the most modern rocker in the lineup. At the very least, with his complicated hair and pancake mascara, he could be mistaken for a Gerard Way wannabe, giving this group of fortysomething rock &amp; rollers at least the faÃƒÂ§ade of appealing to teenagers. But that's just a charade, really: despite a song called &quot;The Dead Parade&quot; -- which just happens to arrive a few weeks after My Chemical Romance's The Black Parade -- there's no modern rock here, but Rock Star Supernova hardly sounds like the heavy work of the drummer from L.A. sleaze-rock legends MÃƒÂ¶tley CrÃƒÂ¼e, Izzy Stradlin's replacement in Guns N' Roses, and the bassist for Metallica. Although Lee's drums thunder as Gilby Clarke eases out bloozy riffs while Jason Newsted pins the whole thing down, this doesn't sound at all like any of their previous music: it sounds like metal guys trying to sound like Cheap Trick covering T. Rex. Which means it sounds a bit like Tiny Music-era Stone Temple Pilots and a whole lot like Enuff Z'Nuff, except fronted by somebody who hasn't heard any of these bands, but has only seen their pictures, since he was too busy listening to all the great rock &amp; rollers that have surfaced since Weiland.\n\n\nTrack List:\n\n01.It's On\n02.Leave The Lights On\n03.Be Yourself (And 5 Other Cliches)\n04.It's All Love\n05.Can't Bring Myself To Light This Fuse\n06.Underdog\n07.Make No Mistake...This Is The Take\n08.Headspin\n09.Valentine\n10.Social Disgrace\n11.The Dead Parade\n\n\n\nCheers!\n","torrent":{"xt":"urn:btih:61466db46ed2b32986a9ca4a731068b608a983ca","amp;dn":"Rock+Star+Supernova+-+Supernova+%282006%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61466db46ed2b32986a9ca4a731068b608a983ca","infoHashBuffer":{"type":"Buffer","data":[97,70,109,180,110,210,179,41,134,169,202,74,115,16,104,182,8,169,131,202]},"announce":[],"urlList":[]}}