{"title":"Coast to Coast AM - 2011-01-24 - Metaphysics and Prophecy","uid":6160875,"size":55484890,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:621111c45f0de967a75d6e325104ea7f412efa83&amp;dn=Coast+to+Coast+AM+-+2011-01-24+-+Metaphysics+and+Prophecy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297208358,"description":"Date: \t01-24-11\nHost: \tGeorge Noory\nGuests: \tGary McDonald, Suzanne Taylor\n\nA licensed counselor trained in past life regression, Gary J. McDonald presented his ideas on spiritual matters in which he has blended new age, religion, and science concepts together, as well as prophecies from the likes of Cayce, Nostradamus, and the Hopi Indians. He believes we are in the midst of 'End Times,' and as the Earth/solar system aligns with a galactic black hole, we could experience a shift of the Earth's axis, leading to devastating tsunamis and quakes. Hopi Elders have predicted that the United States will be destroyed, he added.\n\nMcDonald described undergoing a &quot;spiritual download,&quot; in which he briefly experienced enlightenment and the &quot;universal matrix.&quot; From this knowledge he's concluded there are just 144,000 souls on Earth, and that each living person shares parallel lives via an oversoul with around 45,000 other individuals. He views humankind as fallen angels, and said there are seven heavens, and 12 dimensions, with each dimension a different step in consciousness.\n\nThe Mayan calendar end date actually falls on Saturday, 12-22-2012 rather than Friday, 12-21-12, and this will make it worse because it means we are &quot;transitioning on the Sabbath,&quot; McDonald suggested. Though he conceded that major calamities may not happen in 2012, he foresees that within the next few years 2/3 of the Earth's population will die, but some of this may be averted, including a third World War, if we shift our consciousness.\n\nCrop Circle Update\n\nFirst hour guest, researcher Suzanne Taylor shared updates about crop circles. The recently discovered formation in Indonesia (see article below) contained stunning geometry, and there were reports of a helicopter-like sound in the area during the night it formed, she detailed. During the formation of crop circles in general, there is a sense of air turbulence, animals act disturbed, unusual lights are seen, and the circle patterns are typically created in just six or seven seconds, she reported.\n\nNews segment guest: Catherine Austin Fitts\nWebsite(s):\n\n    * everythingyouneedtoknowtogettoheaven.com\n    * whatonearththemovie.com\n    * theconversation.org\n\nBook(s):\n\n    * Everything You Need to Know to Get to Heaven\n","torrent":{"xt":"urn:btih:621111c45f0de967a75d6e325104ea7f412efa83","amp;dn":"Coast+to+Coast+AM+-+2011-01-24+-+Metaphysics+and+Prophecy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"621111c45f0de967a75d6e325104ea7f412efa83","infoHashBuffer":{"type":"Buffer","data":[98,17,17,196,95,13,233,103,167,93,110,50,81,4,234,127,65,46,250,131]},"announce":[],"urlList":[]}}