{"title":"TsSeduction-------11487- Jessie Cox  Landon Carmen Moore","uid":6171764,"size":498421092,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:633a8c5615b1e03ccd63ea865a01b7b14b9a8859&amp;dn=TsSeduction-------11487-+Jessie+Cox++Landon+Carmen+Moore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1297609494,"description":"From Kink.com    (Ts Seduction)   Sorry no Pics\n\n\n\n\nThe sexy, Carmen Moore, debuts in TsSeduction.com's winter feature update with her gifted cock that just keeps on giving. \n\nCarmen has spent all afternoon Christmas shopping. She's found every perfect gift and is brimming with the holiday spirit. She finally gets back to her car with her parcels and prized gifts only to get confronted by a parking lot mall cop. \nHis aggressive, condescending tone crushes Carmen's joy as he continues to harass her. In a fluster, Carmen agrees to leave but instead of swinging her large packages into her car she accidentally smashes the cop, knocking his head on the open hatch. He falls unconscious into the trunk and Carmen now has a very big problem. In a panic, she shoves him into the trunk, speeds home, and calls her best girlfriend over to help. \nLandon comes to, cuffed to a bed, in a strange home, with two hot girls leaning over him. His last memory is the night before at the club, macking on a hot babe. Could this really be happening? His head hurts but his cock is getting hard and the blurry details are becoming less important as the ladies peel of more of their clothes. \nCarmen fucks Jesse over top Landon who had never seen a strap-on before. At least that's what he thinks is happening. When Jesse pulls off and reveals Carmen's nice, hard cock, he can't believe it. Too late. He is now a holiday feast for the women who are sucking and fucking above him. They use his mouth, his ass and his own hard cock for a night of steaming 3-way, anyway, every way fucking.\n\n\n\n\nScreens &lt;a href=&quot; http://www.tsseduction.com/site/shoot.jsp?shootId=11487&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tsseduction.com/site/shoot.jsp?shootId=11487&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:633a8c5615b1e03ccd63ea865a01b7b14b9a8859","amp;dn":"TsSeduction-------11487-+Jessie+Cox++Landon+Carmen+Moore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"633a8c5615b1e03ccd63ea865a01b7b14b9a8859","infoHashBuffer":{"type":"Buffer","data":[99,58,140,86,21,177,224,60,205,99,234,134,90,1,183,177,75,154,136,89]},"announce":[],"urlList":[]}}