{"title":"Coast to Coast - Apr 07 2011 - Demonology &amp; Ancient Wisdom","uid":6305570,"size":55778219,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:64664768b5d1e100e4fce0d98a3ddd20636fa43e&amp;dn=Coast+to+Coast+-+Apr+07+2011+-+Demonology+%26+Ancient+Wisdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":4,"time":1302317188,"description":"Demonology / Ancient Wisdom\n\nDate: 04-07-11 \nHost: George Noory \nGuests: Peter Canova, Lionel Fanthorpe \n\nIn the first half of the show, author and Anglican Priest, Lionel Fanthorpe, talked about his research into demonology and shadowy deities. The origin of evil may stem from our inherent nature to be free, and thus we have the ability to make choices that are wrong, he explained. He described King Solomon's capturing of 72 powerful demons, including Aini-- a formidable looking being with three-heads-- a serpent, a cat, &amp; a man, Allocen-- a cavalry man with the face of a lion, and Amduscias-- who appears as a unicorn and has abnormal power over music. \n\nRegarding the origin of the supernatural beings known as the jinn, he posited that our distant ancestors may have faced hazardous living conditions in which in order to survive, they learned how to inhabit other dimensions. Fanthorpe also recounted an incident in which he conducted an exorcism after school kids played with a Ouija board, and a faceless creature appeared in their dormitory. \n\n-----------------\n\nIn the second half, Peter Canova, a student of esoteric knowledge for over 30 years, discussed the relationship between ancient wisdom and modern science. He spoke about the ancient mystery schools-- a network of spiritual academies such as the Eleusinian school in Greece, the Pythagorean school in Italy, and the Druidic centers in the British Isles. &quot;The purpose of these schools...was to preserve a sacred wisdom concerning the creation, humanity's origin, and the true nature of reality,&quot; he noted. \n\nCanova compared the ancient spiritual traditions to the new theories of quantum physics. Among the parallels: ancient wisdom said that light is the one energy of the universe and forms existence, quantum physics &amp; relativity say that matter originates as light; ancient wisdom teaches that spirit projects itself into successive levels of consciousness to form the totality of reality, while string theory in physics indicates that parallel dimensions are formed in successive levels. \n\nNews segment guest: Jim Berkland \n\nWebsite(s): \npopeannalisa.com \nlionel-fanthorpe.com \nBook(s): \nPope Annalisa \nSatanism and Demonology \nUnsolved Mysteries of the Sea \n\nmany thanks to my sorce of this show. \n\nthanks for seeding.","torrent":{"xt":"urn:btih:64664768b5d1e100e4fce0d98a3ddd20636fa43e","amp;dn":"Coast+to+Coast+-+Apr+07+2011+-+Demonology+%26+Ancient+Wisdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64664768b5d1e100e4fce0d98a3ddd20636fa43e","infoHashBuffer":{"type":"Buffer","data":[100,102,71,104,181,209,225,0,228,252,224,217,138,61,221,32,99,111,164,62]},"announce":[],"urlList":[]}}