{"title":"Ashampoo Snap 4 v4.3.0 Multilang","uid":6287573,"size":15981410,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:669f2b50cae5e562a92159a5275841eb87e720be&amp;dn=Ashampoo+Snap+4+v4.3.0+Multilang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":-1,"time":1301669744,"description":"With the new Ashampoo Snap 4 you can capture just everything on your screen!\nAshampoo Snap 4 enables you to create high-quality screenshots, videos and demos of your screen content. Edit, save and share your excellent results with others. This new version offers lots of innovative features and improvements, especially in the areas of video capture and editing tools. \n\nThe new video mode\nUse the video mode to create videos and demos tailored to your needs. Capture film sequences or computer games (in a window) and save them as high-quality video files. You can also produce demos like video tutorials for software or presentations of websites. Videos and demos can be saved in different formats using various codecs. New fantastic features, like cursor and zoom effects, are available during video capture. Furthermore a recording can be paused and resumed anytime, in order to, for example, switch between applications or prepare the screen content. Of course, you are not limited to the main screen anymore, because Ashampoo Snap 4 also supports multi-monitor environments. \nEven more editing tools for your screenshots\nCreate perfect-looking screenshots of your entire screen content or specially selected parts. After making a screenshot, an intuitive editor opens automatically and provides you with extensive editing tools, with which you can make your shots even more individual and original. Enhance your screenshots with, for example informative hints, arrows, texts, graphics, shapes, stamps and lots more, in order to convey facts or other topics in your shots easier and more illustrative. \n\nWhether for work, for school or in your spare time - create screenshots and videos in no time and fill your colleagues, classmates or friends with enthusiasm for your amazing results.\n\nFeatures:\n- Video capture for movies \n- Video capture for applications \n- Choose video capture area, add your own voice\n- Use Ashampoo Snap 3 as an editor to open and edit other images and videos\n- Accurate scrolling capture printing\n- Automatic filenames\n- New editing tool for filling areas with color\n- Capture freestyle shapes\n- Unique mouse tools\n- User assistance wizards\n- Multilanguage interface\n\nNew features:\n- All new video capture technique with new effects/options\n- New cursor and zoom effects for video capture\n- Support of more codecs/containers for video encoding\n- Support of multi-monitor environments\n- Pause the video recording\n- Improved highlighting tool (more than one area)\n- Objects, for example arrows, texts, shapes etc., are now editable\n- High-quality objects (anti-aliasing etc.)\n- Support of the Ashampoo Photo Commander format for import and export\n- Stamps and graphics that can be added to screenshots\n- Import/export of the whole application configurations in one INI file\n- Send several screenshots as a single PDF file by e-mail\n\nPage: www.ashampoo.com\nOS: Windows 2000/XP/Vista/7\nInterface: Multilanguage","torrent":{"xt":"urn:btih:669f2b50cae5e562a92159a5275841eb87e720be","amp;dn":"Ashampoo+Snap+4+v4.3.0+Multilang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"669f2b50cae5e562a92159a5275841eb87e720be","infoHashBuffer":{"type":"Buffer","data":[102,159,43,80,202,229,229,98,169,33,89,165,39,88,65,235,135,231,32,190]},"announce":[],"urlList":[]}}