{"title":"HISTORY OF POP AND ROCK MUSIC - part 289","uid":6246217,"size":430379368,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:67d8d83131f2bdba31c099789497f67ec782f516&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+289&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1300240179,"description":"                PART  289\n\n\n        BILL HAYLEY &amp; HIS COMETS  -  See You Later Alligator (1956)\n        BILL HAYLEY &amp; HIS COMETS  -  Rock-a-Beatin' Boogie  (1956)\n        BILL HAYLEY &amp; HIS COMETS  -  Rock  (1956)\n\n\n\n     Bill Haley &amp; His Comets was an American rock and roll band that was founded in 1952 and continued until Haley's death in 1981. The band, also known by the names Bill Haley and The Comets and Bill Haley's Comets (and variations thereof), was the earliest group of white musicians to bring rock and roll to the attention of white America and the rest of the world. From the end of 1954 until the end of 1956 the group would place nine singles into the Top 20, one of those a number one and three more in the Top Ten.\n    &quot;See You Later, Alligator&quot; is the title of an iconic rock and roll song of the 1950s.Originally entitled &quot;Later Alligator&quot;, the song, based on a 12-bar blues chord structure, was written by Louisiana songwriter Robert Charles Guidry and first recorded by him under his professional name &quot;Bobby Charles&quot; in 1955.The most famous recording of the song, however, was that created on December 12, 1955 by Bill Haley &amp; His Comets .Haley's arrangement of the song is faster-paced than Guidry's original, and in particular the addition of a two-four beat changed the song from a rhythm and blues &quot;shuffle&quot; to rock and roll. The song also has a more light-hearted bent than the original, starting out with a high-pitched, child-like voice (belonging to Haley's lead guitarist, Franny Beecher) reciting the title of the song. The ending of the song was virtually identical to the conclusion of Haley's earlier hit, &quot;Shake, Rattle and Roll&quot;.\n It would become Haley's third and final million-selling single, although it did not hit the top of the American record sales charts.","torrent":{"xt":"urn:btih:67d8d83131f2bdba31c099789497f67ec782f516","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+289","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d8d83131f2bdba31c099789497f67ec782f516","infoHashBuffer":{"type":"Buffer","data":[103,216,216,49,49,242,189,186,49,192,153,120,148,151,246,126,199,130,245,22]},"announce":[],"urlList":[]}}