{"title":"Megamind.BRScreener.Castellano.avi","uid":6181345,"size":1322428416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:691df478688e218e7389568f4d216a58832f0591&amp;dn=Megamind.BRScreener.Castellano.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1297965686,"description":"Calidad de video: Blu-Ray Screener\nPeso: 1200 mb\nIdioma del audio: Espanol\n\nMegamind es el supervillano mas brillante que el mundo haya conocido. Y el que menos exito tiene. Durante anos, ha estado intentando conquistar Metro City de cualquier manera que se pueda imaginar. Cada intento, un fracaso, por culpa del superheroe con capa llamado %u201CMetro Man%u201D, un heroe invencible hasta el dia en que Megamind le mata de verdad en el curso de uno de sus malvados y enrevesados planes. De repente, Megamind se queda sin objetivos. Es un supervillano sin un superheroe. Se da cuenta de que haber cumplido el sueno de su vida es lo peor que le ha podido pasar. Megamind decide que la unica forma de salir de su estancamiento es crear un nuevo heroe contrincante llamado %u201CTitan%u201D, que promete ser mas grande, mejor y mas fuerte de lo que Metro Man fue nunca. Rapidamente, Titan empieza a pensar que es mucho mas divertido ser uno de los malos que uno de los buenos. Solo que Titan no quiere conquistar el mundo, quiere destruirlo. Entonces, Megamind tiene que decidirse: Ã‚Â¿podra derrotar a su diabolica creacion? Ã‚Â¿Podra el hombre mas inteligente del mundo tomar una decision inteligente de una vez por todas? Ã‚Â¿Podra el malvado genio convertirse en el insolito heroe de su propia historia? \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:691df478688e218e7389568f4d216a58832f0591","amp;dn":"Megamind.BRScreener.Castellano.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"691df478688e218e7389568f4d216a58832f0591","infoHashBuffer":{"type":"Buffer","data":[105,29,244,120,104,142,33,142,115,137,86,143,77,33,106,88,131,47,5,145]},"announce":[],"urlList":[]}}