{"title":"V DE VENDETTA BY JKRILIN","uid":6230399,"size":1524271104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69e1c35a0a2dbc56f0ce6fe04aa520757aef33ff&amp;dn=V+DE+VENDETTA+BY+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gaditano_cc","files":1,"time":1299690288,"description":"V de Vendetta estÃƒÂ¡ ambientada en un futuro prÃƒÂ³ximo: Inglaterra se ha convertido en un estado totalitario y fascista. La pelÃƒÂ­cula narra la historia de Evey, una joven de la clase trabajadora que es rescatada de una situaciÃƒÂ³n de vida o muerte por un misterioso enmascarado conocido como &quot;V&quot;.\n\nV es un hombre sumamente complejo, instruido, extravagante, tierno e intelectual, que dedica su vida a liberar a los ciudadanos de las garras de aquellos que les someten mediante el terror. Pero al mismo tiempo es amargo, solitario y violento, y estÃƒÂ¡ obsesionado por la venganza personal.\n\nEn su busca por libertar al pueblo de Inglaterra de la corrupciÃƒÂ³n y la crueldad con que su gobierno la ha envenenado, V condenarÃƒÂ¡ el carÃƒÂ¡cter tirÃƒÂ¡nico de sus dirigentes e invitarÃƒÂ¡ a los ciudadanos a unirse a ÃƒÂ©l en las tinieblas del Parlamento el 5 de noviembre: el dÃƒÂ­a de Guy Fawkes.\n\nUn dÃƒÂ­a como ÃƒÂ©se del aÃƒÂ±o 1605 Guy Fawkes fue descubierto en un tÃƒÂºnel bajo el Parlamento con 36 barriles de pÃƒÂ³lvora. En compaÃƒÂ±ÃƒÂ­a de otros conspiradores habÃƒÂ­a planificado lo que mÃƒÂ¡s tarde se conocerÃƒÂ­a como &quot;la conspiraciÃƒÂ³n de la pÃƒÂ³lvora&quot; en reacciÃƒÂ³n a la tiranÃƒÂ­a del gobierno de Jacobo I. Fawkes y el resto de saboteadores fueron ahorcados, destripados y descuartizados, y su plan para derrocar el gobierno jamÃƒÂ¡s llegÃƒÂ³ a perpetrarse.\n\nRetomando el espÃƒÂ­ritu de esa rebeliÃƒÂ³n y como conmemoraciÃƒÂ³n de aquel dÃƒÂ­a, V promete consumar la conspiraciÃƒÂ³n fallida del 5 de noviembre de 1605 por la que Fawkes fue ejecutado: detonar el Parlamento.\n\nCuando Evey descubre la verdad acerca del misterioso pasado de V, tambiÃƒÂ©n descubre su propia verdad, y se convierte en su leal aliada para ejecutar en plan que pretende encender la llama de una revoluciÃƒÂ³n, devolver la libertad y la justicia a una sociedad asfixiada por la crueldad y la corrupciÃƒÂ³n. \n","torrent":{"xt":"urn:btih:69e1c35a0a2dbc56f0ce6fe04aa520757aef33ff","amp;dn":"V+DE+VENDETTA+BY+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69e1c35a0a2dbc56f0ce6fe04aa520757aef33ff","infoHashBuffer":{"type":"Buffer","data":[105,225,195,90,10,45,188,86,240,206,111,224,74,165,32,117,122,239,51,255]},"announce":[],"urlList":[]}}