{"title":"Bob Martin (USA)live in the club the Q-Bus city Leiden holland 2","uid":6283656,"size":464657548,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a23c44f5d282c98f89c5e17b8d48847ec7e13c9&amp;dn=Bob+Martin+%28USA%29live+in+the+club+the+Q-Bus+city+Leiden+holland+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"flipp022","files":15,"time":1301534756,"description":"Bob Martin (USA)live in the club the Q-Bus city Leiden holland 2011-01-18\n\nthis is bob them anniversary day and party, Bob is now 69 year\n\nSinger/ Songwritter\n\ntaped by Ane (flipp022) \n\nAudience recording\n\nrecorder sony pcm-d50(1)\n\nmicrofoon homemade  model 2022 new\n\nflac level&gt; 6\n\nSound edited by Ane (flipp022 \n\nThe sound quality is outstanding\n\nthe sound is very good hifi stereo ++++++++++++++++++++++++++++++\n\n\n\n13 tracks \n\nsetlist\n\n01.Silver rails to rio\n02.intro Jack Kerouac\n03.Two half sisters\n04.Blind Marie\n05.My fater painted houses\n06.American street dream\n07.The old Worthen\n08.Queen of the midget wrestling team\n09.Appalachia lullaby\n10.Sella Kerouac\n11.Fat rat's ass\n12.Let the freedom ring\n13.The river turns the wheel\n\n\nTHANKS eric78 FOR SETLIST\n\nBob Martin was born in Lowell, Massachusetts in 1942. While attending Suffolk University in Boston during the 1960s, he was influenced by the Cambridge folk scene and played at the Nameless Coffeehouse, Club 47 (now Club Passim), and other folk clubs. Emerging from the same New England city as Jack Kerouac, Martin was heavily influenced by the beat poet's writing and career. It was in 1972, fifteen years after Kerouac's On The Road was published, that Bob Martin made his first album Midwest Farm Disaster for RCA Records in Nashville. He worked closely with Chet Atkins, an executive at RCA at the time and many exceptional studio musicians including drummer Kenneth Buttrey, a key player on Bob Dylan's Blonde On Blonde album. Due to personnel changes at the label and the onset of disco, Martin's career was not given priority.\nIn 1974, he &quot;dropped out&quot; of pop culture and moved to a farm in West Virginia with his family. He continued to write songs, poetry, novels and pursued his muse through various artistic endeavors. In 1982, he recorded his second album, Last Chance Rider for June Appal Records of Whitesburg,KY. The record was recognized as one of the top three folk albums in the country by the National Assoc of Independent Record Distributors. Martin however chose to play music on his own terms and didn't pursue the music business as a way of life.\nIt was another ten years, until the release of his third album in 1997. This album, The River Turns the Wheel, hosts backing vocals by Bill Morrissey and Cormac McCarthy and was released on Martin's own label, Riversong Records. This may be considered Bob Martin's most commercially successful album to date. Despite his passivity toward the music biz, &quot;The River Turns The Wheel&quot; was noticed by music critics around the country. The CD reached number sixteen on the Gavin Americana Chart and was chosen one of the top ten albums in 1997 by Brad Kava of The San Jose Mercury News. Dave Perry of The Lowell Sun chose it as the best folk album of 1997 and Tom Flannery of The Electric City News also picked it as the best CD of that year. He toured nationally and opened for Merle Haggard in 1999.\n\nMartin didn't wait quite so long to release his fourth album. &quot;Next To Nothin&quot; was put out on Riversong Records in 2000, and received more rave critical reviews and extensive airplay on Americana radio programs around the country.\n\nIn 2006 Martin completed his first non-fiction book and he continues to perform nationally and internationally.\n\n\n &lt;a href=&quot;\nhttp://www.riversong.com/bio.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.riversong.com/bio.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6a23c44f5d282c98f89c5e17b8d48847ec7e13c9","amp;dn":"Bob+Martin+%28USA%29live+in+the+club+the+Q-Bus+city+Leiden+holland+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a23c44f5d282c98f89c5e17b8d48847ec7e13c9","infoHashBuffer":{"type":"Buffer","data":[106,35,196,79,93,40,44,152,248,156,94,23,184,212,136,71,236,126,19,201]},"announce":[],"urlList":[]}}