{"title":"HABLAME DE AMOR [DVDSCREENER][Xvid][Spanish].avi","uid":6145983,"size":729337856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dc0f8756b3154ab20e557f85eb2dbd74082cd88&amp;dn=HABLAME+DE+AMOR+%5BDVDSCREENER%5D%5BXvid%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1296675745,"description":"Hablame de Amor\n\nCalidad de video: DVD Screener\nPeso: 696 mb\nIdioma del audio: espaÃƒÂ±ol \n\nNarra la historia del nacimiento de Sasha y del renacimiento de Nicole. Es la historia de dos seres humanos que se reconocen inmediatamente, pero que tienen que cumplir todo el trayecto que la vida ha planeado para cada uno de ellos, antes de aceptar los propios sentimientos, antes de encontrarse en igualdad de condiciones, antes de tener el valor de verse reflejados cada uno en el otro. Antes de rendirse y concederse uno a otro. Sasha es un chico de vinticinco aÃƒÂ±os que se asoma timidamente al mundo. Ha crecido en una comunidad para salir de la toxicodependencia, hijo de dos drogadictos: el padre ha muerto pronto, la madre lo ha abandonado en aquel cÃƒÂ­rculo infernal donde Sasha ha encontrado una especie de equilibrio. Lejos de la vida real. Ajeno tambiÃƒÂ©n al mundo en el que ha sido condenado a formarse, el ÃƒÂºnico sano entre los enfermos. Y ahÃƒÂ­, en Borgo Fiorito, ha aprendido a ocuparse del dolor de la gente y se ha encariÃƒÂ±ado con Riccardo - el jefe de la comunidad - como si fuera su verdadero padre. Y, sobretodo, ha conocido a Benedetta, una chiquilla de su edad, hija de un de los bienhechor externo, que cada Domingo va a visitar Borgo Fiorito, llevandole una rÃƒÂ¡faga de ese mundo verdadero que parece que a ÃƒÂ©l se le ha negado. Es inevitable, Sasha se ha enamorado de Benedetta. Ahora que ya es adulto, ha salido por primera vez de la comunidad. EstÃƒÂ¡ dando los primeros pasos en ese mundo que era un reflejo de Benedetta. Y no existe nada mÃƒÂ¡s que ella en sus pensamientos, nada mÃƒÂ¡s reconfortante, familiar. Y Sasha - despuÃƒÂ©s de haber recibido del padre de Benedetta el encargo de restaurar la grande villa de la familia - cree que no puede amar a nadie mÃƒÂ¡s.\n\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:6dc0f8756b3154ab20e557f85eb2dbd74082cd88","amp;dn":"HABLAME+DE+AMOR+%5BDVDSCREENER%5D%5BXvid%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dc0f8756b3154ab20e557f85eb2dbd74082cd88","infoHashBuffer":{"type":"Buffer","data":[109,192,248,117,107,49,84,171,32,229,87,248,94,178,219,215,64,130,205,136]},"announce":[],"urlList":[]}}