{"title":"Catwoman(2004)DVDRip.AC3(ENG)-DROCK","uid":6174974,"size":733882265,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e22dd0bded41e602cff0fffad8b8142261d48cc&amp;dn=Catwoman%282004%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"drock232","files":-1,"time":1297738689,"description":"Patience Philips (Halle Berry) seems destined to spend her life apologizing for taking up space. Despite her artistic ability -- she has a more than respectable career as a graphic designer for Hedare Beauty, a Goliath cosmetics company -- Patience is excruciatingly shy, quick to take blame, and, not surprisingly, more than a little depressed at the end of the day. This comes to somewhat of a screeching halt when Patience not only inadvertently lands herself in the middle of a corporate conspiracy of gargantuan proportions, but on the city police force's most wanted list. Newly quipped with a mysterious feline prowess, Patience is a different person come nighttime -- more accurately, a catwoman. Elusive, untamed, powerful, stealthy, and not necessarily prone to erring on the side of good, Patience has gone from doormat to vigilante. Police officer Tom Lone (Benjamin Bratt), who has fallen for shy Patience, is determined to apprehend Catwoman and figure out her role in a recent crime spree, though his fascination with her doesn't cease with the end of his shift and it threatens to lead to the downfall of himself, his investigation, and the woman who was once the timid Patience Philips.\n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:6e22dd0bded41e602cff0fffad8b8142261d48cc","amp;dn":"Catwoman%282004%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e22dd0bded41e602cff0fffad8b8142261d48cc","infoHashBuffer":{"type":"Buffer","data":[110,34,221,11,222,212,30,96,44,255,15,255,173,139,129,66,38,29,72,204]},"announce":[],"urlList":[]}}