{"title":"coast to coast am. 2011-03-21 - Ancient Cycles &amp; Nibiru","uid":6264108,"size":55860343,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6ee52bf8e67f61839c95fb5a96b746f7de94049b&amp;dn=coast+to+coast+am.+2011-03-21+-+Ancient+Cycles+%26+Nibiru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":5,"time":1300849063,"description":"\n\nAncient Cycles &amp; Nibiru\n-----------------------\nDate: 03-21-2011\nHost: George Noory\n\nGuests: Jason Martell, Joel Skousen\n\n\nAuthor and researcher Jason Martell detailed how many ancient cultures tracked patterns based on reoccurring astronomical cycles, such as the precession of the equinoxes. While this cycle had been calculated to take place over 26,000 years, new research finds that it's more like a 24,000-year span, he reported. &quot;This is interesting to me, because now we have a number that's in alignment with ancient astronaut research,&quot; such as the 12th planet, and the divisional breakdowns of Annunaki teachings to Sumerians, he commented, adding that with this model, each zodiacal age we go through lasts for 2,000 years.\n\nMartell also cited scientific and historical evidence that our sun could be part of a binary system-- two suns that orbit each other and speed up as they get closer, and this could account for the discrepancies in the timing of the precession cycle. The binary solar system model can explain the unusual orbit of Nibiru (the 12th Planet written about in the work of Zecharia Sitchin), where the Annunaki are said to hail from.\n\nAncient cultures recorded astronomical events over thousands of years, and many of their megaliths and structures like Stonehenge and Angkor Wat were anchored or marked to specific movements in the heavens, he noted. Regarding how life first began on our planet, Martell postulated that Nibiru may have collided with a primitive Earth billions of years ago, transferring life from there to here.\n\nAttack on Libya\nFirst hour guest, political scientist Joel Skousen commented on the recent attacks on Libya by the United States and its coalition partners. &quot;It's really a provoked war done under the pretext of humanitarian operations,&quot; he stated, adding that he believes the conflict will lead into a larger war involving Israel, Lebanon, and Iran.\n\n\nWebsites:\nxfacts.com\njoelskousen.com\n\nBooks:\nKnowledge Apocalypse\nStrategic Relocation: North American Guide to Safe Places\n\n","torrent":{"xt":"urn:btih:6ee52bf8e67f61839c95fb5a96b746f7de94049b","amp;dn":"coast+to+coast+am.+2011-03-21+-+Ancient+Cycles+%26+Nibiru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ee52bf8e67f61839c95fb5a96b746f7de94049b","infoHashBuffer":{"type":"Buffer","data":[110,229,43,248,230,127,97,131,156,149,251,90,150,183,70,247,222,148,4,155]},"announce":[],"urlList":[]}}