{"title":"Earthsea (2004), DVDR(xvid), NL Subs, DMT","uid":6193897,"size":1468213530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70da064aa77dcb40ef3e381e374b3aa9cfd004cc&amp;dn=Earthsea+%282004%29%2C+DVDR%28xvid%29%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MeMar","files":-1,"time":1298389318,"description":"Earthsea (2004), DVDR(xvid), NL Subs, DMT\nVerenigde Staten\nFantasy / Drama\n165 minuten (miniserie, 2 delen)\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0407384/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0407384/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/27988&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/27988&lt;/a&gt;\n\ngeregisseerd door Robert Lieberman\nmet Shawn Ashmore, Danny Glover en Isabella Rossellini\n\nIn de magische wereld van Earthsea heeft de vredesamulet eeuwenlang de vrede bewaard tussen de \nmensen en de draken. Maar als de amulet breekt en een stuk ervan verdwijnt, moet een beginnende \ntovenaar het evenwicht weer zien te herstellen en voorkomen dat een boosaardige koning de\n eilanden van Earthsea verovert.\n\nEen onbezonnen jongen is voorbestemd om de grootste tovenaar te worden welke het mythische \nland Earthsea ooit gekend heeft. Wanneer de jonge tovenaar Ged ontdekt dat hij onuitputbare \nmagische krachten bezit doet hij er alles aan om deze krachten te kunnen controleren. In zijn \nzoektocht naar volwassenheid ontmoet hij draken, wordt verliefd en probeert een koninkrijk te \nherenigen.\n\nA reckless youth is destined to become the greatest sorcerer that the mystical land of Earthsea has \never known. When the young wizard Ged discovers that he possesses infinite magical powers, he \nseeks to master the ancient arts. As he journeys to manhood, he will combat dragons, fall in love, \ncross death's threshold, and ultimately wield the power to reunite a kingdom. \n\nIn Earthsea, a world of one thousand and one islands, priestesses leaded by the High Priestess Thar \nlock in the tomb of Atuan the diabolic Nameless Ones. However, the ambitious King Tygath, who \nintends to unite the realm, wants also to release the demons to learn their secret of immortality, and \nuses his mistress Kossil to poison Thar. Kossil expects to be nominated the next guardian and get the \nkeys and enchantment that keeps the darkness forces apart, but Thar selects the pure Tenar. \nMeanwhile, in the island of Gont, the reckless and rebel son of a blacksmith Ged dreams on being a \nwizard. He is sent to the island of Roke to learn magic, but in a dispute with a corrupt mate, he \naccidentally summons a powerful Nameless One that becomes The Gebbeth and wants to devour his \nsoul. Now his only chance to survive is to follow the lead of a dragon and find the two parts of an \namulet to destroy the Nameless Ones. \n\n\nDeze film wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:70da064aa77dcb40ef3e381e374b3aa9cfd004cc","amp;dn":"Earthsea+%282004%29%2C+DVDR%28xvid%29%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70da064aa77dcb40ef3e381e374b3aa9cfd004cc","infoHashBuffer":{"type":"Buffer","data":[112,218,6,74,167,125,203,64,239,62,56,30,55,75,58,169,207,208,4,204]},"announce":[],"urlList":[]}}