{"title":"TRANCE - A State Of Trance 2011 - Previewing CD With Armin van B","uid":6262930,"size":166460464,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70ef7a0785c86abba62d5c1e5e34ec6da28118a0&amp;dn=TRANCE+-+A+State+Of+Trance+2011+-+Previewing+CD+With+Armin+van+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"robynet22","files":2,"time":1300808198,"description":"Take a year out of the life of Armin van Buuren and you'll come to find he's been living more than one at once. Aside of his personal life, the number one DJ spends his time globetrotting, producing and hosting, all in the name of music. 2010 was made up with nothing but highlights, including the release of his 'Mirage' album as the summit of all of his hard work. Along with its release, a new Armin Only world-tour was kicked off, as well as the preparations for the celebration of the 500th episode and 10th birthday of his beloved A State of Trance radio show.\n\nOne of the few constant factors in his roaring life as a superstar DJ and producer, is the weekly 2 hour radio show in which Armin reaches out to the average of 15 million listeners. No matter how many awards, accolades or prestigious gigs the Dutchman got, it never made him lose his love for radio. Ranked number one in the critically acclaimed DJ Mag Top 100 for the fourth year running, as the first DJ ever, Armin van Buuren keeps his fans up to date on the latest in trance and progressive with a relentless passion and energy. Always ahead with exclusives and fresh, unreleased tracks, Armin also presents an A State of Trance compilation, representing a new year in trance on a special 2 disc mix. A yearly highlight to millions of dance lovers, the ASOT compilation series has been going strong since 2004, nominated for and winning many awards ever since.\n\nMonths of preparation passed before Armin van Buuren finally found the perfect balance and track selection for his A State of Trance 2011. Some of its tracks fresh coming straight the studio, like the ones of The Blizzard &amp; Omnia, Mark Otten, Max Graham, Rex Mundi and Orjan Nilsen, or representing the 2011 sound that currently fills the global clubs, by the likes of Mark Eteson, Aly &amp; Fila, Robert Nickson &amp; Thomas Datt, Arty &amp; Mat Zo and Beat Service. 2 discs of 2011 essentials, with the beloved 'On The Beach' and 'In The Club' themes reflecting what will be heard today and tomorrow.\n\nDownload now, and/order the CD!\n\nA State of Trance 2011 will be released March 18th.\n\nDisc 1\n1. Triple A -- Winter Stayed (Armin van Buuren's On the Beach Intro Mix)\n2. The Blizzard &amp; Omnia -- My Inner Island\n3. Mike Shiver vs Matias Lehtola -- Slacker\n4. Dreas vs Alex Robert -- Mormugao (Alex Robert 2011 Mix)\n5. Anhken -- Always Look Back\n6. Nuera -- Green Cape Sunset\n7. Rex Mundi -- Sandstone\n8. Robert Nickson &amp; Thomas Datt -- Godless (Protoculture Remix)\n9. Bobina -- Lamento Sentimental\n10. Mark Otten -- Libertine\n11. Max Graham feat. Neev Kennedy -- So Caught Up\n12. Ashley Wallbridge -- Moonlight Sonata\n13. Beat Service feat. Cathy Burton -- When Tomorrow Never Comes\n14. Arty &amp; Mat Zo -- Rebound\n\nDisc 2\n1. Ron Hagen &amp; Al Exander -- Now Is The Time (Armin van Buuren's Intro Edit)\n2. Super8 &amp; Tab feat. Julie Thompson -- My Enemy (Rank 1 Remix)\n3. Shogun -- Skyfire\n4. John O'Callaghan &amp; Timmy &amp; Tommy -- Talk To Me (ÃƒËœrjan Nilsen Trance Mix)\n5. Armin van Buuren presents Gaia -- Status Excessu D (ASOT 500 Theme)\n6. Mark Eteson -- Blackboard (Jon O'Bir Remix)\n7. Daniel Kandi &amp; Phillip Alpha -- If It Ain't Broke\n8. Andrew Rayel -- Aether\n9. ÃƒËœrjan Nilsen -- Between The Rays\n10. Armin van Buuren feat. Winter Kills -- Take A Moment (Alex M.O.R.P.H. Remix)\n11. Lost World -- Stargazer\n12. Aly &amp; Fila feat. Jwaydan -- We Control The Sunlight\n13. Juventa -- Dionysia\n14. Bjorn Akesson -- Painting Pyramids\n15. Laura Jansen -- Use Somebody (Armin van Buuren Rework)\n\n","torrent":{"xt":"urn:btih:70ef7a0785c86abba62d5c1e5e34ec6da28118a0","amp;dn":"TRANCE+-+A+State+Of+Trance+2011+-+Previewing+CD+With+Armin+van+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ef7a0785c86abba62d5c1e5e34ec6da28118a0","infoHashBuffer":{"type":"Buffer","data":[112,239,122,7,133,200,106,187,166,45,92,30,94,52,236,109,162,129,24,160]},"announce":[],"urlList":[]}}