{"title":"Funkadelic - America Eats Its Young .flac files","uid":6253273,"size":516703513,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:718ac25d0dd4a263b4cb5a5b2fe0931f728bfb61&amp;dn=Funkadelic+-+America+Eats+Its+Young+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ulikes","files":21,"time":1300478500,"description":"Certainly the most unusual Funkadelic album, &quot;America Eats Its Young&quot; sounds little like the band's earlier records and even less like it's later ones. First off, it should be noted that the strongest suit of this album is in the production. It is a beautiful-sounding album, lush and clean with stellar tracking. If you are a fan of sonic achievement, it is worth a listen with a good pair of headphones, it really sounds gorgeous. It needs to be pointed out as well that drummer Tiki Fulwood, bassist Billy Nelson, and ryhtym guitarist Lucien &quot;Tawl&quot; Ross were all gone from the band by this point due mainly to various drug-related issues and in Nelson's case, anger over Clinton's less-than-democratic business practices. Also, Eddie Hazel barely plays on this album as he, too, was running into all sorts of trouble, of both the substance kind and the legal kind. Thus, there is a giant ensemble of various celebrated musicians playing on this record including Bootsy Collins, his brother Catfish, legendary drummer Frankie Waddy and great bassist Prakash John to name but a few of the more notable players. These ace players add a more polished, virtuostic aura to the album. There are some really fine tracks on this one, and the opener (&quot;You hit the Nail on the Head&quot;) is one of them, played beautifully as it churns it's way through several abrupt changes in tempo and feel. The classic track &quot;Loose Booty&quot; (featuring some superb driving bass from Collins, and a stunning exploratory Clavinet solo from Worrell) is a glimpse of the future, complete with what would soon be a George Clinton signature- the dirty nursery rhyme. Bootsy sings (in a much more aggressive mean tone than his more celebrated &quot;Casper&quot; still several years away) two rock 'n' roll tinged rave-ups, the riotous and groovin' &quot;Philmore&quot; and the somewhat less successful &quot;Balance&quot;. Bernie Worrell stretches out a bit as both keyboardist and arranger on the somewhat dated, but still wonderful &quot;A Joyful Process&quot;. &quot;Biological Speculation&quot; is also a terrific song, well sung and well played. Some tracks have great potential but for one reason or another just miss the mark. &quot;Everybody's Going to Make It This Time&quot; is a lovely song, with a lush arrangement and a gorgeous chorus but it is marred by Clinton's careless and poor lead vocal. The song could have been a classic ballad if it had been sung by Gary Shider or perhaps Calvin Simon. The track &quot;We Hurt Too&quot; features singing so comically bad, that I am unsure of wether or not it was intended to be comedy. If it was, then &quot;A+&quot; but if the intention was sincere, then it is embarrassing. The same applies to &quot;That was my girl&quot; which also suffers from a lead vocal so terribly delivered that it seems inconceivable that it was laid down in earnest. This is by no means a great record but it is interesting and there are several wonderful tracks. I would say this one should be left only to those who have a keen interest in Funkadelic. \n\nIf you are a Funkadelic fan book mark my list as i will be at some point adding every ablum along with some related side efforts by George Clinton.\n\nOf course this is in the .flac format to catch every sound.\n\nMp3 is dead! Long live Flac!!!\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:718ac25d0dd4a263b4cb5a5b2fe0931f728bfb61","amp;dn":"Funkadelic+-+America+Eats+Its+Young+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"718ac25d0dd4a263b4cb5a5b2fe0931f728bfb61","infoHashBuffer":{"type":"Buffer","data":[113,138,194,93,13,212,162,99,180,203,90,91,47,224,147,31,114,139,251,97]},"announce":[],"urlList":[]}}