{"title":"Coast to Coast AM - 2011.02.26 - Growing Your Own Food","uid":6207414,"size":56628421,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:71a2c2975b90d2e9cbcecc34d797805c385afc06&amp;dn=Coast+to+Coast+AM+-+2011.02.26+-+Growing+Your+Own+Food&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pegasus77","files":5,"time":1298858238,"description":"Growing Your Own Food\n\nDate: 02-26-11\nHost: Ian Punnett\nGuests: Marjory Wildcraft, Cy Curnin\n\nNationally recognized expert in backyard food production, Marjory Wildcraft talked about why she believes the cost of groceries will likely double in 2011, and what people can do to prepare for it. Wildcraft identified four factors driving up food prices: weather, oil costs, government interference, and commodity traders. Weather and oil costs are perhaps the most significant, she said, noting that the right climatic conditions are required to grow food and every aspect of its commercial production involves the use of petroleum. Higher grocery bills may be only the beginning, however, as Wildcraft sees an impending collapse of the systems most of us depend on for food and water. To hedge against this possibility, she recommended people learn how to produce their own food.\n\nThings to look for when setting up a 'backyard farm' include consistent water supply, fertile soil, and a local community of like-minded individuals, Wildcraft explained. The amount of land one devotes to farming can be as little as 4,000 square feet (not including paths, etc) or as much as two acres, she continued. Making a place for livestock is especially imperative. Animals are a good source of protein and their waste can be used to fertilize crops, Wildcraft pointed out, adding that her family raises chickens for eggs and rabbits for meat. Wildcraft also covered barrelponics, gun ownership, health care considerations of self-sustaining farming communities, as well as how such places might be governed should our centralized system break down.\n\nIn the first hour, Ian was joined by Cy Curnin, lead singer of The Fixx. Curnin briefly discussed the band's music, including songs &quot;One Thing Leads To Another&quot; and &quot;Saved By Zero&quot;, noting the former was inspired by a lying politician and the latter by The Experience of Nothingness. He spoke about his life in France, where he operates a self-sustaining farm and inn with his wife, as well as his support of the cancer charity, Love Hope Strength Foundation. Curnin also announced an upcoming US concert appearance.","torrent":{"xt":"urn:btih:71a2c2975b90d2e9cbcecc34d797805c385afc06","amp;dn":"Coast+to+Coast+AM+-+2011.02.26+-+Growing+Your+Own+Food","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71a2c2975b90d2e9cbcecc34d797805c385afc06","infoHashBuffer":{"type":"Buffer","data":[113,162,194,151,91,144,210,233,203,206,204,52,215,151,128,92,56,90,252,6]},"announce":[],"urlList":[]}}