{"title":"HÃƒÂ¦vnen AKA In a Better World (2010)(NTSC)Audio 3)NL SUBS TBS","uid":6226218,"size":6665371888,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:72244795de744d130d80dc1b69cce84a69f7d666&amp;dn=H%C3%83%C2%A6vnen+AKA+In+a+Better+World+%282010%29%28NTSC%29Audio+3%29NL+SUBS+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1299520653,"description":"HÃƒÂ¦vnen (2010) \nAlternatieve titels: In a Better World, Revenge, Civilization \n\n\nVanaf 7 april in de bioscoop\n\n\nDenemarken / Zweden\nDrama\n119 minuten\n\ngeregisseerd door Susanne Bier\nmet Mikael Persbrandt, Trine Dyrholm en Ulrich Thomsen\n\nAnton is een dokter die op en neer reist tussen een idyllisch dorpje in Denemarken en zijn werk in een Afrikaans vluchtelingenkamp. In deze twee totaal verschillende werelden worden hij en zijn familie geconfronteerd met conflicten die hen dwingen de moeilijke keuze te maken tussen wraak of vergeving. Anton en zijn vrouw Marianne, die twee jonge zonen hebben, zijn uit elkaar maar worstelen met de mogelijkheid om te scheiden. Hun oudste zoon, de 10-jarige Elias, wordt op school gepest. Hier komt verandering in wanneer Christiaan, een net verhuisde klasgenoot uit Londen, het voor hem opneemt. De moeder van Christiaan is overleden aan kanker en hij heeft moeite dit verlies te verwerken. Al snel worden Elias en Christian hechte vrienden, maar wanneer Elias door Christian wordt betrokken bij een gevaarlijke wraakactie met tragische consequenties, wordt hun vriendschap op de proef gesteld en zijn hun levens in gevaar.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/66829&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/66829&lt;/a&gt;\n\nEnglish\n\nStoryline\nAnton is a doctor who commutes between his home in an idyllic town in Denmark, and his work at an African refugee camp. In these two very different worlds, he and his family are faced with conflicts that lead them to difficult choices between revenge and forgiveness. Anton and his wife Marianne, who have two young sons, are separated and struggling with the possibility of divorce. Their older, ten-year-old son Elias is being bullied at school, until he is defended by Christian, a new boy who has just moved from London with his father, Claus. Christian\\'s mother recently lost her battle with cancer, and Christian is greatly troubled by her death. Elias and Christian quickly form a strong bond, but when Christian involves Elias in a dangerous act of revenge with potentially tragic consequences, their friendship is tested and lives are put in danger. Ultimately, it is their parents who are left to help them come to terms with the complexity of human emotions, pain and empathy.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1340107/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1340107/&lt;/a&gt;\n\nINFO\nBron........: Retail\nFormaat.....: DVD9\nAudio.......: Deens, Zweeds Engels\nAudio.......: DD5.1\nSubs........: Nederlands ( Custom by Lonya)\nCover ......: Yes\n\nTBS\n\n","torrent":{"xt":"urn:btih:72244795de744d130d80dc1b69cce84a69f7d666","amp;dn":"H%C3%83%C2%A6vnen+AKA+In+a+Better+World+%282010%29%28NTSC%29Audio+3%29NL+SUBS+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72244795de744d130d80dc1b69cce84a69f7d666","infoHashBuffer":{"type":"Buffer","data":[114,36,71,149,222,116,77,19,13,128,220,27,105,204,232,74,105,247,214,102]},"announce":[],"urlList":[]}}