{"title":"COAST TO COAST AM. 2011-03-20 - Military Contractors &amp; Belief Sy","uid":6261136,"size":56358028,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:746aee9d1515e727c68a9080c31ea9d0ef49f03f&amp;dn=COAST+TO+COAST+AM.+2011-03-20+-+Military+Contractors+%26+Belief+Sy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1300760355,"description":"\n\nMilitary Contractors &amp; Belief Systems\n-------------------------------------\nDate: 03-20-2011\nHost: George Knapp\n\nGuests: William Hartung, Rahasya Poe\n\n\nIn the first half, George Knapp welcomed William Hartung of the New America Foundation, for a discussion on how defense contractor Lockheed Martin has wielded inordinate power and shaped US foreign policy for decades. While Lockheed has given the US military great technology like the stealth planes, at some point it took a wrong turn and became a &quot;money pit,&quot; --more concerned with &quot;lobbying for government contracts than really producing weapons to the characteristics that the government needed,&quot; he explained. \n\nFor example, when Lockheed was lobbying Congress for the F-22 Raptor (the most costly fighter plane ever built), they advertised that certain states would lose thousands of jobs if the deal didn't go through. Congress ends up &quot;defending more of a parochial pork barrel interest than a national defense interest,&quot; Hartung commented. Defense spending, he noted, is actually one of the least effective ways to create jobs, with fields such as education and mass transit adding about two times as many jobs per billion spent compared to defense. \n\n------------------------------ \n\nIn the latter half, author Rahasya Poe talked about the consequences of maintaining beliefs that are out of touch with reality, and today's scientific knowledge. Citing a quote by Voltaire: &quot;If they can make you believe absurdities they can make you commit atrocities,&quot; he argued that many current religious and political premises limit people's thoughts, and make them susceptible to behaviors they wouldn't normally engage in. Religious fundamentalist extremists are &quot;drunk with beliefs,&quot; and actually suffer from a kind of brain damage, with synaptic connections atrophying, he suggested. \n\nInstead of following belief systems, Poe advocated using meditation to discover experiential truths. &quot;You don't really do meditation. Meditation is something that happens when all of the doing stops. And then you drop into this no mind...[and experience] a consciousness that is totally transcendent of the level we're normally at,&quot; he mused. \n\n\nWebsites: &lt;a href=&quot;\nhttp://newamerica.net/user/22&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://newamerica.net/user/22&lt;/a&gt;\nrahasyapoe.com\n\nBooks:\nProphets of War\nTo Believe or Not To Believe\n\n","torrent":{"xt":"urn:btih:746aee9d1515e727c68a9080c31ea9d0ef49f03f","amp;dn":"COAST+TO+COAST+AM.+2011-03-20+-+Military+Contractors+%26+Belief+Sy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746aee9d1515e727c68a9080c31ea9d0ef49f03f","infoHashBuffer":{"type":"Buffer","data":[116,106,238,157,21,21,231,39,198,138,144,128,195,30,169,208,239,73,240,63]},"announce":[],"urlList":[]}}