{"title":"Rumpole's Last Case - John Mortimer","uid":6206356,"size":178809479,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:759484e01cb0b6576ebada0e1d950c556696fbe8&amp;dn=Rumpole%5C%27s+Last+Case+-+John+Mortimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":15,"time":1298821985,"description":"Unabridged and read by Bill Wallis. 8 hours 15 mins duration. Cassettes. (48 kbps / 44 kHz Mono, Fraunhofer CBR )\n\n \n[1987]\n1. Rumpole and the Blind Tasting\nRumpole is invited to an elegant blind wine tasting. Being used to nothing better that Chateau Thames Embankment, Rumpole becomes an enthusiastic but unorthodox participant in the tasting. The tasting leads to a case, and the case leads Rumpole to uncover some lowbrow goings-on in the highbrow world of fine wines.\n\n2. Rumpole and the Old, Old Story\nIn &quot;The Old, Old Story,&quot; Rumpole embarrasses She-Who-Must-Be-Obeyed. She harasses Rumpole, and Rumpole leaves home. While the course of love runs not so true at Casa Rumpole, Horace gets an out-of-town case defending the odd man out in a lover's triangle. Things are looking rather bleak for the client, and Rumpole is not encouraged when he enters court for the first day of the trial and finds She-Who-Must-Be-Obeyed sitting on the bench as a guest of the presiding judge!\n\n3. Rumpole and the Official Secret\nRumpole defends Rosemary Tuttle, an employee of the Ministry of Defense who is charged with a breach of the Official Secrets Act specifically, releasing documents outlining the amounts spent by the Department on biscuits and tea. Rumpole is all set to base his defense on the silliness of the situation, but his client insists that she is innocent. \n\n4. Rumpole and the Judge's Elbow\nAfter Judge Guthrie Featherstone injures his elbow playing tennis, his clerk recommends a female relative who is a masseuse specializing in massage therapy. After receiving the necessary treatment, he pays by credit card, but soon regrets it after he learns that a string of massage parlors have been closed down on morals charges. \n\n5. Rumpole and the Bright Seraphim\nRumpole finds himself on a British army base in Germany defending a trooper who is charged with murdering his sergeant who was found dead outside a local bar and dressed as a woman. He's welcomed with open arms by the regiment's senior officers who expect the trooper to be found innocent, thus preserving the honour of the regiment. He finds any number of possible solutions to the crime and an overly eager legal officer. \n\n6. Rumpole's Last Case\nTwo of the Timsons are apprehended in a robbery and accused of assaulting a victim with a gun although none of this family of petty thieves has ever been known to carry a weapon. Portia defends one of the cousins and Rumpole the other before the notoriously difficult Judge Bullington. After Rumpole's client, Dennis Timson, introduces Rumpole to an exotic horse racing wager called a &quot;four horse accumulator,&quot; the barrister has visions of retiring to the Seychelles Islands if his long shot pays off. Since this is his last case he decides to take on the Mad Bull with full force. It's left to Phyllida Erskine-Brown to smooth the judge's feathers, which proves to be quite helpful when collecting his winnings becomes a bit of a problem.\n\nBill Wallis' narration is wonderful as usual.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:759484e01cb0b6576ebada0e1d950c556696fbe8","amp;dn":"Rumpole%5C%27s+Last+Case+-+John+Mortimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"759484e01cb0b6576ebada0e1d950c556696fbe8","infoHashBuffer":{"type":"Buffer","data":[117,148,132,224,28,176,182,87,110,186,218,14,29,149,12,85,102,150,251,232]},"announce":[],"urlList":[]}}