{"title":"15 Exciting Flash Games {krzzy}","uid":6289984,"size":10549761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7610f851b273cafa196c334f9374955b499a97f9&amp;dn=15+Exciting+Flash+Games+%7Bkrzzy%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"krzzy","files":15,"time":1301763844,"description":"This torrent contains 15 exciting Flash Games which are of total fun.\n\nThe games are :\n\n1. Alcohol - Shooting an apple off the head of a alcoholic person with the help of different weapons.\n\n2. Cable Capers - Help Arnold the Cable Fitter to escape from the underground by overcoming many obstacles.\n\n3. Canyon Glider - Collecting points by flying amidst a desert with the help of a glider.\n*HINT - Keep pressing the left and right arrow keys alternatively to take off.\n\n4. Copter - Guiding a Helicopter by clicking the mouse.\n\n5. Eye Test - Locating an unique tablet among two other tablets.\n\n6. Monkey Lander - Help a Monkey in a ship to collect points in the form of bananas, watermelons etc.\n\n7. NPower Test Series - Playing Cricket with 10 wickets in hand and the bowler bowling you for 12 overs. You can only be the batsman and score runs with the help of either the mouse or keyboard.\n\n8. Pacman - Playing the eternal game in a modern style.\n\n9. Panik - Helping Panik to save Chocoland from the Evil Red Guy.\n\n10. Reel Gold - Gathering gold with the help of a trolley in a limited time.\n\n11. Sheepish - Helping sheeps to cross a busy road.\n\n12. Stan Skates - Help Stan to jump over obstacles by a skateboard.\n\n13. Starship Eleven - Move through the space and do many interesting things.\n\n14. Table Tennis - Play Table Tennis against the AI with the help of mouse.\n\n15. UFO-JOE - Help Joe to reach his home, his own planet with the help of his spaceship.\n\nEnjoy this incredible games by just double clicking...\n\n\nPlease Seed and leave a Comment....","torrent":{"xt":"urn:btih:7610f851b273cafa196c334f9374955b499a97f9","amp;dn":"15+Exciting+Flash+Games+%7Bkrzzy%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7610f851b273cafa196c334f9374955b499a97f9","infoHashBuffer":{"type":"Buffer","data":[118,16,248,81,178,115,202,250,25,108,51,79,147,116,149,91,73,154,151,249]},"announce":[],"urlList":[]}}