{"title":"Flikken Seizoen 2 dvd 2 (Dutch) TBS","uid":6243036,"size":4522267247,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:76b9a07dfcc88571266d46b3325cc1e4c3d1328a&amp;dn=Flikken+Seizoen+2+dvd+2+%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1300137015,"description":"\n\n\nFlikken Seizoen 2 dvd 2\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n17 &quot;Kind van de rekening&quot; 5 november 2000 2.04 \nEen kind wordt de dupe van ruziÃƒÂ«nde ouders. De ouders zijn gescheiden. De moeder weigert haar kind aan de vader af te staan. De hele situatie loopt uit de hand.  \n\n18 &quot;Hold-up&quot; 12 november 2000 2.05 \nTony raakt haar dienstwapen kwijt. In het centrum vindt een overal plaats op een veilinghuis. Hierbij blijkt het wapen van Tony gebruikt te zijn.  \n\n19 &quot;Steen des aanstoots&quot; 19 november 2000 2.06 \nEen dode Pakistaanse vrouw wordt gevonden. Het wordt een lastige zaak waarin de westerse cultuur in botsing komt met de Pakistaanse. Tony en Britt hebben er een zware dobber aan, maar weten het op te lossen.  \n\n20 &quot;Moordschuld&quot; 26 november 2000 2.07 \nEr wordt ingebroken bij een plantenkweker. Tegelijkertijd zijn er ook de Gentse FloraliÃƒÂ«n waar de kweker bij aanwezig wil zijn. Door de inbraak komt er lelijk de klad in zijn plannen voor deelname.  \n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : ISO \nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:76b9a07dfcc88571266d46b3325cc1e4c3d1328a","amp;dn":"Flikken+Seizoen+2+dvd+2+%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b9a07dfcc88571266d46b3325cc1e4c3d1328a","infoHashBuffer":{"type":"Buffer","data":[118,185,160,125,252,200,133,113,38,109,70,179,50,92,193,228,195,209,50,138]},"announce":[],"urlList":[]}}