{"title":"HISTORY OF POP AND ROCK MUSIC - part 293","uid":6305418,"size":501561616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:77288e5b0e70a08fb5ed399b445c4ff8625abcd4&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+293&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1302308857,"description":"   \n                    PART  293\n\n\n               BEE GEES - Lonely days  (1970)\n               MUNGO JERRY - In the Summertime  (2nd version) (1970)\n               CHRISTIE  - San Bernardino  (1970)  \n               DAVE EDMUNDS  -  I Hear You Knocking  (1971)\n               MUNGO JERRY - Alright,Alright,Alright  (1973)\n\n\n\n           \n    &quot;Lonely Days&quot; is a 1970 song by the Bee Gees, featured on their album &quot;2 Years On&quot;. It was their first Top Five hit in the US, peaking at number three in the Billboard Hot 100 and reaching number one on the Cashbox and Record World charts.\n    &quot;In the Summertime&quot; is a song recorded in 1970 by the British band Mungo Jerry. Written by the group's leader Ray Dorset, this song, which celebrates the carefree days of summer, reached the Number 1 position on charts around the world (including seven weeks in the UK), Number 1 for 2 weeks in Canada, and Number 3 on the Billboard Hot 100 singles chart in the US. It is considered one of the highest selling singles of all time with an estimated 5-10 million copies sold. It was also the year-end top seller of 1970 in the UK singles chart.\n    &quot;San Bernadino&quot; is a 1970 pop song by Christie, a UK pop band who had found success with their #1 hit single &quot;Yellow River&quot; which was #1 in other countries including France and Italy. &quot;San Bernadino&quot; was a moderate success, not as successful as their hit debut. It reached #1 in Germany and reached #7 in the UK. It only managed to reach #100 in the US and remained on the chart for 10 weeks. It did moderately well in other countries including a #10 in Italy and #15 in Spain.\n    &quot;I Hear You Knocking&quot; is a popular rhythm and blues song written by Dave Bartholomew and Pearl King and published in 1955. The original recording was made by Smiley Lewis, reaching #2 on the Billboard R&amp;B singles chart. The song was popularized in 1955 in a cover version by Gale Storm.A later recording by Welsh band Dave Edmunds Rockpile reached #4 on the Billboard charts in 1971, and in the UK it took the coveted Christmas number one slot in 1970, topping the UK singles chart for six weeks. \n    Mungo Jerry's hits continued through to 1976 with &quot;Open Up&quot; (Top Twenty in Europe); &quot;Alright Alright Alright&quot; (major hit worldwide reaching the Top 3 in the UK); &quot;Wild Love&quot;; &quot;Long Legged Woman Dressed in Black&quot;; &quot;Hello Nadine&quot; (European hit and Top Five in Canada); and &quot;It's a Secret&quot; (European hit). No chart hit has had more than 13 words in the title, so &quot;You Don't Have to be in The Army To Fight in The War&quot; gave Mungo Jerry one more little souvenir of their hit-making days.\n\n\nFrom Wikipedia, the free encyclopedia\n","torrent":{"xt":"urn:btih:77288e5b0e70a08fb5ed399b445c4ff8625abcd4","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+293","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77288e5b0e70a08fb5ed399b445c4ff8625abcd4","infoHashBuffer":{"type":"Buffer","data":[119,40,142,91,14,112,160,143,181,237,57,155,68,92,79,248,98,90,188,212]},"announce":[],"urlList":[]}}