{"title":"UK Rock 2011 -Vol 38- Abril","uid":6296368,"size":109874435,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77647f825aff1f1c3021afa097e734d8b26a972d&amp;dn=UK+Rock+2011+-Vol+38-+Abril&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geloso","files":-1,"time":1302009130,"description":"Uk Rock Vol. 38 - Abril 2011\n\nEste compilado es realizado con la finalidad de difundir grupos y solistas britÃƒÂ¡nicos alrededor de todo el mundo.\n\nEn www.ukrock.com.ar encontrarÃƒÂ¡s las biografÃƒÂ­as y discografÃƒÂ­as de los grupos contenidos en este volumen.\n\nUK Rock.\n\n+ info en: &lt;a href=&quot;\nhttp://www.ukrock.com.ar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ukrock.com.ar&lt;/a&gt; &lt;a href=&quot;\nhttp://www.lastfm.es/group/Uk+Rock+Group&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lastfm.es/group/Uk+Rock+Group&lt;/a&gt;\n\nArtista: V.A.\nAlbum: UK Rock - Vol. 38\nCDs: 1\nBitrate: 192 Kbps\nTamaÃƒÂ±o de Archivo: 103 MB\n\nTemas:\n\n01. The View - Grace\nirresistible adelanto del tercer disco de los escoceses &quot;Bread And Circuses&quot;.\nirresistible advance of the third album of Scots &quot;Bread And Circuses. &quot;\n\n02. Brother - Still Here\nnuevo single de uno de los hypes de este aÃƒÂ±o, a la espera de su debut previsto para Julio.\nnew single from one of the hypes of this year, pending its debut scheduled for Julio.\n\n03. The Crookes - Godless Girl\nlos de Sheffield y otro corte de su flamante debut &quot;Chasing After Ghosts&quot;.\nthe Sheffield and another cut of his new debut &quot;Chasing After Ghosts. &quot;\n\n04. Flashguns - Passions Of A Different Kind\notro corte del trÃƒÂ­o londinense que presentamos en un lejano British ADN nÃ‚Âº 5.\nanother cut of the London trio presented in a distant No. 5 British DNA.\n\n05. Wild Beasts - Albatross\nadelanto desde &quot;Smother&quot;, nuevo disco del cuarteto de Kendal previsto para Mayo.\nadvance from &quot;Smother, &quot; quartet's new album scheduled for May Kendal.\n\n06. Alex Turner - Piledriver Waltz\ntema incluÃƒÂ­do en el soundtrack de &quot;Submarine&quot;, ÃƒÂ³pera prima de Richard Ayoade (el hilarante Maurice Moss de The IT Crowd).\nitem included in the soundtrack of &quot;Submarine&quot;, the debut of Richard Ayoade (Maurice Moss from the hilarious The IT Crowd).\n\n07. Richard Ashcroft - Future's Bright\notra banda sonora! ahora de &quot;The Adjustment Bureau&quot;, film de acciÃƒÂ³n protagonizado por Emily Blunt y Matt Damon.\nanother soundtrack! now &quot;The Adjustment Bureau&quot;, action film starring Emily Blunt and Matt Damon.\n\n08. Toploader - Never Stop Wondering\n&quot;Only Human&quot; marca el regreso del efÃƒÂ­mero cuarteto que lograra triunfar con el cover &quot;Dancing In The Moonlight&quot; en 2000.\n&quot;Only Human&quot; marks the return of the quartet which achieved fleeting success with the cover &quot;Dancing In The Moonlight&quot;in 2000.\n\n09. Thirteen Senses - Home\nsegundo single desde &quot;Crystal Sounds&quot;, tercer ÃƒÂ¡lbum del cuarteto de Cornwall.\nsecond single from &quot;Crystal Sounds&quot;, the third album of the quartet of Cornwall.\n\n10. Blackfield - Waving\nadelanto desde &quot;Welcome To My DNA&quot;, 2Ã‚Âº nuevo disco del proyecto de Steven Wilson (Porcupine Tree) y el israelÃƒÂ­ Aviv Geffen.\nadvance from &quot;Welcome To My DNA ', 2 draft new album Steven Wilson (Porcupine Tree) and Israeli Aviv Geffen.\n\n11. Elbow - Open Arms\nmi querido Guy Garvey y el 2Ã‚Âº sencillo desde &quot;Build A Rocket Boys!&quot;.\nmy dear Guy Garvey and 2 Ã‚Âº single from &quot;Build A Rocket Boys!&quot;.\n\n12. Gomez - Options\nadelanto desde &quot;Whatever's On Your Mind&quot;, 7Ã‚Âº disco de los provenientes de Southport.\nadvance from &quot;Whatever's On Your Mind&quot;, 7, the disk from Southport.\n\n13. Detroit Social Club - I Am Revolution\nen una bella declaraciÃƒÂ³n de principios el quinteto abriÃƒÂ³ su propio sello, Fuck Pop Records, con este single.\nin a beautiful statement of principles the quintet opened his own label, Fuck Pop Records, with this single.\n\n14. The Kills - DNA\nextraÃƒÂ­do desde su 4Ã‚Âº disco &quot;Blood Pressures&quot; y regalado a sus fans como forma de promociÃƒÂ³n.\nremoved from his 4 th album &quot;Blood Pressure &quot; and given his fans as a form of promotion.\n\n15. Yuck - Get Away\nlos ex-Cajun Dance Party, Daniel Blumberg y Max Bloom, y el nuevo single de su nueva agrupaciÃƒÂ³n.\nex-Cajun Dance Party, Daniel Blumberg, Max Bloom, and the new single from his new band.\n\n16. Fight Like Apes - Jenny Kelly\nsegundo single de los irlandeses desde su disco &quot;The Body Of Christ And The Legs Of Tina Turner&quot;.\nIrish second single from his album &quot;The Body Of Christ And The Legs Of Tina Turner. &quot;\n\n17. The Chapman Family - Anxiety\nel denso cuarteto de Stockton-on-Tees y un nuevo sencillo desde su debut &quot;Burn Your Town&quot;.\nthe dense quartet Stockton-on-Tees and a new single from their debut &quot;Burn Your Town. &quot;\n\n18. Mazes - Most Days\nsingle extraÃƒÂ­do de &quot;A Thousand Heys&quot;, debut de los mancunianos.\nsingle from &quot;A Thousand Heys, Manchester's debut.\n\n19. Art Brut - Lost Weekend\nel quinteto liderado por Eddie Argos y el primer corte desde su 4Ã‚Âº disco &quot;Brilliant! Tragic!&quot;.\nthe quintet led by Eddie Argos and the first single from his 4th album &quot;Brilliant! &quot; Tragic! &quot;.\n\n20. Miles Kane - Rearrange\nlas 2 mitades de The Last Shadow Puppets presentes! nuevo single desde su debut &quot;Colour Of The Trap&quot;.\nthe 2 halves of The Last Shadow Puppets present! new single from their debut &quot;Colour Of The Trap&quot;.\n\n21. The High Llamas - Fly Baby, Fly\ndesde &quot;Talahomi Way&quot;, 9Ã‚Âº disco del legendario grupo liderado por Sean O'Hagan.\nfrom &quot;Talahomi Way&quot;, 9 th album from the legendary group led by Sean O'Hagan.\n\nPortada: Video Killed The Radio Star de RunWhiteRabbit design by Montaje En Linea\n\nPor favor compartir.\nLamentablemente me veo en la necesidad de dejar de servir los torrents de los recopilatorios anteriores.\nComo minimo los mantengo hasta un ratio de 10 o mas (He enviado 10 veces el tamaÃƒÂ±o del torrent).\nPero como la gente los borra, no hay semillas y yo solo no puedo mantener los mÃƒÂ¡s de 80 torrents que he colgado,\nde los cuales, por cierto no he recibido ni un solo agradecimiento.\nSi estais interesados en la pÃƒÂ¡gina de Uk Rock, previo registro y posteo, estÃƒÂ¡n todos los enlaces o los podeis\nbuscar con el emule.\n\nPlease share.\nUnfortunately I feel the need to stop serving the torrents of the previous compilations.\nAs I keep to a minimum ratio of 10 or more (I've sent 10 times the size of the torrent).\nBut as people delete them, no seeds and I just I can not hold more than 80 torrents that I hung,\nwhich, of course I have not received a single thank you.\nIf you are interested in Rock Uk page upon registration and posting are all the links or you can\nseek with the emule.\n","torrent":{"xt":"urn:btih:77647f825aff1f1c3021afa097e734d8b26a972d","amp;dn":"UK+Rock+2011+-Vol+38-+Abril","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77647f825aff1f1c3021afa097e734d8b26a972d","infoHashBuffer":{"type":"Buffer","data":[119,100,127,130,90,255,31,28,48,33,175,160,151,231,52,216,178,106,151,45]},"announce":[],"urlList":[]}}