{"title":"Funkadelic Maggot Brain .flac files","uid":6225059,"size":281737936,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79b08f12c926c49f2d22938046892c29d81fc007&amp;dn=Funkadelic+Maggot+Brain+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ulikes","files":12,"time":1299484521,"description":"&quot;Mother Earth is pregnant for the third time, cause y'all have knocked her up. I have tasted the maggots in the mind of the universe...I was not offended, for I knew I had to rise above it all, or drown in my own s**t.&quot;\n\nThough this DEFINITELY makes no sense at all, it sets the scene for some more experimental, revolutionary music from George Clinton and Funkadelic. Perhaps one of the darker albums of the early 1970s, Maggot Brain is a successful experiment and a tremendous success for Funkadelic's 3rd album.\n\nMoving beyond the very freaky acid psychedelia of their first two albums, Funkadelic moved into a newer and eclectic sound; a mixture of harsh rock 'n' roll, psychadelic music, soul music, gospel choirs, and even more. Maggot Brain effectively managed to fuse all of these together.\n\nThe first song is worth the entire album, earning it the 5 star award: considered by many to be the greatest guitar solo ever, the late Eddie Hazel's &quot;Maggot Brain&quot; is a depressing, bluesy, acid trip that was recorded in one take. All it took was George Clinton telling Eddie to &quot;play like your mother just died,&quot; and Maggot Brain thus was born. The song opens with a dreary guitar backdrop and &quot;echoing&quot; drums that mysteriously fade out once Hazel gets into the solo; reportedly, this is because Clinton found that they &quot;sucked&quot; in comparison to Hazel's improvisation. The song progressively gets more and more intense, until it peaks at the middle; but at the end it gets as intense as before. Unlike many other solos out there, Maggot Brain succeeds at having both an immensely skillful player and the perfect instrumentation. Rarely, if not never, does P-Funk play a concert without Maggot Brain; it is one of their hallmark songs. If I haven't convinced you yet, the ten minutes of Maggot Brain are not worth missing AT ALL.\n\nThe next song, the happier and gospel &quot;Can You Get to That,&quot; is another great one. It serves almost as an &quot;upper&quot; from the depressing Maggot Brain, but is a fine song on its own.\n\nBernie Worrell's &quot;Hit It and Quit It&quot; features his expert keyboard skills, and---surprise surprise---another sublime guitar solo from Eddie Hazel in the middle.\n\n&quot;You and Your Folks&quot; gave birth to the popular &quot;yeah, yeah, yeah!&quot; chant at Funkadelic concerts. While the song on the album itself is a little flat, the lyrics are wonderful. The song itself is a wonderful experience when played live.\n\n&quot;Super Stupid&quot;, a hardcore precursor of much heavy metal (in 1971!) is fun and ear-busting. Even if the lyrics aren't much, the instrumentation alone is worth the price of admission.\n\n&quot;Back in Our Minds&quot; isn't much worth writing home about.\n\n&quot;Wars of Armageddon&quot; closes the album, another masterpiece; but this one is designed to freak people out. Apparently Funkadelic got a hold of a sound effects tape, and went crazy with it; this song features a destructive guitar riff, and with the added sound effects you'd swear this song was the end of the world. Farts, laugh tracks, men and women screaming, etc...it sounds like the nation's fallen apart. And in 1971, still the race riot era, this did hold somewhat true.\n\nThe files are in the .flac format so you get every sound. Record these to a CD and you won't be able to tell the difference between my CD and yours. The original artwork is included.\n\nMp3 is dead! Long live Flac!!!\n\nPlease seed!!","torrent":{"xt":"urn:btih:79b08f12c926c49f2d22938046892c29d81fc007","amp;dn":"Funkadelic+Maggot+Brain+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79b08f12c926c49f2d22938046892c29d81fc007","infoHashBuffer":{"type":"Buffer","data":[121,176,143,18,201,38,196,159,45,34,147,128,70,137,44,41,216,31,192,7]},"announce":[],"urlList":[]}}