{"title":"coast to coast 2011-03-14 - Heaven &amp; Earth","uid":6244853,"size":55080183,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7a43981dca5bd1c4691ff7985705b63384afa463&amp;dn=coast+to+coast+2011-03-14+-+Heaven+%26+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":6,"time":1300202165,"description":"\n\nHeaven &amp; Earth\n--------------\nDate: 03-14-2011\nHost: George Noory\n\nGuests: Kevin Malarkey, J. Marvin Herndon\n\n\nIn the first half of the show Kevin Malarkey shared extraordinary reports from his son, Alex, about his meetings with Jesus, angels, and visits to heaven, after the boy was paralyzed in a horrific car accident in 2004, at the age of 6. Alex suffered from &quot;internal decapitation&quot; right after the accident, yet described seeing the rescue from above, including his father being pulled from the wreckage by a group of angels, whom he said looked like &quot;professional wrestlers with wings.&quot;\n\nHe went through a tunnel, heard &quot;awful&quot; sounding harp music, and ended up in a conversation with God. &quot;Daddy, I hope you're not mad at me, because I love you and I love Mommy, but I asked God if I could stay,&quot; Alex recounted to his father. Malarkey said his son was sent back to do work as a missionary, which he believes is already taking place through the worldwide dissemination of their book, The boy who came back from heaven.\n\n----------------------------\n\nIn the second half of the show, physicist and chemist Dr. Marvin Herndon warned of the dangers of a geomagnetic reversal, and also offered analysis of the post-tsunami nuclear disaster in Japan. Rather than eliminating nuclear power, he argued that smaller nuclear reactors be adopted. One company, Hyperion Power, is making reactors about the size of a hot tub that each service about 20,000 homes. They have built-in safety features such as shutting down when they get too hot, he added.\n\nA magnetic reversal, brought on by solar activity, can take place in as little as a month or a year, because the Earth's geo-reactor has such a small mass, said Herndon. &quot;When the geomagnetic field collapses, what will happen is that vast segments of the population will be without electricity,&quot; and this will have devastating consequences because civilization has become so dependent on technology, he noted. With that in mind, he suggested that efforts be made to strengthen the current infrastructure, such as by using shielded fiber optics, which are insulated from charged particles.\n\nNews segment guests: Scott Portzline, Dr. Robin Falkov\n\n\nWebsites:\ntheboywhocamebackfromheaven.com\nnuclearplanet.com\n\nBooks:\nThe Boy Who Came Back from Heaven\nMaverick's Earth and Universe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7a43981dca5bd1c4691ff7985705b63384afa463","amp;dn":"coast+to+coast+2011-03-14+-+Heaven+%26+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a43981dca5bd1c4691ff7985705b63384afa463","infoHashBuffer":{"type":"Buffer","data":[122,67,152,29,202,91,209,196,105,31,247,152,87,5,182,51,132,175,164,99]},"announce":[],"urlList":[]}}