{"title":"The Who - Another Tricky Day [promo] (PCM+AC3).VOB","uid":6220493,"size":309321728,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7bb7fe44ecffe0fd081dae3c6bab419641e4a917&amp;dn=The+Who+-+Another+Tricky+Day+%5Bpromo%5D+%28PCM%2BAC3%29.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1299311625,"description":"The Who - Another Tricky Day [promo] (PCM+AC3).VOB\n\n\nHQ very rare promo music video with untouched LPCM &amp; AC3 6ch audio from promo DVD. &quot;Another Tricky Day&quot; is a song from Face Dances, the ninth album by the English rock band the Who. It was originally released in 1981 in the US on Warner Bros. Records and on Polydor Records in the UK. It was the first full new album the Who made with drummer Kenney Jones as a replacement for Keith Moon, and their first for Warner Bros.\n \nAlthough some jeered at the album, Roger Daltrey went on record saying he liked this album in a 1994 interview. Some critics, notably in the Boston Globe in a review in April 1981, said it was the Who's best album since 1973's Quadrophenia.\n \nThe album peaked at number 4 on the Billboard album charts (the chart topper was Styx's Paradise Theatre) and number 2 on the British album charts.\n \nThe album cover features paintings of the members by many British painters, who were commissioned by Peter Blake, who had previously designed the cover of The Beatles' Sgt. Pepper's Lonely Hearts Club Band album. Artists include Tom Phillips, Richard Hamilton, Allen Jones, David Hockney, Clive Barker, R. B. Kitaj, Howard Hodgkin, Patrick Caulfield, and Peter Blake himself.\n \nIn 1997, the album was re-released by MCA Records with three outtakes as well as two live tracks. The live track &quot;How Can You Do It Alone&quot; is an edited version of the live performance.\n\n&quot;Another Tricky Day&quot; was performed live first before 1981. Townshend introduced some lyrics of the song during a jam of &quot;Dance It Away&quot; in Los Angeles on the 1980 tour. 1981 performances of this song featured a lengthy jam at its conclusion, and these versions could reach as long as 8 minutes. In 2002, this song was brought back for the North American tour as a tribute to recently deceased bassist John Entwistle, who died right before the start of the tour. The song was played a few more times in 2004 as well.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Face_Dances&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Face_Dances&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/fAEObaaDd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/fAEObaaDd&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video : MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio1: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Audio2: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Duration: 00:04:40\n\n\n*To change the audio in &quot;Media Player Classic&quot;, just go to &quot;Navigate&quot; then &quot;Audio Language&quot; and choose between the 2 sources* (there's a delay that happens while the audio is switching between the two sources)\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011!\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:7bb7fe44ecffe0fd081dae3c6bab419641e4a917","amp;dn":"The+Who+-+Another+Tricky+Day+%5Bpromo%5D+%28PCM%2BAC3%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb7fe44ecffe0fd081dae3c6bab419641e4a917","infoHashBuffer":{"type":"Buffer","data":[123,183,254,68,236,255,224,253,8,29,174,60,107,171,65,150,65,228,169,23]},"announce":[],"urlList":[]}}