{"title":"Aurora - Metaphysics EP","uid":6279902,"size":25031429,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d3c76cb1f723c46c7446e4537f2684c88ff48cd&amp;dn=Aurora+-+Metaphysics+EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cool_Story_Bro","files":4,"time":1301395565,"description":"Aurora was started in January 2010 and have been keeping it under the radar since then. They were offered an opening spot on Rock the Blocks Warped Tour pit stop in June which would\\'ve been their first show; but things happen for a reason and line up changes occurred. The bass player at the time got an opportunity to tour and play with Molotov Solution which led him to leave the band. As well as the rest of the guys wanting to part ways with an old vocalist because of differences.\nAurora caught the attention of the owner of Sumerian Records and had the guys come out to Los Angeles for a showcase in front of label reps. This only motivated the band even more to work harder and finish the lineup so they could start building a fan base and illuminate people on what Aurora is trying to accomplish with their music. And with Billy Kostelich joining in November, their line up is complete. Now they are spending their time writing and perfecting everything so people can see their full potential; its an experience waiting to be discovered.","torrent":{"xt":"urn:btih:7d3c76cb1f723c46c7446e4537f2684c88ff48cd","amp;dn":"Aurora+-+Metaphysics+EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d3c76cb1f723c46c7446e4537f2684c88ff48cd","infoHashBuffer":{"type":"Buffer","data":[125,60,118,203,31,114,60,70,199,68,110,69,55,242,104,76,136,255,72,205]},"announce":[],"urlList":[]}}