{"title":"The Town (2010) [BDRemux 1080p H264][DTS-HD-AC3]","uid":6132091,"size":17461527506,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7fd09262ae9aef8feb4f3cb9c358ebe48b80a805&amp;dn=The+Town+%282010%29+%5BBDRemux+1080p+H264%5D%5BDTS-HD-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":1,"time":1296164169,"description":"The Town (2010) [BDRemux 1080p H264][DTS-HD-AC3]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0840361/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0840361/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thetown-es.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetown-es.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.amazon.com/Town-Extended-Cut-Blu-ray/dp/B002ZG99NG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Town-Extended-Cut-Blu-ray/dp/B002ZG99NG&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/the-town-2201.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/the-town-2201.html&lt;/a&gt;\n\n===========\n::English::\n===========\nTitle: The Town. City of Thieves\nOriginal title: The Town\nCountry: USA\nUSA release: 17/09/2010\nReleased in Spain: 29/10/2010\nStudio: Warner Bros. Pictures\nDirector: Ben Affleck\nScreenplay: Ben Affleck, Peter Craig, Chuck Hogan\nStarring: Ben Affleck, Jon Hamm, Rebecca Hall, Jeremy Renner, Chris Cooper, Blake Lively, Nicholas Cairis, Ed O'Keefe, Pete Postlethwaite.\nRating: Not recommended for children under 16 years\n\nSynopsis:\nIn Boston there are more than 300 burglaries each year. And an area of 1,600 square kilometers called Charlestown has been more armored car thieves than any other place banks U.S.\n\nOne of them is Doug Macray (Ben Affleck), but is not made from the same cloth as their colleagues in crime. Unlike them, Doug has had a chance to succeed, an opportunity to prevent crime in the footsteps of his father. Instead, he became the leader of a group of ruthless bank robbers who take pride in what they want to catch it cleanly. The only family he has Doug is that of his criminal associates, especially Jem (Jeremy Renner), who, despite dangerous and irritable temperament, is the closest thing to a brother Doug has ever had.\n\nHowever, everything has changed since the last work of the band, when Jem was a hostage for a short time, the director of the state, Claire Keesey (Rebecca Hall). When he discovers that lives in Charlestown, Jem gets nervous and wants to see what he has seen. Because he knows what he is capable Jem, Doug is responsible for the problem. Look for Claire, who has no idea that there is a chance meeting and that such charming stranger is one of the men who had terrorized her only a few days.\n\nAs his relationship with Claire is evolving into a passionate romance, Doug wants to change their lives and city. But with the Feds, led by Frawley agent (Jon Hamm), Jem his heels and questioning his loyalty, Doug realizes that is not going to be easy to accomplish and that worse still, you can put Claire danger. All the possibilities that could have at any time are now reduced to a choice: to betray their friends or lose the woman he loves.\n\nProduction notes:\nBased on the novel 'The Prince of Thieves' by Chuck Hogan.\n\n================\nFormat: Matroska\nResolution: 1920 x 1080\nFormat profile: H264\nOverall bit rate: 18.7 Mbps\nAudio 1: English DTS-HD MA 1.5 1536 Kbps\nAudio 2: AC3 448 Kbps French\nAudio 3: AC3 448 Kbps Deutsch\nAudio 4: Italian AC3 448 Kbps\nAudio 5: Spanish, Castilian AC3 640 Kbps\nSubs: English, Spanish, French, Italian and Deutsch (German)\n============================================================\n\n===========\n::Spanish::\n===========\nTÃƒÂ­tulo: The Town. Ciudad de ladrones\nTÃƒÂ­tulo original: The Town\nPaÃƒÂ­s: USA\nEstreno en USA: 17/09/2010\nEstreno en EspaÃƒÂ±a: 29/10/2010\nProductora: Warner Bros. Pictures\nDirector: Ben Affleck\nGuiÃƒÂ³n: Ben Affleck, Peter Craig, Chuck Hogan\nReparto: Ben Affleck, Jon Hamm, Rebecca Hall, Jeremy Renner, Chris Cooper, Blake Lively, Nicholas Cairis, Ed O'Keefe, Pete Postlethwaite.\nCalificaciÃƒÂ³n: No recomendada para menores de 16 aÃƒÂ±os\n\nSinopsis:\nEn Boston se producen mÃƒÂ¡s de 300 robos cada aÃƒÂ±o. Y un barrio de 1.600 kilÃƒÂ³metros cuadrados llamado Charlestown ha dado mÃƒÂ¡s ladrones de vehÃƒÂ­culos blindados y bancos que ningÃƒÂºn otro lugar de EE.UU.\n\nUno de ellos es Doug MacRay (Ben Affleck), aunque no estÃƒÂ¡ hecho de la misma pasta que sus colegas en el crimen. A diferencia de ellos, Doug ha tenido una oportunidad de tener ÃƒÂ©xito, una oportunidad para evitar seguir las huellas criminales de su padre. En lugar de ello, se convirtiÃƒÂ³ en el lÃƒÂ­der de un grupo de implacables ladrones de bancos que se enorgullecen de coger lo que quieren de forma limpia. La ÃƒÂºnica familia que tiene Doug es la de sus socios criminales, especialmente Jem (Jeremy Renner), quien, a pesar de su temperamento peligroso e irritable, es lo mÃƒÂ¡s parecido a un hermano que Doug haya tenido nunca.\n\nSin embargo, todo ha cambiado desde el ÃƒÂºltimo trabajo de la banda, cuando Jem hizo un rehÃƒÂ©n por un breve espacio de tiempo: la directora de la entidad, Claire Keesey (Rebecca Hall). Cuando descubre que vive en Charlestown, Jem se pone nervioso y quiere comprobar quÃƒÂ© es lo que ha visto. Puesto que sabe de lo que es capaz Jem, Doug se encarga del problema. Busca a Claire, que no tiene ni idea de que no se trata de un encuentro casual ni de que ese encantador extraÃƒÂ±o es uno de los hombres que la habÃƒÂ­an aterrorizado hacÃƒÂ­a tan sÃƒÂ³lo unos dÃƒÂ­as.\n\nA medida que su relaciÃƒÂ³n con Claire va evolucionando hasta convertirse en un apasionado romance, Doug quiere cambiar de vida y de ciudad. Pero con los Federales, liderados por el agente Frawley (Jon Hamm), pisÃƒÂ¡ndole los talones y Jem cuestionando su lealtad, Doug se da cuenta de que no le va a resultar fÃƒÂ¡cil lograrlo y de que, lo que es peor aÃƒÂºn, puede poner en peligro a Claire. Todas las posibilidades que hubiera podido tener en cualquier momento quedan reducidas ahora a una decisiÃƒÂ³n: delatar a sus amigos o perder a la mujer que ama.\n\nNotas de ProducciÃƒÂ³n:\nBasada en la novela 'The Prince of Thieves', de Chuck Hogan. \n\n==================\nFormato: Matroska\nResolucion: 1920 x 1080p\nFormat profile: H264\nOverall bit rate: 18.7 Mbps\nAudio 1: InglÃƒÂ©s DTS-HD MA 5.1 1536 Kbps\nAudio 2: FrancÃƒÂ©s AC3 448 Kbps\nAudio 3: Deutsch AC3 448 Kbps\nAudio 4: Italiano AC3 448 Kbps\nAudio 5: EspaÃƒÂ±ol; Castellano AC3 640 Kbps\nSubs: EspaÃƒÂ±ol, InglÃƒÂ©s, FrancÃƒÂ©s, Italiano y Deutsch (AlemÃƒÂ¡n)\n============================================================\n","torrent":{"xt":"urn:btih:7fd09262ae9aef8feb4f3cb9c358ebe48b80a805","amp;dn":"The+Town+%282010%29+%5BBDRemux+1080p+H264%5D%5BDTS-HD-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd09262ae9aef8feb4f3cb9c358ebe48b80a805","infoHashBuffer":{"type":"Buffer","data":[127,208,146,98,174,154,239,143,235,79,60,185,195,88,235,228,139,128,168,5]},"announce":[],"urlList":[]}}