{"title":"(Blues) Mojo Stu - Good Gravy","uid":6171731,"size":98742673,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:813c64d5eb608ec366b4f617229ac2aa6c207cea&amp;dn=%28Blues%29+Mojo+Stu+-+Good+Gravy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1297607609,"description":"Time: 40:42 \nSize: 94.1 MB \nLabel: Mudbone\nStyles: Acoustic blues\nYear: 2000 \nBitrate: 320K/s\nArt: Front \n\n[4:45] 1. Working With My Baby\n[3:20] 2. It's All Good\n[3:20] 3. Leave That Good Gal Here\n[2:43] 4. Philly Rag\n[4:42] 5. Woke Up With The Blues\n[3:33] 6. I'll Be Your Man\n[4:43] 7. My Baby\n[2:08] 8. Poor Lonely Man\n[3:11] 9. Bad Luck Woman\n[3:09] 10. Good Gravy\n[5:04] 11. Mudbone Waltz\n\n\nDepending on the artist, the blues can be either elaborate or minimalist. Some bluesmen go for large bands and full horn sections; they put a lot of time and effort into their arrangements. Others, however, are happy accompanying themselves, and Mojo Stu obviously falls into the second category. On Good Gravy, the rugged, whiskey-voiced singer has no band. It's just Stu and his acoustic guitar -- no drums, no bass -- and that minimalist approach serves him well on intimate, rural-style offerings like &quot;Leave That Good Gal Here,&quot; &quot;Poor Lonely Man,&quot; and &quot;Woke Up With the Blues.&quot; Although Good Gravy was recorded in Springfield, PA, this CD doesn't have a Northern blues outlook. Good Gravy is very much an album of acoustic, Southern-minded country blues, and Stu shows himself to be an appealing slide guitarist throughout the album. While most of the songs have vocals, Stu also provides a few instrumentals -- which is a good thing because it is nice to hear him really stretch out on the acoustic guitar. Some artists would be at a disadvantage if they had to accompany themselves, but for Stu, minimalism is advantageous. Many of the great country bluesmen who came out of the Deep South and Texas in the '20s, '30s, and '40s often accompanied themselves, and those are the sort of artists Stu obviously identifies with. By CD standards, Good Gravy is skimpy; it only lasts about 40 minutes. But while the album is short on quantity, it isn't lacking when it comes to quality. Although far from groundbreaking, Good Gravy is a satisfying effort that will appeal to die-hard country blues enthusiasts... \n\n\nso download it now you bastards...i'm going for a wank over rita hayworth...\n","torrent":{"xt":"urn:btih:813c64d5eb608ec366b4f617229ac2aa6c207cea","amp;dn":"%28Blues%29+Mojo+Stu+-+Good+Gravy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"813c64d5eb608ec366b4f617229ac2aa6c207cea","infoHashBuffer":{"type":"Buffer","data":[129,60,100,213,235,96,142,195,102,180,246,23,34,154,194,170,108,32,124,234]},"announce":[],"urlList":[]}}