{"title":"Blade(1998)DVDRip.AC3(ENG)-DROCK","uid":6138244,"size":736362496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:819dcbcc72754c5786e481b93debe2d61064db78&amp;dn=Blade%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1296396621,"description":"British director Stephen Norrington helmed this David S. Goyer adaptation of the Marvel Comics character created in 1973 by scripter Marv Wolfman and artist Gene Colan. In the Tomb of Dracula comic book origin, just before Blade's mother gave birth to Blade, she was bitten by a vampire, which made Blade immune to vampires. Now a vampire hunter, Blade, joined by vampire detective Hannibal King and Dracula-descendent Frank Drake, stalks vampires. In the 1990s (in Marvel's Nightstalkers), Blade teamed with Drake and King in an agency created to fight a variety of supernatural beings. The Marvel origin is retold in this 1998 Norrington film, with Blade's mother dying as he is born. Thirty-some years later, Blade now exists somewhere between the two worlds, not human but not fully vampire. He has become a relentless and superhuman vampire hunter, out to avenge the death of his mother and protect the rest of humankind from the evil vampire race. In this pursuit, Blade storms a notorious vampire nightclub and in a virtual bloodbath manages to wipe out most of the blood-lusting denizens. But the burnt corpse of vampire Quinn (Donal Logue) is reanimated at the hospital morgue and bites hematologist Karen Jenson (N'Bushe Wright). Blade magically appears at the hospital just in time to whisk Karen to his hideaway, a machine-shop run by his mentor Abraham Whistler (Kris Kristofferson), who once rescued Blade and who now produces a antidote to keep Blade from turning into a full-fledged vampire and who builds custom weapons for Blade to use against his evil foes. Meanwhile, Blade's vampire arch-nemesis Deacon Frost (Stephen Dorff) uses computers to translate the Book of Erebus, with the ultimate aim of bringing down the old-guard vampire council, headed by Dragonetti (Udo Kier), and triggering the Blood Tide -- an event in which everyone in the world becomes a vampire.\n\nRipped with Handbrake","torrent":{"xt":"urn:btih:819dcbcc72754c5786e481b93debe2d61064db78","amp;dn":"Blade%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"819dcbcc72754c5786e481b93debe2d61064db78","infoHashBuffer":{"type":"Buffer","data":[129,157,203,204,114,117,76,87,134,228,129,185,61,235,226,214,16,100,219,120]},"announce":[],"urlList":[]}}