{"title":"Pet Sematary 2 (1992) DVDR PAL","uid":6273014,"size":4680828928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:85026a2d1db7bcea2dc99c86e8ad2132d708077a&amp;dn=Pet+Sematary+2+%281992%29+DVDR+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gunnsalius","files":-1,"time":1301151426,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0105128/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0105128/&lt;/a&gt;\n\n After his actress mother Renee Hallow is electrocuted to death before his eyes on the set of a movie she was shooting, Jeff Matthews and his veterinarian father Chase decide to move from Los Angeles to Renee\\'s hometown of Ludlow, Maine - the town that houses the \\&quot;pet sematary\\&quot; - to live in the family\\'s summer house so Jeff \\&quot;can get away from the craziness of Hollywood,\\&quot; according to Chase. Chase also hires a housekeeper, Marjorie Hargrove, who is a huge fan of Renee. There, Jeff has trouble fitting in at school, being tormented by school bully Clyde Parker for his mother\\'s celebrity status, plus he can\\'t stand Marjorie and her obsession with his mother and sometimes feels she\\'s trying to replace her. He manages to befriend fellow outsider Drew Gilbert, the stepson of the town\\'s sheriff Gus Gilbert, who was an ex-boyfriend of Renee. Gus runs the house he shares with Drew and his mother Amanda much like a jail, and Drew gets abused physically and verbally by Gus whenever Gus feels Drew is \\&quot;breaking the laws\\&quot; of the house while Amanda stands by and does practically nothing to defend her son from him. One night, Gus catches Drew\\'s dog Zowie messing around his rabbit hutch for the umpteenth time, and then murders Zowie in cold blood. The next day, Drew decides to bury his dog not in the pet sematary, but in the cursed Micmac burial ground that lies beyond the pet sematary, his actions fueled by the stories of Louis Creed and Jud Crandall burying pets and people up there that came back to life. Jeff goes along with him to help with the burial. Zowie comes back, but he\\'s definitely not the same dog that he was before he was killed, possessing a very malevolent demeanor that is evident by his eyes, which now glowed an eerie yellow. Gus grounds Drew thinking that he lied when he said the reason he missed school that day was so he could bury his dog. Not long after, on Halloween, Drew sneaks out to meet up with Jeff, Clyde, and a few others at the pet sematary to tell bonfire stories, but Gus learns of where Drew is at from Amanda and crashes the get-together. Angry that Drew \\&quot;broke the law,\\&quot; Gus starts beating him, but before Gus can really hurt Drew, Zowie emerges and violently kills Gus. Terrified about Gus\\' death, Jeff and Drew decide to take him up to the burial ground to try and resurrect him so no one would think he was ever dead. It works, but it is then that all hell breaks loose. Pretty soon, Jeff starts to wonder if maybe he should use the sinister power of the burial ground to bring his mother back to life.....\n\nAudio: English, French, German, Italian, Spanish.\nSubs.: English, Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, Finnish, French,\n       German, Greek, Hebrew, Hungarian, Icelandic, Italian, Norwegian, Polish,\n       Portuguese, Romanian, Slovenian, Spanish, Swedish, Turkish.\n\nPlease seed after downloading...","torrent":{"xt":"urn:btih:85026a2d1db7bcea2dc99c86e8ad2132d708077a","amp;dn":"Pet+Sematary+2+%281992%29+DVDR+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85026a2d1db7bcea2dc99c86e8ad2132d708077a","infoHashBuffer":{"type":"Buffer","data":[133,2,106,45,29,183,188,234,45,201,156,134,232,173,33,50,215,8,7,122]},"announce":[],"urlList":[]}}