{"title":"PC-CodeName OUTBREAK  (Original Release) + NOCDcrack","uid":6139466,"size":1461282807,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:858470ca944e00981cb1638ff37dec189d698091&amp;dn=PC-CodeName+OUTBREAK++%28Original+Release%29+%2B+NOCDcrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xcheekyleex","files":11,"time":1296440193,"description":"CodeName OutBreak  4 PC (Original Release) + NOCDcrack\n\n\nThis Is A CD Image File Of The Game..\n\nI Ws Unable To Create An .ISO Image File Of This Game Usin My Usual Software,Hweva Using Power2Go I Ws Able To Create A .P2i Image File,Ive Also Encluded An .IMG Image File Created Usin CloneCD.\n\nYou Will Need Daemon Tools,Nero,Power2Go,Cyberlink DVD Suite Or Other Mountin/DVD/CD Burning Software To Mount/Extract &amp; Burn The OUTBREAK.img/OUTBREAK.P2i Image Files Contents Back To CD.\n\nRun The Setup/Install File As Usual Once Mounted Or CD/DVD Created.\n\nAfta Install Is Complete &amp; B4 U Run D Game 4D 1st Time Extract The CO-NOCD.EXE File Frm The codenameoutbreak-nocd-1_0-ENG.ZIP File To Your Installed Outbreak Game Directory,Run The Extracted File &amp; Hit The Crack Button...\nyou've now cracked the game!\n\n\nThe game takes place on Earth in the not-so-distant future. A passing meteor shower has peppered the planet with a mysterious alien life-form that,when hatched,attaches itself onto the back of people's necks and takes control of them.\nIf that sounds like the plot of every corny Hollywood movie that involves mysterious alien life-forms,that's because it pretty much is. You assume the role of a leader of a small band of military operatives who've been tasked with the duty of cleaning up this infestation. This plot progresses through uninspired cutscenes that involve little more than a floating camera that pans around your characters as you receive your mission briefing,although there are two high-quality prerendered scenes that play at the beginning and at the end of the game,respectively.\n\nBefore jumping into each mission, you have the option of choosing to play as any two of your six initial operatives,each of whom has different ratings for characteristics that include speed,reaction time,stamina,and maximum health. You can even outfit your party with one of several suits of armor. These have an additional effect on your overall physical attributes,since each suit will affect your running speed and has varying bonuses for protection against different types of weapons. However,in practice you'll be hard pressed to note any real difference between any of the armor or soldier attributes. In between each mission you can also select the types of weapons tat your two characters will carry onto the field. It's interesting to note that while there are eight weapon types in the game including sniper rifles,lasers,and shotguns,there are only a handful of physical weapons to choose from. In what's probably a first in the genre,Codename: Outbreak's different weapons actually share the same 3D model,but they have a rotating barrel to accommodate the different munitions. So one weapon might have the capabilities of a shotgun,a submachine gun,and a sniper rifle,while another will have a grenade launcher,a shotgun,and a flare dispenser. It's a novel idea,but it's hardly believable,as it's hard to imagine a single weapon that can be used,for instance,as a mine layer and a laser. Also,the fact that many of the weapons overlap in some of their capabilities will probably leave you a little bit confused. \n\nNjoy.\n\n\nxcheekyleex\ntHeRiPpEr\n\n\nRequires Windows 9x,XP,ME","torrent":{"xt":"urn:btih:858470ca944e00981cb1638ff37dec189d698091","amp;dn":"PC-CodeName+OUTBREAK++%28Original+Release%29+%2B+NOCDcrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858470ca944e00981cb1638ff37dec189d698091","infoHashBuffer":{"type":"Buffer","data":[133,132,112,202,148,78,0,152,28,177,99,143,243,125,236,24,157,105,128,145]},"announce":[],"urlList":[]}}