{"title":"Democracy Now - 10 mar 2011","uid":6233071,"size":454478538,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:88078c2e5fadeb545028a886f0d78311922ac8cf&amp;dn=Democracy+Now+-+10+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1299775155,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 10, 2011\n\n- Thousands Protest as Wisconsin GOP Advances Anti-Union Bill in State Senate\n- Clashes Continue in Libya; Toll for East Estimated at 400\n- BBC News Crew Detained, Beaten by Libyan Forces\n- Egyptian Protesters Attacked; El Baradei Explores Presidential Bid\n- Yemeni President Proposes Referendum on New Constitution\n- Dalai Lama Steps Down as Tibet's Political Leader\n- Illinois Abolishes Death Penalty\n- NPR CEO Resigns Over Video Controversy\n- Loughner Pleads Not Guilty, Hearing Set for May\n- Two-Thirds of States Have Cut Mental Health Services\n- Former U.S. Soldier Charged in Failed MLK Day Bombing\n- House Panel Orders Legal Defense of DOMA\n- Robert Scheer, City Limits Named Izzy Award Recipients\n\n\nSpecial reports\n\n- Outrage in Wisconsin: Thousands Flood Capitol After GOP Strips Public Workers of Bargaining Rights in Surprise Senate Vote\n\nThousands of demonstrators flooded the Wisconsin State Capitol building last night after Republican senators took a surprise vote to strip most public employee workers of their right to collectively bargain. The bill could be made law if the Assembly votes today. The state Senate has been at a standstill since all 14 Democratic members fled the Wisconsin to prevent quorum. But on Wednesday, Republicans advanced the measure by stripping it of fiscal measures requiring a 20-member quorum for action. We speak to graduate student organizer Peter Rickman and State Democratic Sen. Chris Larson, who remains in Illinois.\n\n\n- &quot;This is a Class War&quot;: Michael Moore Calls For Renewed Pro-Democracy Movement as Anti-Union Bills Approved in Wisconsin and Michigan\n\nAs Wisconsin Republicans passed Gov. Scott Walker's anti-union bill in the state Senate, a bill in Michigan goes even further. In the measure, emergency financial managers would be allowed to break union contracts, dismiss elected officials, and even disincorporate entire municipalities. Michigan Senate Republicans approved the bill yesterday, and protests are expected in the Lansing state Capitol building today. We speak to filmmaker Michael Moore. &quot;&quot;[This] is a class war on the people,&quot; Moore says. &quot;I think the whole world has been inspired by what happened in Tunisia and Egypt and throughout the Middle East. While their problems are different than ours, the spirit is the same. We need a pro-democracy movement in this country, badly.&quot;\n\n\n- &quot;We Have Reached a Turning Point&quot;: Journalist Frank Emspak Says Protests Will Grow in Response to WI Anti-Union Bill\n\nAll eyes are on Wisconsin today to see how the state's labor movement reacts to the surprise vote in the state Senate, moving Gov. Scott Walker's anti-union bill one step closer to becoming law. We speak with Frank Emspak of the Workers Independent News in Madison. &quot;We've had democracy by deception here,&quot; Emspak says. &quot;You're talking about disenfranchising millions of people, not only in Wisconsin, but also throughout the Midwest. Basically, saying that working people, in an organized fashion, have no right to participate in the electoral process. This is what the Republicans are doing.&quot;\n\n\n- As Calls Grow For No Fly-Zone in Libya, Questions Over Legality and Past Precedents Give Pause\n\nIn Libya, troops loyal to Col. Muammaer Gaddafi are locked in intense fighting with opposition forces for control of several cities and towns across the country. While the battles rage in Libya, calls are growing on the international community to impose a no-fly zone to cripple Gaddafi's airforce. We go to Libya to where Democracy Now! correspondent Anjali Kamat interviews Esaam Gheriani, a field member of the Feb 17th Coalition and we talk to international law professor Richard Falk.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:88078c2e5fadeb545028a886f0d78311922ac8cf","amp;dn":"Democracy+Now+-+10+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88078c2e5fadeb545028a886f0d78311922ac8cf","infoHashBuffer":{"type":"Buffer","data":[136,7,140,46,95,173,235,84,80,40,168,134,240,215,131,17,146,42,200,207]},"announce":[],"urlList":[]}}