{"title":"Coast to Coast AM - 2011-01-26 - Energy &amp; Space Developments","uid":6160880,"size":55405023,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:889697c2045f3eab4d634b95a83f87e6933e6f05&amp;dn=Coast+to+Coast+AM+-+2011-01-26+-+Energy+%26+Space+Developments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297208458,"description":"Date: \t01-26-11\nHost: \tGeorge Noory\nGuests: \tCharles Shults III, D.J. Williams\n\nAerospace and defense systems developer Sir Charles Shults discussed the latest developments in new energy sources, space exploration, and medical technology. It's an unfortunate fact &quot;that most of the seminal and really cutting edge research is being done in other countries right now,&quot; rather than the US, he noted. Much of this is due to America's weakened economy, as well as litigation and laws surrounding what and how research can be conducted, such as with the stem cell controversy, he continued.\n\nOne interesting development that other countries have produced, said Shults, are modified inkjet printers that can actually culture cells (using a person's own Mesenchymal stem cells) and then &quot;print organs layer by layer, which can then be grown or transplanted in people.&quot; Regarding energy sources, &quot;oil may became superfluous sooner than we think because of orbital solar methods, and compact nuclear reactors,&quot; he detailed.\n\nWhile NASA may be floundering with its canceled moon missions, Shults cited the growth of private enterprise, with companies like Space Adventures, which is selling tickets for a flight around the moon, scheduled for 2015, and Bigelow Enterprises, in negotiations to supply NASA with a module to expand the International Space Station. NASA's next Mars rover, Curiosity, will have advanced detection and photographic capabilities, and James Cameron is providing a full color stereo camera for it, he reported. Shults also reviewed his research into Martian anomalies that he believes are fossils of long dead organisms.\nVampire Subculture\n\nFirst hour guest, expert on deviant leisure, Dr. D.J. Williams talked about the vampire subculture. He differentiated &quot;lifestylers,&quot; who take on the affectation and style of mythical vampires, from those who view vampirism as part of their identity. The latter group practices feeding, mostly by draining energy, though some do ingest small amounts of human blood, he revealed. More here.\n\nNews segment guest: Gerald Celente\nWebsite(s):\n\n    * shultslaboratories.com\n    * deviantleisure.com\n\nBook(s):\n\n    * A Fossil Hunter's Guide to Mars\n","torrent":{"xt":"urn:btih:889697c2045f3eab4d634b95a83f87e6933e6f05","amp;dn":"Coast+to+Coast+AM+-+2011-01-26+-+Energy+%26+Space+Developments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"889697c2045f3eab4d634b95a83f87e6933e6f05","infoHashBuffer":{"type":"Buffer","data":[136,150,151,194,4,95,62,171,77,99,75,149,168,63,135,230,147,62,111,5]},"announce":[],"urlList":[]}}