{"title":"Bandits 2001 DD5.1 Retail NL Subs --TBS","uid":6268644,"size":4631912400,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8a6565acb2110fb71f907146cf8baefe635aa16e&amp;dn=Bandits+2001+DD5.1+Retail+NL+Subs+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Saggin","files":-1,"time":1300992920,"description":"Bandits 2001 DD5.1 Retail NL Subs\n\n\nNederlands:       \n\nVerenigde Staten\nMisdaad / Komedie\n123 minuten\n\ngeregisseerd door Barry Levinson\nmet Bruce Willis, Cate Blanchett en Billy Bob Thornton\n\nDe onweerstaanbare Joe en de zwaarmoedige Terry zijn voortvluchtige bankrovers die nog maar ÃƒÂ©ÃƒÂ©n doel voor ogen hebben: genieten van hun paradijs in Mexico. Ze hebben slechts nog een paar overvallen te gaan voordat het zover is. Hun aanpak is eenvoudig. Zonder geweld bezoeken zij de avond voor de overval de bankdirecteur. Ze genieten daar van een diner, blijven slapen en de volgende dag helpt de directeur hen veilig de bank te beroven. Deze aanpak zorgt ervoor dat de logerende bankovervallers als zijnde Robin Hoods, razend populair worden, zelfs bij de bankdirecteuren. Helaas worden de zaken gecompliceerder wanneer de onstabiele, zeer mooie maar vooral eigenwijze persoonlijkheid Kate in hun leven komt. Kate sluit zich aan bij de bankovervallers en steelt niet alleen mee het geld, maar ook hun harten.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/883&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/883&lt;/a&gt;\n\nEnglish\nA charismatic convict and a hypochondriac inmate break out of prison in a cement truck and immediately start a bank robbing spree. Becoming known as the &quot;Sleepover Bandits&quot;, the two kidnap bank managers the night before their robbery, spend the night with their families, and then all go to the bank in the morning to get the dough. Using a dim-witted stunt man as their getaway driver and lookout, the three successfully pull off several jobs that gets them recognition on a TV show about America's criminals. When a bored housewife with a failing marriage decides to runaway, she ends up in the hands of the criminals. Initially attracted to Willis, she nonetheless also ends up in bed with Thornton and a confused romantic relationship begins. Continuing along with their spree, the bandits hit the wall when the bank managers realize that they are non-violent and therefore no threat to them or their employees..  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0219965&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0219965&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nAudio          : English DD 5.1\nBron           : Retail\nOndertitels    : NL\nExtra's        : Nee\nMenu           : Ja\nGenre          : Misdaad / Komedie\nCover          : Ja\n\nBrought by TBS","torrent":{"xt":"urn:btih:8a6565acb2110fb71f907146cf8baefe635aa16e","amp;dn":"Bandits+2001+DD5.1+Retail+NL+Subs+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6565acb2110fb71f907146cf8baefe635aa16e","infoHashBuffer":{"type":"Buffer","data":[138,101,101,172,178,17,15,183,31,144,113,70,207,139,174,254,99,90,161,110]},"announce":[],"urlList":[]}}