{"title":"Bright.Star.HDRip.Castellano .avi","uid":6218639,"size":1898674176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ba48c58131828337cc6c232ea49fa760f432ac0&amp;dn=Bright.Star.HDRip.Castellano+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1299254229,"description":"Bright Star\n\n\nCalidad del video: HD Rip\nPeso: 1800 mb\nIdioma del audio: EspaÃƒÂ±ol EspaÃƒÂ±a\n\nLondres, 1818. Una relacion secreta comienza entre el joven poeta ingles de 23 aÃƒÂ±os, John Keats (Ben Whishaw), y su vecina, Fanny Brawne (Abbie Cornish), una extrovertida y elegante estudiante. La atipica pareja empieza mal, el viendola a ella como una frivola impertinente, y ella en absoluto impresionada no solo por su poesia, sino por la literatura en general. Sin embargo, cuando Fanny descubre que Keats esta cuidando de su hermano menor, gravemente enfermo, se ve conmovida y le pide entonces que le enseÃƒÂ±e cosas sobre la poesia, a lo que el accede. La poesia se convierte asi en un remedio romantico que funciona no solo para resolver sus diferencias, sino como combustible de un apasionado romance.\n\nCuando la alarmada madre de Fanny y la mejor amiga de Keats descubren la relacion, esta ya es imparable. Intensamente y sin remedio, absortos el uno en el otro, los jovenes amantes se ven llevados por poderosas y nuevas sensaciones. &quot;Me siento como si nos estuvieramos disolviendo&quot;, le escribio Keats. Juntos cabalgaron entonces en una ola de obsesion romantica que no hizo sino fortalecerse a medida que sus problemas crecian.","torrent":{"xt":"urn:btih:8ba48c58131828337cc6c232ea49fa760f432ac0","amp;dn":"Bright.Star.HDRip.Castellano+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba48c58131828337cc6c232ea49fa760f432ac0","infoHashBuffer":{"type":"Buffer","data":[139,164,140,88,19,24,40,51,124,198,194,50,234,73,250,118,15,67,42,192]},"announce":[],"urlList":[]}}