{"title":"Amado Avendano on the Zapatista Uprising","uid":6238601,"size":497263956,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8dbe6f2a5851d015540264994d445c33c20a4d14&amp;dn=Amado+Avendano+on+the+Zapatista+Uprising&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NRKaxion","files":1,"time":1299967896,"description":"Spanish with english subtitles\n\nThis is likely the last recorded video interview with Amado Avendano, who passed on a few months after this. Speaking on the 10th Anniversary of the Zapatista uprising, he gives a very personal insight into that tumultuous time and describes the assassination attempt on him afterward when he was selected to run for the office of governor.\n\nAmado Avendano, 65; Symbol of Zapatista Uprising\nObituaries\nMay 01, 2004|From Associated Press\n\nAmado Avendano, a journalist and activist who became a well-known symbol of the Zapatista uprising in Chiapas, Mexico, has died.\n\nHe was 65.\n\nAvendano was hospitalized Monday in San Cristobal de las Casas, Mexico, after suffering a stroke that left him in a coma.\n\nHe died Thursday, his son, Amado Avendano Villafuente, said in a telephone interview.\n\n\nAvendano is best known across Mexico for his campaign for governor of Chiapas in 1994 as a member of the leftist Democratic Revolution Party.\n\nDuring the campaign he became the celebrated candidate of the Zapatista guerrillas, who had rebelled against the government and briefly seized several Chiapas cities earlier that year.\n\nOn June 25, 1994, during a campaign stop in Mapastepec, a tractor-trailer rig collided with the car Avendano was riding in, triggering a horrific hit-and-run accident that killed three people and left Avendano critically injured.\n\nAvendano lost the election, but his supporters claimed it was stolen by the powerful Institutional Revolutionary Party, which ruled Mexico from 1929 until 2000, when it lost the presidency to Vicente Fox of the National Action Party.\n\nIn response, Avendano was sworn in as the head of an &quot;alternative government&quot; recognized by the Zapatistas and others for six years.\n\nHis close ties to Subcommander Marcos, the Zapatista's ski-mask-wearing spokesman, made Avendano a key contact for hundreds of international journalists who flocked to Chiapas to interview the rebel leader in the 1990s.\n\nAvendano was born in Mapastepec, but moved to San Cristobal de las Casas at an early age and adopted it as his home.\n\n&quot;I am a lawyer by trade, a journalist by necessity and a politician by accident,&quot; Avendano often said of himself. &quot;I am a coastal creature by birth and a mountain man by choice.&quot;\n\nAvendano co-founded the newspaper El Tiempo, which began publishing as a weekly in San Cristobal in February 1968.\n\nThe newspaper eventually began to be published every day, and Avendano developed a reputation as an investigative journalist who was not afraid to expose government corruption and the exploitation of Chiapas' Indian population.\n\nUnder intense criticism from the state government, which leaned on advertisers to stop running ads in the paper, El Tiempo closed in 1980. Avendano soon became editor of a new daily, El Diario de Hoy.\n\nIn the last years of his life, he served as editor and chief reporter of La Foja Coleta, a two-page daily that harshly criticized Chiapas' elected officials and was published by his wife, Concepcion Avendano.\n\nAvendano is survived by Concepcion and the couple's six children.","torrent":{"xt":"urn:btih:8dbe6f2a5851d015540264994d445c33c20a4d14","amp;dn":"Amado+Avendano+on+the+Zapatista+Uprising","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dbe6f2a5851d015540264994d445c33c20a4d14","infoHashBuffer":{"type":"Buffer","data":[141,190,111,42,88,81,208,21,84,2,100,153,77,68,92,51,194,10,77,20]},"announce":[],"urlList":[]}}