{"title":"Democracy Now - 03 feb 2011","uid":6147729,"size":448631161,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8ecee0027d80fee17876845fa81dd0a6035a3c10&amp;dn=Democracy+Now+-+03+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1296756539,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 03, 2011\n\n- At Last Six Dead, Almost 1,000 Injured After Pro-Mubarak Forces Attack Protesters\n- U.S. State Dept.: We Don't Know Who Is Behind Cairo Violence\n- Egyptian Government Cracks Down on Journalists, Anderson Cooper and Others Attacked\n- Tens of Thousands Protest in Yemen\n- 10 Journalists Arrested in Sudan\n- Palestinian Authority Shuts Down Pro-Egyptian Protest\n- Wall Street Bankers Take In Record $135 Billion In Compensation\n- 43 Million Americans Now Receiving Food Stamps; 14% Increase\n- Oil and Gas Industry Denounces Academy Award-Nominated Documentary\n- WikiLeaks Nominated for Nobel Peace Prize\n\n\nSpecial reports\n\n- Eyewitnesses to a Massacre: Reports From Inside Tahrir Square as Pro-Mubarak Forces Open Fire on Protesters\n\nJust before dawn in Cairo today pro-government forces opened fire at Tahrir Square, the site of anti-Mubarak protests for the 10 days. Minutes after the attack began Democracy Now! spoke with Egyptian protesters Mona El Seif and Salma Tarzi inside Tahrir Square.\n\n\n- A Battle For Democracy: Sharif Abdel Kouddous Reports On How Anti-Government Protesters Are Resisting the Mubarak's Regime Crackdown\n\nEgyptians vowing to oust President Hosni Mubarak continue to occupy the streets in Cairo today as pro-democracy crowds stand up to violent Mubarak forces. Reporting from a rooftop, Democracy Now! Senior Producer Sharif Abdel Kouddous describes the scene on the 6th October Bridge, where he reports pro-democracy activists are standing their ground on the &quot;frontline of the struggle&quot; for democracy.\n\n\n- California Professor Beaten By Pro-Mubarak Forces Minutes After Interview on Democracy Now!\n\nOn Wednesday University of California-Davis professor Noha Radwan joined Democracy Now! from a studio in Cairo. Just after finishing the interview she was attacked in the streets. &quot;I got attacked by the mob and beaten half to death by the Mubarak thugs who were happy to snatch my necklaces off my neck and to rip my shirt open,&quot; Radwan said. We speak to her again today on what happened.\n\n\n- Journalists and Human Rights Activists Arrested and Beaten In Cairo Crackdown\n\nHuman rights activist Hossam Bahgat reports the military has raided the offices of his organization, the Egyptian Initiative for Personal Rights, in downtown Cairo, which has been the headquarters for the legal effort to protect the pro-democracy demonstrators. He also says the military has locked down Tahrir Square, turning people away at checkpoints from entering. &quot;The biggest alarm today, is that there seems to be a series attempts by the army itself, for the first time, going after foreign journalists and going after human rights organizations, both Egyptian and foreign. Without access to Tahrir square we fear the worst is about to happen. It is something that the army does not want anyone from the outside world to witness.&quot;\n\n\n- Robert Fisk: Obama Administration Has Been Gutless and Cowardly in Dealing with the Mubarak Regime\n\nThe legendary Middle East journalist speaks from Cairo on the historic uprising and how the Obama has lost an opportunity to back a democratic movement in the Middle East.\n\n\n-  &quot;The True Face of Hosni Mubarak&quot; Is Now Being Televised Across the World: Democracy Now! Reports Live From Downtown Cairo\n\nViolent clashes continue in Egypt. The most recent reports out of Cairo show that seven demonstrators have been killed and more than thousand injured. Many of the pro-Mubarak agitators have been shown to be undercover security forces. In Tahrir Square, the epicenter of the uprising, thousands of Egyptians remain peaceful and defiant. We get a live report from Democracy Now! senior producer Sharif Abdel Kouddous who is on a rooftop near the 6th October Bridge and from Mona El Seif, an activist who has remained in Tahrir Square since yesterday.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:8ecee0027d80fee17876845fa81dd0a6035a3c10","amp;dn":"Democracy+Now+-+03+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ecee0027d80fee17876845fa81dd0a6035a3c10","infoHashBuffer":{"type":"Buffer","data":[142,206,224,2,125,128,254,225,120,118,132,95,168,29,208,166,3,90,60,16]},"announce":[],"urlList":[]}}