{"title":"Big Black Discography","uid":6170231,"size":508833074,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f022a29d6990de8bcc8249c9aa77a77299e5c95&amp;dn=Big+Black+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":15,"uploader":"MookStyFawker","files":104,"time":1297540217,"description":"I noticed that the Pirate Bay was lacking a full Big Black discography, so I decided to track down the last of the songs I was missing and upload them all for everyone to download and enjoy.\n\nBig Black is quite arguably the perfect example of a punk band, and I firmly believe anyone who thinks they know anything about punk should give them a listen.\n\nAs for the torrent, this is the first one I've ever made, and a few songs are lacking in quality, but not to the point where they are terrible to listen to. Just a few may sound a little more quiet than others.\n\nAlso, the reason the quality is fairly low on &quot;Rarities&quot; is because most of those songs were only released on vinyl, and the song &quot;He's a Whore&quot; is missing from it because it appears, in better quality, on Songs About F**king.\n\nBut, with all that aside, it's just about everything they have ever made and released, with album covers included (except for Rarities).\n\nIf there are any troubles with the torrent or the files, let me know and I will do my best to try and fix them.\n\nEnjoy, and remember, please seed for others!","torrent":{"xt":"urn:btih:8f022a29d6990de8bcc8249c9aa77a77299e5c95","amp;dn":"Big+Black+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f022a29d6990de8bcc8249c9aa77a77299e5c95","infoHashBuffer":{"type":"Buffer","data":[143,2,42,41,214,153,13,232,188,200,36,156,154,167,122,119,41,158,92,149]},"announce":[],"urlList":[]}}