{"title":"Treme: Music From the HBO Original Series - Season 1 [256kbps]","uid":6138561,"size":125467088,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f872de1a37ea1154c711ab1b56570ec75b8dc20&amp;dn=Treme%3A+Music+From+the+HBO+Original+Series+-+Season+1+%5B256kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"calicoguy","files":19,"time":1296406965,"description":"From Amazon.com\n\n# Audio CD (October 25, 2010)\n# Original Release Date: 2010\n# Format: Soundtrack\n# Label: Geffen Records\n# ASIN: B0041U7RHE\n\n\nTREME: MUSIC FROM THE HBO ORIGINAL SERIES, SEASON 1\n\n\nThe HBO series Treme, named for the historic neighborhood where jazz was born, chronicles the rebuilding of a unique American culture where music plays an integral role in the city's way of life. The show and soundtrack capture the sounds of many of New Orleans' extraordinary musicians and other artists.\n\nThe soundtrack album includes 19 tracks featuring music heard throughout the groundbreaking series over the course of its first season, offering a cross-section of New Orleans-bred music including rhythm and blues, soul, jazz, rock and roll, funk, folk and country that reflects the diversity of the city's musical tradition.\n\nArtists heard on the soundtrack -- and seen in the series -- include John BouttÃƒÂ© whose &quot;Treme Song&quot; is the series' theme. The Rebirth Brass Band's &quot;Feel Like Funkin' It Up&quot; reflects the melding of the city's brass band tradition with a contemporary funk cadence that exemplifies the musical melting post that is New Orleans. Steve Zahn who plays DJ/musician Davis McAlary in the series is heard performing &quot;Shame, Shame, Shame&quot; The album includes Dr. John's &quot;Indian Red,&quot; as well as &quot;Time Is On My Side&quot; by Irma Thomas and Allen Toussaint plus Steve Earle's &quot;This City&quot; and much more music that evokes the tenor of the series and the spirit of New Orleans.","torrent":{"xt":"urn:btih:8f872de1a37ea1154c711ab1b56570ec75b8dc20","amp;dn":"Treme%3A+Music+From+the+HBO+Original+Series+-+Season+1+%5B256kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f872de1a37ea1154c711ab1b56570ec75b8dc20","infoHashBuffer":{"type":"Buffer","data":[143,135,45,225,163,126,161,21,76,113,26,177,181,101,112,236,117,184,220,32]},"announce":[],"urlList":[]}}