{"title":"DEAD SPACE 2 PORTABLE by GLOBE","uid":6137162,"size":3565482096,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:903c3498620fa6811d7e9514b35fc8f1832c683e&amp;dn=DEAD+SPACE+2+PORTABLE+by+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1296344108,"description":"*Helo PC games fans ...\n\n\n* Play the new Dead Space game ...\n\n\n* FILE INFO :  minor work on the videos , just needing the subtitles enabled for 1 video from the menus , few languages not possible (sorry but in a game with this size for sa pratical file that maked sense) , english ok and not shore but French too just a matter to try , the others probably not entirely correct or with problems , the file includes a working crack but not shore if 100% ok to the all game but the game start fine and normal with the keybord looking fine \n\n\n\n* Gameplay * \n\nDead Space 2 is a survival horror third-person shooter. The player controls Isaac \nClarke from a third-person point of view, looking over the character's right shoulder. \nThe game features no HUD elements, relying on holograms projected from the player \ncharacter and his weapons to show information such as messages and ammunition \ncount, respectively. Player health and stasis is shown by a visual indicator located on Isaac's back. Isaac must fight an alien organism that infects and takes control of humans, turning them into &quot;Necromorphs&quot;, killing them and mutating their bodies. \nNecromorphs must be dismembered as the alien organism controls host bodies via tentacles extending into their limbs. Other, larger types of Necromorphs that cannot be dismembered will often have yellow, glowing pustules, indicating weak spots.\n The player may upgrade their weapons and armor at work benches, using nodes \nfound throughout the game. In-game stores may be accessed where the player may buy and sell various items and attain new weapons and suits. The player encounters zero-G environments, which Isaac is capable of maneuvering \nwith thrusters thrusters attached to his suit.\n\n\n* enjoy ... \n","torrent":{"xt":"urn:btih:903c3498620fa6811d7e9514b35fc8f1832c683e","amp;dn":"DEAD+SPACE+2+PORTABLE+by+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"903c3498620fa6811d7e9514b35fc8f1832c683e","infoHashBuffer":{"type":"Buffer","data":[144,60,52,152,98,15,166,129,29,126,149,20,179,95,200,241,131,44,104,62]},"announce":[],"urlList":[]}}