{"title":"Coast to Coast AM - 2011-01-25 - Archeological Mysteries","uid":6160878,"size":54994146,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:90655952d9bf36c840f63a8ffd198b275a2172e9&amp;dn=Coast+to+Coast+AM+-+2011-01-25+-+Archeological+Mysteries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297208405,"description":"Date: \t01-25-11\nHost: \tGeorge Noory\nGuests: \tJonathan Gray, Greg Hunter, John M. Curtis\n\nExplorer, archaeologist, and expert in ancient mysteries, Jonathan Gray, discussed how new findings which don't match current academic beliefs are being suppressed, as well as the discovery of human remains in geological strata, including the very earliest Cambrian layer. Citing the work of scientist George Dodwell, he said the Earth underwent a massive cataclysmic event in 2345 BC. The planet was tipped on its axis and was left wobbling (which continues to this day). Gray contends that all civilizations essentially began after this date.\n\nHe said that the Globalist agenda has covered up a very big secret-- namely, that Earth's granite rocks didn't slowly cool from liquid to solid over millions of years. Based on data that shows polonium bubbles froze into granite rock, he argued that the planet solidified in a matter of minutes, thus correlating with the description of creation offered in the book of Genesis. If the planet solidified so quickly, there had to have been some type of outside intervention, he observed.\n\nThus, the items found in the Cambrian layers, including gold chains, iron pots, thimbles, and remains of modern humans, may be less than five or six thousand years old, he surmised. Gray also shared other intriguing notions:\n\n    * The Egyptian pyramids (as well as the structure at Baalbek) were built through a anti-gravity technology using sound waves to lift heavy objects.\n    * Underground tunnels that go for hundreds of miles appear to be cut with a laser beam.\n    * The Chinese sent manned missions to the Moon, and constructed a &quot;Palace of Cold&quot; there, some 3,200 years ago.\n    * Ancient cave paintings depict people wearing modern clothes.\n\nState of the Union Analysis\n\nFirst hour guests, reporter Greg Hunter and analyst John M. Curtis reacted to Pres. Obama's State of the Union speech. Curtis commented that he thought the speech was impressive but more political than a typical State of the Union, with a main message of attempting to move toward bi-partisanship. Hunter was more critical of the speech, saying it lacked substance. Obama brushed over the deficit and didn't address the problem of cities and states going bankrupt, he noted.\n\nNews segment guest: Jeff Nelken\nWebsite(s):\n\n    * beforeus.com\n    * usawatchdog.com\n    * onlinecolumnist.com\n\nBook(s):\n\n    * Dead Men's Secrets\n    * The Weapon the Globalists Fear\n","torrent":{"xt":"urn:btih:90655952d9bf36c840f63a8ffd198b275a2172e9","amp;dn":"Coast+to+Coast+AM+-+2011-01-25+-+Archeological+Mysteries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90655952d9bf36c840f63a8ffd198b275a2172e9","infoHashBuffer":{"type":"Buffer","data":[144,101,89,82,217,191,54,200,64,246,58,143,253,25,139,39,90,33,114,233]},"announce":[],"urlList":[]}}