{"title":"ASSASSINÃ‚Â´S CREED BROTHERHOOD PORTABLE GLOBE","uid":6247897,"size":2003579546,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:90fc1e0b4f25b4d1eb592a91f978dd73b1df62cb&amp;dn=ASSASSIN%C3%82%C2%B4S+CREED+BROTHERHOOD+PORTABLE+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1300297473,"description":"* Hi PC games fans ...\n\n* Play the new AssassinÃ‚Â´s Creeed game ...\n\n* FILE INFO : COMPLETE AND NORMAL , just no multiplayer but that canÃ‚Â´t be played as usual , no videos,audio or anything was worked , just the cvorret work presenting the file and no file missing to the gameplay\n\n\nGameplay\n \nAssassin\\'s Creed: Brotherhood is a third person action-adventure video game with main emphasis on sandbox style gameplay in an open world of Italy. Like the previous installments, the gameplay\\'s core mechanics are based on parkour movements, crowd-blending stealth, assassinations and melee fighting system. The combat system features several improvements and for the first time in the series, the game offers a multiplayer mode alongside 40+ hours of single-player gameplay.\n \nThe game introduces a brand-new management system: the player can recruit new members by destroying any of twelve \\&quot;Borgia towers\\&quot; around Rome where papal troops are stationed, then rescuing disgruntled citizens in their districts from harassing guards. The player, as Ezio, can then send them to assignments around Europe or call them for support during missions (if they are not already occupied). The assassin recruits are also able to provide arrow support for the player. Tasking the novice Assassins is essential to make them gain experience, and the player is able to customize their appearance, skills and weapon training by spending the skill points they\\'ve earned. Assassins can die on missions, from which they will not return. Ezio masters new gadgets, such as Leonardo da Vinci\\'s parachute, which can be used when jumping from tall buildings, along with poison darts, a faster acting poison, a crossbow, and the ability to hold and throw heavier weapons like axes.\n\n\nenjoy ...\n","torrent":{"xt":"urn:btih:90fc1e0b4f25b4d1eb592a91f978dd73b1df62cb","amp;dn":"ASSASSIN%C3%82%C2%B4S+CREED+BROTHERHOOD+PORTABLE+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90fc1e0b4f25b4d1eb592a91f978dd73b1df62cb","infoHashBuffer":{"type":"Buffer","data":[144,252,30,11,79,37,180,209,235,89,42,145,249,120,221,115,177,223,98,203]},"announce":[],"urlList":[]}}