{"title":"Dungeon Defenders: FW Deluxe Version. 5.13 For Android","uid":6247714,"size":8078047,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:92129cb9a4a0edfa6a56cd2769d5103d2725e7a9&amp;dn=Dungeon+Defenders%3A+FW+Deluxe+Version.+5.13+For+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxThugxx","files":-1,"time":1300290326,"description":".\n\n                         *******   *    *  *     *   *****\n                            *      *    *  *     *   *\n                            *      ******  *     *   *\n                            *      *    *  *     *   * ****\n                            *      *    *  *     *   *    *\n                            *      *    *  *******   ******\n\n\n\n                       Dungeon Defenders: FW Deluxe Version. 5.13 \n\n\nEpic Online Action-RPG meets Tower Defense: join the battle! The definitive Unreal-powered next-gen Android game! Now including PvP!\n\nAdded Dungeon Defenders: First Wave Deluxe HD content for Tegra 2 powered devices! The Deluxe HD content includes new Tegra-exclusive missions, enemies, bosses, pets, and weapons --- for the ultimate mobile Dungeon Defenders experience!\nCheck Phone Compatibility list below, and make sure you have 600 MB of SD Card free space to install the game.\n\n(Now supports 2.1 Eclair! AND Online play over 3G/4G!)\n\nTake on the role of one of four distinct Hero classes, and battle hordes of invading creatures by strategically summoning a variety of Towers &amp; Traps throughout your Castle. Directly partake in the action-packed combat with your hero, while leveling up, gathering tons of loot, customizing &amp; upgrading equipment, and developing your class abilities.\n\nAll of this can be played in seamless online GameCenter multiplayer, as you cooperate and compete throughout the Campaign &amp; Challenge Missions to build the strongest heroes and achieve the highest scores in the online kingdom.\n\nCombining the depth of strategic gaming with the satisfying action of RPG character building, in a beautifully stylized 'toon fantasy setting built with Epic Games' UnrealÃ‚Â® Engine 3, DD is designed to be an addictive experience for casual and veteran gamers alike!\n\nNote: Please restart your device after installing the game.\n\n","torrent":{"xt":"urn:btih:92129cb9a4a0edfa6a56cd2769d5103d2725e7a9","amp;dn":"Dungeon+Defenders%3A+FW+Deluxe+Version.+5.13+For+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92129cb9a4a0edfa6a56cd2769d5103d2725e7a9","infoHashBuffer":{"type":"Buffer","data":[146,18,156,185,164,160,237,250,106,86,205,39,105,213,16,61,39,37,231,169]},"announce":[],"urlList":[]}}