{"title":"Employee of the Month(2006)DVDRip.AC3(ENG)-DROCK","uid":6264187,"size":732862690,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93df3c11aaf6646ef112fe28d681c89efa81f9ce&amp;dn=Employee+of+the+Month%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300853338,"description":"When a pair of ultra-competitive clerks at a discount super store discovers that a beautiful, newly-transferred cashier has a reputation for only dating employees who have won the coveted Employee of the Month award, their desperate efforts to earn the title and get the girl lead to a hilarious war of one-upmanship in this winner-takes-all comedy starring Dane Cook, Jessica Simpson, and Dax Shepard. Zack Bradley (Cook) and Vince Downey (Shepard) have been working at the cavernous Super Club for ten years and counting, but while the ambitious Vince has advanced to the position of head cashier and landed 17 consecutive \\&quot;E of M\\&quot; awards, laid-back Zack is content to simply sit back and enjoy the company of his fellow box boys. Longtime rivals whose conflicting attitudes as to what constitutes success has led to more than a few conflicts, Vince and Zack find their bitter battle for Super Club supremacy coming to a head when attractive new employee Amy (Simpson) transfers over from another store. When word quickly spreads that Amy only has eyes for the cream of the crop, slacker Zack attempts to clean up his act and break free from his box boy roots while uptight Vince tries to impress by maintaining his top dog position and keep cool in the face of competition. \n\nRipped with Handbrake.\n\nLength: 1 Hour 48 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:93df3c11aaf6646ef112fe28d681c89efa81f9ce","amp;dn":"Employee+of+the+Month%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93df3c11aaf6646ef112fe28d681c89efa81f9ce","infoHashBuffer":{"type":"Buffer","data":[147,223,60,17,170,246,100,110,241,18,254,40,214,129,200,158,250,129,249,206]},"announce":[],"urlList":[]}}