{"title":"CODIGO LYOKO 2Ã‚Âª TEMPORADA BY JKRILIN","uid":6238575,"size":4549265536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94094e9b97b5db3eb4c3c0c2b54b4a7d45484646&amp;dn=CODIGO+LYOKO+2%C3%82%C2%AA+TEMPORADA+BY+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gaditano_cc","files":26,"time":1299966582,"description":"La segunda temporada, en contraste con la primera, es mÃƒÂ¡s enfocada.\n\nLa animaciÃƒÂ³n es mÃƒÂ¡s realista y detallada y la personalidad de algunos personajes cambian. Al comienzo de esta porciÃƒÂ³n de la serie, Aelita vive en la Tierra y llega a Kadic bajo el nombre de Aelita Stones, presentÃƒÂ¡ndose como una supuesta prima de Odd que procedÃƒÂ­a de CanadÃƒÂ¡ (aunque en un principio Odd dijo que era de Holanda).\n\nEn esta temporada aparece William Dunbar, un chico nuevo que llega a la escuela, que le gusta Yumi, cosa que provoca rivalidad a Ulrich.\n\nAelita comienza a tener visiones de una vida que ella supuestamente nunca viviÃƒÂ³ y descubren a una persona llamada Franz Hopper que podrÃƒÂ­a tener conexiÃƒÂ³n con Lyoko. AdemÃƒÂ¡s, descubren un quinto sector (llamado Cartago) en Lyoko que es donde habita XANA y por el cual pueden llegar hasta sus datos y destruirle y una especie de segunda identidad que mÃƒÂ¡s tarde se revela como Franz Hopper atrapado en Lyoko, y es el creador del superordenador.\n\nMientras tanto, XANA crea y envÃƒÂ­a un monstruo llamado Scyphozoa para robar la memoria de Aelita. A parte de la Schypozoa, XANA, tambiÃƒÂ©n crea otros monstruos a los que Odd les pone el nombre de &quot;gusanos&quot; y &quot;tarÃƒÂ¡ntulas&quot;. Finalmente, se revela que Aelita es hija de Franz Hopper, creador de Lyoko y de XANA. TambiÃƒÂ©n Jeremy descubre que XANA no infectÃƒÂ³ a Aelita con ningÃƒÂºn virus sino que le quitÃƒÂ³ un fragmento de ella. Pero al ir a recuperarlo a Cartago (o como lo llaman ellos &quot;sector 5&quot;) todos son derrotados menos Aelita quien es atacada por la Scyphozoa y le quita las llaves de Lyoko con las que XANA escapa del superordenador y hace que Aelita muera, pero su padre Franz Hopper le devuelve la vida y le devuelve su fragmento perdido que eran sus recuerdos perdidos sobre la vida que llevaba en la Tierra.\n\n","torrent":{"xt":"urn:btih:94094e9b97b5db3eb4c3c0c2b54b4a7d45484646","amp;dn":"CODIGO+LYOKO+2%C3%82%C2%AA+TEMPORADA+BY+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94094e9b97b5db3eb4c3c0c2b54b4a7d45484646","infoHashBuffer":{"type":"Buffer","data":[148,9,78,155,151,181,219,62,180,195,192,194,181,75,74,125,69,72,70,70]},"announce":[],"urlList":[]}}