{"title":"Tint Guide Suite 2011 [Portable] ","uid":6230414,"size":17936003,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:94d863fbf7d7580daafbd03d147cb9f55f47a0e0&amp;dn=Tint+Guide+Suite+2011+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":7,"time":1299690734,"description":"Cosmetic Guide - Virtual cosmÃƒÂ©ticos - corrige defectos estÃƒÂ©ticos directamente en las fotos. Con guÃƒÂ­a cosmÃƒÂ©tica podra hacer que sus cuadros parecen incluso mejores que lo hacen! CosmÃƒÂ©ticos GuÃƒÂ­a le ayudara a suavizar las arrugas, reducir la inflamacion y la hinchazon del ojo, acentuar los ojos, eliminar marcas de nacimiento y defectos, realizar la rinoplastia, y blanquear los dientes. Usted puede hacer todo esto a la derecha en la foto!\n-Beauty Guide - Le permite aplicar el maquillaje y corrige los defectos cosmÃƒÂ©ticos directamente en las fotos.\nCon la belleza de instrucciones, usted puede hacer que sus cuadros parecen incluso mejores que los originales!\nGuÃƒÂ­a de belleza le ayudara a aplicar el lapiz labial, colorete, sombras de ojos, y el polvo, los parpados linea, color de ojos cambia; alisar las arrugas, reducir la hinchazon y la inflamacion del ojo; eliminar lunares y manchas, y blanquear los dientes. Usted puede hacer todo esto a la derecha en la foto!\n-Image Resize Guide - Cambiar la dimensiÃƒÂ³n de la imagen y los objetos inteligentes. Cambia la dimension de la imagen y relacion de aspecto. Elimina los objetos sin huellas visibles. Los mejores resultados se obtienen en un contexto de nieve, agua o vegetacion. areas importantes pueden llevar una marca especial. Incluye animacion paso a paso las muestras de prueba.\n-Picture Cutout Guide - Separa los objetos del fondo, hace un fotomontaje. Separa los objetos solidos de un fondo arbitraria, permite la transferencia de objetos a otra foto. Permite aplicar efectos de fondo. Rellena monocromo y sÃƒÂ³lido con el color seleccionado, la sombra y el efecto borroso con la densidad seleccionada.\n-MakeUp Guide - Maquillaje virtual directamente en las fotos. Con este editor de fotos de maquillaje que usted sera capaz de hacer que sus cuadros parecen incluso mejores que lo hacen! \n-Idioma: InglÃƒÂ©s\n\n\n","torrent":{"xt":"urn:btih:94d863fbf7d7580daafbd03d147cb9f55f47a0e0","amp;dn":"Tint+Guide+Suite+2011+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d863fbf7d7580daafbd03d147cb9f55f47a0e0","infoHashBuffer":{"type":"Buffer","data":[148,216,99,251,247,215,88,13,170,251,208,61,20,124,185,245,95,71,160,224]},"announce":[],"urlList":[]}}