{"title":"Complete Cosmos - Reis door de Ruimte - DVD 2 TBS","uid":6230816,"size":4495418352,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9544fc897f8956a2b754ba45045d535bb08216bf&amp;dn=Complete+Cosmos+-+Reis+door+de+Ruimte+-+DVD+2+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1299707493,"description":"\n\n\nComplete Cosmos - Reis door de Ruimte -De ontdekking DVD 2 \n\n\nEen kompleet naslagwerk bij u thuis..... De nieuwste wetenswaardigheden over ons heelal op 2 DVD's. Schitterende beelden gebracht in een heldere taal. Genieten voor wie meer wil weten over onze cosmos.\nUpdate van de laatste ontwikkelingen in de ruimte en de astronomie. Link naar een website met 50.000 zoekwoorden met achtergrond over deze serie. Links met interesssante websites over ruimte en astronomie. Volledige lijst met korte inhoud binnenin.\n\nMan in space\n- De grenzen van de ruimte: Mensen ontdekken de ruimte ? Yuri Gagarins eerste reis om de aarde, de race naar de Maan en de Apollo-landingen.\n- Het ruimteleven: Leven en werken in de ruimte. Triomfen, tragedies en het dagelijks leven in het Russische Mir-station en de Amerikaanse Space Shuttle.\n- Waar nu naartoe?: Een ruimtehaven in een baan om de Aarde. De kolonisatie van de Maan en Mars, de verovering van Venus ? en: een lift in de ruimte!\n\nPioneers\n- Doorbraak!: Van de hemelwachters van het oude Babylon tot de cosmologie van het ruimtetijdperk, de geschiedenis van de astronomie ? Copernicus, Kepler, Galileo, Newton, Hubble.\n- Aardpatrouille: Satellieten in een baan om de aarde controleren de 'gezondheid' van onze planeet ? ozon, smeltende ijskappen, het weer, de ontbossing, navigatie.\n- Robotten: Onze scouts in het Zonnestelsel. Ruimtesondes banen zich een weg op Mars, reppen zich naar Jupiter en landen op Titan, de maan van Saturnus.\n\nCosmic focus\n- Hubble's Oog: Nadat astronauten de defecte lens hebben hersteld, blikt de Hubble-ruimtetelescoop terug in de tijd en peilt naar de dieptes van de cosmos.\n- Fantastisch licht: Het zichtbaar licht onthult slechts een deel van de cosmos. Andere lichtgolven maken het plaatje compleet ? van gammastralen tot radiogolven.\n- Melkweg: De exploratie van onze galaxy. Wat zijn lichtjaren? Leven en dood van de sterren. Supernova's en de wolken waaruit de sterren ontstaan.\n\nDeep space\n- Oneindigheid: De structuur van het universum ? zonnestelsels, clusters, nevels. Hoe meten we de afstand tot het dichtstbijzijnde zonnestelsel en de verste quasar?\n- Big Bang, Big Crunch: De theorie van de Big Bang. Na die cataclysmische explosie blijft het universum uitdijen. Zal het ooit stoppen en weer krimpen?\n- Zwarte gaten, donkere materie: Onzichtbaar, maar toch overal aanwezig: de Zwarte Gaten. Hetzelfde voor de Donkere Materie ? de ontbrekende 90% van het universum.\n\n\n\n\nSpotinformatie \n\n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nOndertitels   : Nederlands (instelbaar)\nGenre         : Documentaire \n\n\n\nBrought to you by TBS","torrent":{"xt":"urn:btih:9544fc897f8956a2b754ba45045d535bb08216bf","amp;dn":"Complete+Cosmos+-+Reis+door+de+Ruimte+-+DVD+2+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9544fc897f8956a2b754ba45045d535bb08216bf","infoHashBuffer":{"type":"Buffer","data":[149,68,252,137,127,137,86,162,183,84,186,69,4,93,83,91,176,130,22,191]},"announce":[],"urlList":[]}}