{"title":"TEST DRIVE UNLIMITED 2 Fixed Directory - GLOBE","uid":6161274,"size":2830247101,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9598d3a66c3c9e595642c3ef981dccb5e8e76552&amp;dn=TEST+DRIVE+UNLIMITED+2+Fixed+Directory+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1297223782,"description":"* hello PC games fans ...\n\n* play the new Test Drive Unlimited game ...\n\n\nGameplay \n\nThere will be a storyline in Test Drive Unlimited 2 to follow for the player. To progress through the game, the player has to earn experience points to level up through the 60 levels. These points can be earned via 4 categories:\n Competition (racing, completing challenges)\n Social (making friends in the game, race against other people, joining clubs)\n Discovery (discover all roads, take photographs of specific locations, find all car wrecks)\n Collection (buy cars, houses, furniture, clothing/basic needs)\n There are an additional 10 Levels available to those who acquire the TDU2 Casino Online DLC/Pre-order Bonus, these levels are achieved within the casino itself.\n The player can earn extra money depending with how the player drives. Driving like a daredevil and performing stunts, drifting through turns at high speeds and evading crashes and the traffic will earn the player extra cash. Exploring the island lets the player find vehicle wrecks which will unlock exclusive vehicles at the dealerships on the island. The player can also walk out of the car in certain areas. The player\\'s avatar can be altered by changing hair, clothes, physical appearance and their attitude and facial features, and they can also buy houses. Co-op will also make an appearance in the game including a Follow-the-Leader mode. In this mode, players will have to complete a route by driving through checkpoints. When a checkpoint is passed by the leader, the game promotes one of the other drivers as leader. Working together properly is made even more important as only the leader can see the route on his GPS display.\n\n\nenjoy ...\n","torrent":{"xt":"urn:btih:9598d3a66c3c9e595642c3ef981dccb5e8e76552","amp;dn":"TEST+DRIVE+UNLIMITED+2+Fixed+Directory+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9598d3a66c3c9e595642c3ef981dccb5e8e76552","infoHashBuffer":{"type":"Buffer","data":[149,152,211,166,108,60,158,89,86,66,195,239,152,29,204,181,232,231,101,82]},"announce":[],"urlList":[]}}