{"title":"Within_Temptation-The_Unforgiving-DVD-2011-JUST","uid":6283518,"size":89688144,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:963be74de752afd358d50c3f8f239b865475510b&amp;dn=Within_Temptation-The_Unforgiving-DVD-2011-JUST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":10,"time":1301530002,"description":"Artist.......: Within Temptation\nAlbum........: The Unforgiving\nLabel........: Sony Music\nGenre........: Metal\nCatnr........: 88697833592\nSource.......: DVD (LPCM 2.0\nRip.date.....: 2011-03-26\nStr.date.....: 2011-03-25\nQuality......: 187kbps/48.0kHz/Joint Stereo\nUrl..........: http://www.within-temptation.com\n\ntrack  title                                          time\n\n1.    Faster (Video Edit)                            7:45\n2.    Sinad (Video Edit)                            8:56\n3.    Shot in the Dark (Video Edit)                10:25\n4.    The making og                                20:56\n5.    Utopia (feat. Chris Jones) (Video Edit)        3:50\n6.    Music from Facebook Fans DVD Chapters        12:06\n\nRuntime  63:58\nSize    84.27\n\nRelease Notes\n\nGoth metal stars Within Temptation marry the guitar-driven force of hard rock\nwith the sweep and grandeur of symphonic music, and the results have made them\none of the most popular bands ever in the Netherlands. Within Temptation were\nformed in 1996 by guitarist Robert Westerholt and vocalist Sharon den Adel, who\nare partners on stage and off. Within Temptation\\'s early material caught the\nattention of the Dutch label DSFA, and they signed the group to a record deal\ntheir first album, Enter, was released in 1997. Up until this time, Within\nTemptation had been a studio project, but the success of the album led to\ninvitations to play several live shows, including the Dynamo Music Festival, one\nof the biggest live music events in the Netherlands. Within Temptation\ndemonstrated their strength as a concert act, and began playing Germany,\nAustria, Belgium, and the Czech Republic. Booked to play Dynamo\\'s main stage in\n1998, Within Temptation felt recording new material was in order, and they\nreleased the Dance EP for the occasion. Shortly afterwards, Within Temptation\nwent on hiatus as the group\\'s members dealt with personal commitments and\nWesterholt and den Adel built a studio for their ambitious recording projects\n\nIn late 2000, Within Temptation returned with their second full-length album\nand first for Sony), Mother Earth, and the band continued to appear at major\nmusic festivals in Europe and the Netherlands the album was a major commercial\nsuccess, and the song \\&quot;Ice Queen\\&quot; was released as a single, rising to number two\non the Dutch charts. After several years of steady touring (including major\nfestival appearances in France and Mexico), Within Temptation returned to the\nstudio to record their third album, 2004\\'s The Silent Force, an ambitious\nproject featuring a full orchestra and 80-voice choir accompanying the band. It\nwas their first disc to be released simultaneously in Europe and the\nNetherlands, and became a major commercial success, going platinum at home and\nreaching the Top Ten in Germany, Belgium, Spain, and Finland. Having become the\nNetherlands\\' best-selling international act, Within Temptation finally landed an\nAmerican record deal with the venerable metal imprint Roadrunner, which released\ntheir fourth album, The Heart of Everything, in 2007. Black Symphony","torrent":{"xt":"urn:btih:963be74de752afd358d50c3f8f239b865475510b","amp;dn":"Within_Temptation-The_Unforgiving-DVD-2011-JUST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"963be74de752afd358d50c3f8f239b865475510b","infoHashBuffer":{"type":"Buffer","data":[150,59,231,77,231,82,175,211,88,213,12,63,143,35,155,134,84,117,81,11]},"announce":[],"urlList":[]}}