{"title":"Coast to Coast AM - 2011.02.23 - Philosophy &amp; Hidden Knowledge","uid":6200106,"size":56324693,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:963d98dec4eadffd2d83800c7b984a10fc8c61a2&amp;dn=Coast+to+Coast+AM+-+2011.02.23+-+Philosophy+%26+Hidden+Knowledge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pegasus77","files":5,"time":1298585660,"description":"Philosophy &amp; Hidden Knowledge\n\nDate: 02-23-2011\nHost: George Noory\nGuests: Jeffrey Grupp, William Thomas\n\nRadical academic and empiricist Jeffrey Grupp shared philosophical and metaphysical concepts, and discussed how hidden knowledge is sometimes suppressed, and used against the general population to control them. The &quot;telescreen&quot;-- the barrage of mass media images and information that floods human consciousness, is a kind of everyday mind control that acts to despiritualize the populace, he explained.\n\nGrupp outlined his concept of &quot;Dark Ecstasy&quot;-- a kind of religion that the Illuminati practices in which they derive spiritual euphoria through artistic expressions of death, sado-masochism, murder, war and pain. This force has influenced and tainted an incredible number of humans, he added.\n\nA former atheist, Grupp said he's found empirical proof for the existence for God by seeing the &quot;golden ratio&quot; displayed throughout nature, the cosmos, and in quantum chaos. He also spoke about &quot;telementation,&quot; a variation on the Law of Attraction that focuses more on feeling reality into existence rather than using belief or visualization to manifest things. \n\nThrough his study of numerology, Grupp noted that the change into the 21st century, with years all starting with 2 instead of 1, signifies a large change. This suggests we're entering a time of dramatic camaraderie, and improvement for humanity, he noted.\n\nCell &amp; Wireless Dangers:\nFirst hour guest, researcher William Thomas shared an update on the dangers of cell and wireless phones. He reacted to a new report that cell phone usage causes increased brain activity, saying that the study downplays the hazards. We are looking at a &quot;brain-wiping of our population within the next few decades.&quot; Children using cell phones now will be senile by the age of 30 and unable to function in society, he warned. Thomas advocated taking steps to avoid or mitigate exposure to electromagnetic smog including removing wireless routers from the home, as well as cell phones and portable phone cradles (which he said give off even more radiation than cell phones). \n\nNews segment guest: Christian Wilde \n\nWebsites:\nantimatterradio.com\nwillthomasonline.net\n\nBooks:\nThe Telescreen\nTelementation: Cosmic Feeling and the Law of Attraction\nCorporatism: The Secret Government of the New World Order\nABCs of Cell Phones and Other Hazards of the Wireless Age","torrent":{"xt":"urn:btih:963d98dec4eadffd2d83800c7b984a10fc8c61a2","amp;dn":"Coast+to+Coast+AM+-+2011.02.23+-+Philosophy+%26+Hidden+Knowledge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"963d98dec4eadffd2d83800c7b984a10fc8c61a2","infoHashBuffer":{"type":"Buffer","data":[150,61,152,222,196,234,223,253,45,131,128,12,123,152,74,16,252,140,97,162]},"announce":[],"urlList":[]}}