{"title":"VSO ConvertXToDVD 4.1.11.351 [Final + Packs Templates - Full][Mu","uid":6281192,"size":33031448,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:96cfb7bf95edb35fd3ad1f4a063e0c497aa136e1&amp;dn=VSO+ConvertXToDVD+4.1.11.351+%5BFinal+%2B+Packs+Templates+-+Full%5D%5BMu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":5,"time":1301441585,"description":"VSO ConvertXToDVD 4.1.11.351 [Final + Packs Templates - Full][Multilenguaje]\n &lt;a href=&quot;\nhttp://www.vso-software.fr/products/convert_x_to_dvd/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.vso-software.fr/products/convert_x_to_dvd/&lt;/a&gt;\n\nEnglish:\nCategory: Utilities, Video \nCompatible Systems: Win2000 / XP / 2003 / Vista / 7 \nLanguage: Multilingual / Spanish \n\nConvertXtoDVD (formerly DivXtoDVD): avi to dvd, convert video \n\nConvertXtoDVD is a software to convert and burn your videos to DVD. With ConvertXtoDVD and in a few clicks you can backup your movies to DVD playable on any home DVD player. \n\nConvertXtoDVD supports most popular format such Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV and stream formats. Convert your video files into a compliant DVD Video and DVD burning software. \n\nIn a few clicks, the software converts and records all types of video files to DVD or multimedia content. The program works regardless of video formats NTSC and PAL and creates chapters automatically or manually, create custom menus, add captions, etc.. \n\nProperties \n\n* Supported Video formats: DivX, Xvid, MPEG4, MOV, AVI, WMV, WMV HD, DV, MKV, MTS, ogm and more ... \n* Supported sources: existing files from digital camcorders, TV / Sat, capture cards \n* You can use up to 4 hours of material from different sources \n* Supported audio formats: AC3, DTS, PCM, OGG, MP3, WMA and more ... \n* Handles subtitles files (. .SUB SRT / IDX. SSA) color and font selection, and supports tags (italic, bold) \n* Video format choice: NTSC, PAL, or automatic and PULL-DOWN \n* Picture output: Widescreen, Fullscreen, or automatic \n* Create Automatic chapters or edit your owns with preview \n* Fast preview mode to verify that you loaded the video \n* Save the DVD structure on hard drive or burn to a DVD recordable \n* Integrates a reliable burn engine (supports all DVD formats) \n* Fast and quality encoder (typically less than 1 hour to make a movie) \n* Ability to put multiple files between them \n* Control the speed and quality of the conversion to the &quot;Evaluator conversion&quot; \n* Support for multiprocesores (dual / quad core) \n* Create advanced menus, ability to add video and audio to the menus, number of available funds, creation of sub-menus for chapters, subtitles, etc. \n* Customizable interface (themes, dockable windows) \n* Multilingual support (available languages ??... 31 in total \n* Compatible with 32 and 64-bit editions of Windows XP / Vista / 7 \n\n\nMinimum hardware requirements: \n\n* Processor Intel Pentium III / AMD Athlon \n(Intel Pentium 4 / AMD Athlon XP or equivalent recommended) \n* 512 MB RAM with Windows 2000 or XP \n1 GB RAM with Windows Vista \n* Hard disk drive with at least 4.3 Gbytes free \n* DVD Burner \n\nSoftware support: Windows Ã‚Â® 2000 SP4, Windows XP SP2, Windows Vista, Windows 7 \n\nVarious fixes: \n* Resizing subtitle Issues \n* Choppy playback - bad frame rate detection Issues \n* Conversion freezing Issues \n* Interface (toolbars) update \n\n- 0004263: [Feature Request] menu not does not Appear on top of the list (anymore) (wesson) - resolved. \n- 0003730: [Bug] When Changing menu i have access violation in a non reproducable Manner (wesson) - resolved. \n- 0003958: [Feature Request] Directory structure for BUP / IFO / VOB Shall use project name INSTEAD OF 1st file name (wesson) - resolved. \n- 0003833: [Feature Request] Add folder name entry (wesson) - resolved. \n- 0004247: [Bug] image is distorted after conversion (wesson) - resolved. \n- 0003908: [Bug] regression on test validation no audio file (wesson) - resolved. \n- 0004246: [Information] When a conversion is paused - Should Be the name changed settings to resume (wesson) - resolved. \n- 0003194: [Crash] Access Violation When deleting an item (wesson) - resolved. \n- 0003862: [Bug] regression ts file not supported in version 4, did work in version 2 (wesson) - resolved. \n- 0004166: [Information] chapter edition (must press enter to validate change Twice) (wesson) - resolved. \n- 0004167: [Feature Request] add file icon have + always Showing in merge window (wesson) - resolved. \n- 0002901: [Bug] not does video play smooth 'after conversion / AVC Video format (wesson) - resolved. \n- 0004212: [Bug] Not Correctly resized subtitle in ts file (wesson) - resolved. \n- 0004231: [Crash] freezes at 90% conversion (wesson) - resolved. \n- 0004221: [Bug] Garbled audio, going too fast (wesson) - resolved. \n- 0004239: [Bug] ConvertXtoDVD Converts only part of a. Flv file while complete conversion of AVS whole file (wesson) - resolved. \n- 0004243: [Bug] In MKV subtitles included, too low to Be seen on screen - only a problem when to converting in NTSC (wesson) - resolved. \n- 0004182: [Unsupported file / stream format] Avi Does not load: there is no decodable video stream (wesson) - resolved.\n\n\n\nSpanish:\nCategoria: Utilidades, Video\nSistemas Compatibles: Win2000 / XP / 2003 / Vista / 7\nIdioma: Multilenguaje / EspaÃƒÂ±ol\n\nConvertXtoDVD (antiguamente DivXtoDVD): avi a dvd, convertir video \n\nConvertXtoDVD es un programa para convertir y grabar sus videos a DVD. Usando ConvertXtoDVD y con solo unos clicks de raton puede respaldar sus peliculas a soporte DVD reproducible en cualquier lector de DVD domestico. \n\nConvertXtoDVD soporta los formatos mas populares como Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV y formatos basicos de streams. Convierte sus archivos de video a una estructura compatible con DVD Video y lo graba a soporte DVD. \n\nEn unos clicks, el programa convierte y graba todos tipos de archivos video o contenido multimedia a DVD. El programa trabaja indistintamente formatos de video NTSC y PAL y permite crear capitulos automaticamente o manualmente, crear menus personalizados, insertar subtitulos, etc. \n\nPropiedades \n\n* Formatos de Video Soportados: DivX, Xvid, MPEG4, MOV, AVI, WMV, WMV HD, DV, MKV, MTS, OGM y mas... \n* Fuentes Soportadas: Archivos procedentes de videocamaras digitales, TV/Sat, tarjetas capturadoras \n* Puede utilizar hasta 4 horas de material audiovisual procedente de diferentes fuentes \n* Formatos de Audio Soportados: AC3, DTS, PCM, OGG, MP3, WMA y mas... \n* Admite archivos de subtitulos (.SRT .SUB/IDX .SSA) permitiendo seleccionar fuente y color, ademas soportando tags (italic, bold) \n* Seleccion de Formato de Video: NTSC, PAL, o automatico y PULL-DOWN \n* Formato de Salida: Widescreen, Fullscreen, o automatico \n* Crea capitulos automÃƒÂ¡ticamente o creelos a su gusto, con vista previa \n* Modo de previsualizacion rapida para verificar que se a cargado correctamente el video \n* Guarde la estructura en el disco duro o grabelo a un soporte DVD grabable \n* Integra un fiable motor de grabacion (soportando todos los formatos de DVD) \n* Codificador rapido y de calidad (normalmente tarda menos de 1 hora en convertir una pelicula) \n* Posibilidad de juntar varios archivos entre ellos \n* Control de la velocidad y calidad de la conversion con el &quot;Evaluador de conversion&quot; \n* Soporte de los multiprocesores (dual/quad core) \n* Creacion de menus avanzados: posibilidad de aÃƒÂ±adir video y audio a los menus, varios fondos disponibles, creacion de sub-menus para los capitulos, los subtitulos, etc \n* Interface configurable (temas, ventanas plegables) \n* Soporte multilingual (idiomas disponibles...31 en total \n* Compatible con las ediciones 32 y 64 bits de Windows XP/ Vista/ 7 \n\n\nRequerimientos minimos de hardware: \n\n* Processor Intel Pentium III / AMD Athlon \n(Intel Pentium 4 / AMD Athlon XP or equivalent recommended) \n* 512 MB RAM with Windows 2000 or XP \n1 GB RAM with Windows Vista \n* Hard disk drive with at least 4.3 Gbytes free \n* DVD Burner \n\nSoftware compatible con: WindowsÃ‚Â® 2000 SP4, Windows XP SP2, Windows Vista, Windows 7 \n\n\nVarias correcciones:\n * subtÃƒÂ­tulos cambiar el tamaÃƒÂ±o de los problemas\n * reproducciÃƒÂ³n entrecortada - mal formular los temas de detecciÃƒÂ³n de velocidad\n * problemas de conversiÃƒÂ³n de congelaciÃƒÂ³n\n * Interfaz (barras de herramientas) de actualizaciÃƒÂ³n\n\n - 0004263: [Reportaje PeticiÃƒÂ³n] hay menÃƒÂº no aparece en la parte superior de la lista (mÃƒÂ¡s) (Wesson) - resuelta.\n - 0003730: [Bug] al cambiar de menÃƒÂº he violaciÃƒÂ³n de acceso de forma no reproducible (Wesson) - resuelta.\n - 0003958: [Reportaje PeticiÃƒÂ³n] Estructura de directorios de BUP / IFO / VOB usarÃƒÂ¡ el nombre del proyecto en lugar del nombre del archivo primero (Wesson) - resuelta.\n - 0003833: [Reportaje PeticiÃƒÂ³n] AÃƒÂ±adir nombre de la carpeta de entrada (Wesson) - resuelta.\n - 0004247: imagen [Bug] estÃƒÂ¡ distorsionada despuÃƒÂ©s de la conversiÃƒÂ³n (Wesson) - resuelta.\n - 0003908: regresiÃƒÂ³n [Bug] sin audio en el archivo de pruebas de validaciÃƒÂ³n (Wesson) - resuelta.\n - 0004246: [InformaciÃƒÂ³n] cuando la conversiÃƒÂ³n se hizo una pausa - el nombre de configuraciÃƒÂ³n se debe cambiar para reanudar (Wesson) - resuelta.\n - 0003194: [Crash] ViolaciÃƒÂ³n de acceso al eliminar un elemento (Wesson) - resuelta.\n - 0003862: [Bug] u regresiÃƒÂ³n no de archivo admitidos en la versiÃƒÂ³n 4, trabajÃƒÂ³ en la versiÃƒÂ³n 2 (Wesson) - resuelta.\n - 0004166: [InformaciÃƒÂ³n] EdiciÃƒÂ³n capÃƒÂ­tulo (debe presionar ENTRAR dos veces para validar el cambio) (Wesson) - resuelta.\n - 0004167: [Reportaje PeticiÃƒÂ³n] han + aÃƒÂ±adir icono de archivo que muestra siempre en la ventana de combinaciÃƒÂ³n (Wesson) - resuelta.\n - 0002901: video [Bug] no juega &quot;suave&quot; despuÃƒÂ©s de la conversiÃƒÂ³n / Video en formato AVC (Wesson) - resuelta.\n - 0004212: subtÃƒÂ­tulo [Bug] no cambia de tamaÃƒÂ±o correctamente en el archivo ts (Wesson) - resuelta.\n - 0004231: [Crash] conversiÃƒÂ³n se congela a 90% (Wesson) - resuelta.\n - 0004221: [Bug] de audio ilegible, va demasiado rÃƒÂ¡pido (Wesson) - resuelta.\n - 0004239: [Bug] ConvertXtoDVD sÃƒÂ³lo convierte parte de un archivo FLV, mientras que AVS se completa la conversiÃƒÂ³n de archivo completo (Wesson) - resuelta..\n - 0004243: subtÃƒÂ­tulos [Bug] incluidos en MKV, demasiado bajo para ser visto en la pantalla - es sÃƒÂ³lo un problema cuando se convierte en NTSC (Wesson) - resuelta.\n - 0004182: [archivo no admitido / arroyo formato] Avi no se carga: no hay flujo de vÃƒÂ­deo descifrables (Wesson) - resuelta.\n","torrent":{"xt":"urn:btih:96cfb7bf95edb35fd3ad1f4a063e0c497aa136e1","amp;dn":"VSO+ConvertXToDVD+4.1.11.351+%5BFinal+%2B+Packs+Templates+-+Full%5D%5BMu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96cfb7bf95edb35fd3ad1f4a063e0c497aa136e1","infoHashBuffer":{"type":"Buffer","data":[150,207,183,191,149,237,179,95,211,173,31,74,6,62,12,73,122,161,54,225]},"announce":[],"urlList":[]}}