{"title":"James Mann - The Rebellion of Ronald Reagan","uid":6141788,"size":213392056,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9738d99f58f832fd7aff59f2f37c4b45ac8ddba0&amp;dn=James+Mann+-+The+Rebellion+of+Ronald+Reagan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zigazig","files":13,"time":1296530058,"description":"In The Rebellion of Ronald Reagan, New York Times bestselling author James Mann directs his keen analysis to Ronald Reagan's role in ending the Cold War. Drawing on new interviews and previously unavailable documents, Mann offers a fresh and compelling narrative-a new history assessing what Reagan did, and did not do, to help bring America's four-decade conflict with the Soviet Union to a close.\n\nAs he did so masterfully in Rise of the Vulcans, Mann sheds new light on the hidden aspects of American foreign policy. He reveals previously undisclosed secret messages between Reagan and Moscow; internal White House intrigues; and battles with leading figures such as Nixon and Kissinger, who repeatedly questioned Reagan's unfolding diplomacy with Mikhail Gorbachev. He details the background and fierce debate over Reagan's famous Berlin Wall speech and shows how it fit into Reagan's policies. Ultimately, Mann dispels the facile stereotypes of Reagan in favor of a levelheaded, cogent understanding of a determined president and his strategy.\n\nThis book finally answers the troubling questions about Reagan's actual role in the crumbling of Soviet power; and concludes that by recognizing the significance of Gorbachev, Reagan helped bring the Cold War to a close. ","torrent":{"xt":"urn:btih:9738d99f58f832fd7aff59f2f37c4b45ac8ddba0","amp;dn":"James+Mann+-+The+Rebellion+of+Ronald+Reagan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9738d99f58f832fd7aff59f2f37c4b45ac8ddba0","infoHashBuffer":{"type":"Buffer","data":[151,56,217,159,88,248,50,253,122,255,89,242,243,124,75,69,172,141,219,160]},"announce":[],"urlList":[]}}