{"title":"Democracy Now - 01 feb 2011","uid":6143276,"size":455630888,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:976b98e5581424745226bee3e39fc0ea0c574b3e&amp;dn=Democracy+Now+-+01+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1296578092,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 01, 2011\n\n- Egyptian Protests Enter Day 8: Millions Fill Streets to Oppose Mubarak\n- Looting Tied to Backers of Mubarak Regime\n- Egyptian VP Reaches Out to Opposition Groups\n- U.S. Refuses to Call for Mubarak's Ouster\n- Jordananian King Dismisses Government\n- Fed Judge Rules Healthcare Bill to be Unconstitutional\n- Haiti Offers Diplomatic Passport to Ousted President Aristide\n- Haitian Man Dies After Being Deported From U.S.\n- Iran Demands American Hiker Return for Trial\n- Arizona Gun Advocates Push for Weakening Firearms Laws\n- Undercover Investigators Expose Gun Show Loophole\n- Lacking Insurance, Father of Hip Hop Faces Medical Crisis\n\n\nSpecial reports\n\n- Millions Against Mubarak: Democracy Now!'s Sharif Abdel Kouddous Reports Live From Tahrir Amid Massive Protest\n\nOne the first week anniversary of the unprecedented popular uprising in Egypt, more than two million people descend on Tahrir Square in Cairo, defying the military curfew, to demand regime change in the country. The Egyptian Army has declared they will not use force and have recognized the &quot;legitimate grievances&quot; of the people. We speak to Sharif Abdel Kouddous, Senior Producer at Democracy Now! live from Tahrir Square. &quot;I am standing in an ocean of people ... They are demanding with one voice for the President Mubarak to step down,&quot; Kouddous says.\n\n\n- &quot;Mubarak is Our Berlin Wall&quot;: Egyptian Columnist Mona Eltahawy on How the Youth Drove the Uprising in Cairo and Implications for Democracy in the Region\n\nThe uprising in Egypt is a popular movement for democracy, but some media outlets mainly missing the point, according to our guest, Egyptian columnist and commentator Mona Eltahawy. She urges the media to use the terms &quot;uprising&quot; and &quot;revolt&quot; rather than &quot;chaos&quot; and &quot;unrest&quot; when reporting on the events in Egypt.\n\n\n- Media Blackout in Egypt and the U.S.: Al Jazeera Forced Off the Air by Mubarak, Telecommunications Companies Block Its Expansion in the United States\n\nReporters from Al Jazeera, the Arabic-language news network, have been arrested and forced off the air by President Hosni Mubarak. &quot;This regime which couldn't find the time to protect Egypt's priceless relics and the national museum in Cairo found the time to drag journalists through the streets, and found time to shut down Al Jazeera,&quot; says Mohamed Abdel Dayem of Committee to Protect Journalists. Meanwhile, Al Jazeera English is broadcast to more than 200 million homes around the world, but its hardly available in the United States. Critics have called it a media blackout by U.S. cable and satellite providers. We speak to Tony Burman, of Al Jazeera English.\n\n\n- Digital Darkness: U.S., U.K. Companies Help Egyptian Regime Shut Down Telecommunications and Identify Dissident Voices\n\nDoing the regime's bidding, British-based Vodaphone shut down Egypt's phone and internet service. The American company called Narus - owned by Boeing - sold Egypt the surveillance technology that helped identify dissident voices. We are joined by Tim Karr, of Free Press and CUNY Professor C.W. Anderson. Anderson traces the radical roots of Twitter to U.S. protests at the 2004 conventions.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:976b98e5581424745226bee3e39fc0ea0c574b3e","amp;dn":"Democracy+Now+-+01+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"976b98e5581424745226bee3e39fc0ea0c574b3e","infoHashBuffer":{"type":"Buffer","data":[151,107,152,229,88,20,36,116,82,38,190,227,227,159,192,234,12,87,75,62]},"announce":[],"urlList":[]}}