{"title":"Cloverfield(2008)DVDRip.AC3(ENG)-DROCK","uid":6182342,"size":733053569,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98148fd3b3c760c61eb17786ac9dae9a4aba1230&amp;dn=Cloverfield%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1298000852,"description":"Producer J.J. Abrams teams with writer Drew Goddard and director Matt Reeves for this frenetic tale of a powerful destructive force that descends upon New York City, and the four desperate people who put their lives on the line to embark on a perilous rescue mission. Rob Hawkins (Michael Stahl-David) is a young American professional who has recently been offered a coveted new job in Japan. Eager to send his older sibling off in style, Rob's younger brother, Jason (Mike Vogel), and his girlfriend, Lily (Jessica Lucas), organize a surprise going-away party to take place the night before Rob boards his Eastern-bound flight. As the party gets underway, Rob's longtime friend and current love interest, Beth (Odette Yustman), shows up with another man as the dejected guest of honor's best-pal Hud (T.J. Miller) encourages partygoer Marlena (Lizzy Caplan) to wish him an on-camera farewell despite the fact that they barely know one another. Moments after Beth storms out following a bitter skirmish with Rob, the entire New York City skyline goes dark. Power is quickly restored, prompting partygoers to turn their attention toward the news, where they learn that a freight tanker has been overturned in New York Harbor. Racing to the rooftop in hopes of getting a better look at the situation, the group is terrified to witness a massive explosion that rains debris across midtown Manhattan, causing mass chaos and unparalleled destruction. But the worst is yet to come, because it soon becomes apparent that this is not the work of a terrorist or an act of war, but a massive creature beyond human comprehension. Now, as the military moves in and the streets of New York City become a virtual war zone, Rob, Lily, Marlena, and Hud race to rescue Beth and get out of the city before the powers that be unleash the ultimate weapon of mass destruction on one of the most populated cities on the planet. \n\nRipped with Handbrake.\n\nLength: 1 Hour 24 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:98148fd3b3c760c61eb17786ac9dae9a4aba1230","amp;dn":"Cloverfield%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98148fd3b3c760c61eb17786ac9dae9a4aba1230","infoHashBuffer":{"type":"Buffer","data":[152,20,143,211,179,199,96,198,30,177,119,134,172,157,174,154,74,186,18,48]},"announce":[],"urlList":[]}}