{"title":"The Shaolin Plot 1977 DVDRip-TommyBlade Mandarin Audio (English","uid":6303122,"size":943610379,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ab7dfccccc0ba0f04c0da4e2170204849433965&amp;dn=The+Shaolin+Plot+1977+DVDRip-TommyBlade+Mandarin+Audio+%28English+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DeadlyVenomRelease","files":4,"time":1302227295,"description":"Release Title: The Shaolin Plot 1977 DVDRip-TommyBlade Mandarin Audio (English Subs Hardcoded), 608x338, DivxAVI, 899MB\n\n[center][img]http://ezpicshare.com/images/lp10120023.jpg[/img][/center]\n\n\t\nOther titles :\nSi da men pai (HK Title)   \n\nThe Shaolin Plot Thuglife Trailer:\n[youtube]ZyKZpB9Ep8M[/youtube]\n\n\nPLOT:\nThe Prince Daglen (Chen Hsing) is a top martial artist, is planning to subdue all the martial arts schools. First he sent Tibetan Lama Gold Cymbles (Hung Chin-pao) to the Kunlun School to demand the top secret from chief Ku. Ku refuses but loses the fight. However, his son Little Tiger (James Tien) manages to escape with the secret. Little Tiger seeks the protection of Shaolin monk Pu Hui (Chin Kang). The lama injures Pu Hui and gets the secret from Little Tiger. Prince Daglen now goes to Shaolin Temple, he poses himself as a Shaolin monk and gets into the temple to steal the secrets. Little Tiger learns of the Prince's plot by accident. His master Pu Hui sends him to Shaolin to warn the monks. But Daglen has abducted the abbot. He demands the monk trade Shaolin's secrets for the abbot. Little Tiger storms Daglen's palace, to a series of fierce fights with Prince Daglen...\n\n\nREVIEW:\nThis movie serves as a precursor to Sammo Hungs Iron-fisted Monk, with the great kicker Casanova Wong in a similar role as a shaolin monk-kicker extraordinaire. Sammos mentor Huang Feng is the director, who was responsible for some early classics such as HAPKIDO and WHEN TAEKWONDO STRIKES, both starring the ultimate high kicking femme fatale Angela Mao and both featuring and choreographed by Sammo.\n\nThe plot concerns the lead villain Chen Sing (dubbed the Charles Bronson of Asia) scouring the country for various martial arts manuals to further his evil deeds. James Tien is the student of Wu Tang who trains to stop him. there are many plot twists along the way which I wont go in to.\n\nThe movie starts brilliantly and excitingly with Sammo in full on villain mode sporting a beard and some killer weaponry, searching out the good guys. Two excellently choreographed fights follow, with Kam Kong displaying superb bootwork and Chien Yuet San some intricate spearplay. The choreography here is up there with Sammos later, masterful work such as MAGNIFICENT BUTCHER and ODD COUPLE. However, as the plot takes over there are some long, boring passages. But just wait until the ending! Casanova Wong kicks into gear alongside none other than Kwon Young Moon, as the two take on numerous villains and finally Chen Sing. Seeing these two go into action alongside each other is a joy to behold, not just for the fans.\n\nCasanova is known for his more high profile roles in movies like WARRIORS TWO, in which he performs one of the most incredible kicks ever seen on screen. But here his abilities are in my opinion given the best showcase. In one shot he performs 7 kicks, lightning fast, without his foot touching the floor, with excellent technique! It has to be seen to be believed. James Tien also performs the best action I've seen from him, having a good weapons duel with Chen.\n\nThe production values are decent, what you would expect of a Golden Harvest film from this time, and there is good use of locations. Sammo has one of his best villainous roles, as does Chen. If you are a fan of any of the performers this is a must-see, as the action is definitely up there with the best of the 70s kung fu movies.\n\nThe Hong Kong DVD has excellent cover art.\n\n\n\nINFO:\nTiTLE......[ The Shaolin Plot\nRUNTiME....[ 01:43:05\niMDB URL...[ [url]http://www.imdb.com/title/tt0076707/[/url]\n\nAUDiO......[ MP3 48000Hz 128 kb/s CBR (2 chnls)\nLANGUAGE...[ Mandarin Audio With English Subs Hardcoded\nViDEO......[ 1,082 kbps Xvid 23.976 FPS \nQ. FRAME...[ 0.211 bits*pixel\nRESOLUTiON.[ 608 x 338\nSUBS.......[ None  \nFiLES......[ 1 \nSiZE.......[ 899 MB\nSOURCE.....[ DVD \n  \n\nSCREENS:\n[img]http://ezpicshare.com/images/vlcsna-1299021215.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021230.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021240.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021252.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021261.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021272.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021282.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021297.png[/img]\n[img]http://ezpicshare.com/images/vlcsna-1299021307.png[/img]\n\n\nI Got No Comment On This One, When I First Saw The Trailer Off The Chain. Plot Off The Chain,\nCast Off The Chain, Last Fight One In My Books. 5* Monster Last Fight. Brilliant, Definitely Dig This One.\n\n\nJust Wanna Give A Shoutout To Ding &amp; Deaf And All At http://www.fuflixbulletin.net\nNot All My Releases I Put Up Torrent ,You Can Find All My Releases At http://www.fuflixbulletin.net \nNeed An Invite Hit Up &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d387a1b6aba5b2bdb7b2be93bbbca7beb2babffdb0bcbe&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:9ab7dfccccc0ba0f04c0da4e2170204849433965","amp;dn":"The+Shaolin+Plot+1977+DVDRip-TommyBlade+Mandarin+Audio+%28English+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab7dfccccc0ba0f04c0da4e2170204849433965","infoHashBuffer":{"type":"Buffer","data":[154,183,223,204,204,192,186,15,4,192,218,78,33,112,32,72,73,67,57,101]},"announce":[],"urlList":[]}}