{"title":"HISTORY OF POP AND ROCK MUSIC - part 283","uid":6184620,"size":124632120,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9baa7e87a68cb56b42e7d1ae3e8c636935b002b1&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+283&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1298076501,"description":"\n\n                         PART  283 \n\n\n          CORA GREEN   -  Bei Mir Bistu Shein  (1938)\n          MARTHA RAYE  -  Mama, That Moon is Here Again  (1938)\n\n\n     &quot;Bei Mir Bistu Shein&quot; (&quot;To Me You're Beautiful&quot;) is a popular Yiddish song composed by Jacob Jacobs and Sholom Secunda  for a 1932  musical, &quot;I Would If I Could&quot;.The song became famous with English lyrics but retaining the Yiddish title, &quot;Bei Mir Bistu Shein&quot;. \n     In 1937, Sammy Cahn heard a performance of the song, sung in Yiddish by African American performers Johnnie and George at the Apollo Theater in Harlem. On seeing the response, Cahn got his employer to buy the rights so he could rewrite the song with English language lyrics and rhythms more typical of swing music. He then convinced the still unknown Andrews Sisters to perform the song (recorded November 24, 1937). It became their first major hit, earning them a gold record, the first ever to a female vocal group.It was also a worldwide hit beyond America. In communist Russia a Russian-language version was produced with the State Jazz Orchestra of the Soviet Union and crediting composers O. Kandat and Fidrovsky with authorship. In Nazi Germany it was also a hit until its Jewish origins were discovered when it was promptly banned.\n\n\n     Martha Raye (1916-1994)  was an American comic actress and  singer who performed in movies, and later on television. In the early 1930s, Raye was a band vocalist with the Paul Ash and Boris Morros orchestras. She made her first film appearance in 1934 in a band short titled &quot;A Nite in the Nite Club&quot;. In 1936, she was signed for comic roles by Paramount Pictures, and made her first picture for Paramount. Martha Raye was known for the size of her mouth, which appeared large in proportion to the rest of her face, thus earning her the nickname &quot;The Big Mouth&quot;\n\n    &quot;Mama, That Moon is Here Again&quot; by Martha is probaby The Best Dance Performance Ever .It is one of the most difficult dances to learn and one of the most spectacular to watch.  \n\n ","torrent":{"xt":"urn:btih:9baa7e87a68cb56b42e7d1ae3e8c636935b002b1","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+283","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9baa7e87a68cb56b42e7d1ae3e8c636935b002b1","infoHashBuffer":{"type":"Buffer","data":[155,170,126,135,166,140,181,107,66,231,209,174,62,140,99,105,53,176,2,177]},"announce":[],"urlList":[]}}