{"title":"The Future is Wild (Animated Series)","uid":6177522,"size":5002819584,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c946b64eb6bca84e2ce300c9442e7e16f539866&amp;dn=The+Future+is+Wild+%28Animated+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"djwickid","files":26,"time":1297821979,"description":"This is a show about the creatures that could roam the Earth millions of years from now and the time traveling teenagers on the road trip of their lives. Using their TimeFlyer (just your typical wormhole-surfing vehicle their friend from the future borrowed from her parents), our crew can ricochet back and forth from era to era on a kind of time safari, discovering and documenting all of the mind-boggling wildlife they encounter.\n\nThe Future is Wild is an animated children's version of Canadian 2003 joint Animal Planet/ORF (Austria) and ZDF (Germany) co-production The Future Is Wild. It was developed by Nelvana Animation, and directed by Mike Fallows, with characters and creatures designed by Brett Jubinville. It is made in CGI animation. It airs in Canada on Teletoon and in the US on Discovery Kids where it made its debut on October 13, 2007. It features four teenagers (CG, Luis, Emily and Ethan) who study the future of the earth to find a new habitat for humanity, while learning about the futuristic creatures who inhabit it. The show is set for 26 episodes and as of July 5, 2008, it had finished its first season. The show was cancelled after the first season ended.\n\n","torrent":{"xt":"urn:btih:9c946b64eb6bca84e2ce300c9442e7e16f539866","amp;dn":"The+Future+is+Wild+%28Animated+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c946b64eb6bca84e2ce300c9442e7e16f539866","infoHashBuffer":{"type":"Buffer","data":[156,148,107,100,235,107,202,132,226,206,48,12,148,66,231,225,111,83,152,102]},"announce":[],"urlList":[]}}