{"title":"Charlie Sheen - Columbus - Violent Torpedo of Truth - 2011.04.06","uid":6305710,"size":204897830,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9d9e98b2d5babed0fe63a8d20f6f0ed098518484&amp;dn=Charlie+Sheen+-+Columbus+-+Violent+Torpedo+of+Truth+-+2011.04.06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"P2P-ftw","files":11,"time":1302326402,"description":"Charlie Sheen - Columbus - Violent Torpedo of Truth - 2011.04.06\n\nPretty decent video for most of this one.  This is a compilation of many clips tried to arrange in order, but unlike other shows I couldn't find a blow by blow twitter feed to help me put things in their rightful places.  I had to take cues from the different shirts he wore, or matching up what seems like would be the next relevant topic (example: Brooke clip after Denise talk)\n\nThere were less uploads for this show as compared to others, and a ton of duplicate material shots, It sucked going through it all (mentally mindfucking at times) but I believe I got most of the meat of it that was posted before being pulled.  Im rather sure this is the best this show will get unless other sources are found.  I lost what wouldve been the 2nd clip, about a minute that shows him taking off the jersey he had and gave it to an audience, then wouldve continued seamless into what is the 2nd clip now (shoulda planned better and duplicated clips Im working with) \n\nPreliminary of Cleveland is done, but more promising footage is stopping me from rlsing things to public... hope to have up a top quality show in the cleve soon","torrent":{"xt":"urn:btih:9d9e98b2d5babed0fe63a8d20f6f0ed098518484","amp;dn":"Charlie+Sheen+-+Columbus+-+Violent+Torpedo+of+Truth+-+2011.04.06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9e98b2d5babed0fe63a8d20f6f0ed098518484","infoHashBuffer":{"type":"Buffer","data":[157,158,152,178,213,186,190,208,254,99,168,210,15,111,14,208,152,81,132,132]},"announce":[],"urlList":[]}}