{"title":"Deep Purple - Slaves And Masters (1990) WMA320","uid":6298277,"size":124992016,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9da69caba212843ae506924b68dac236a4f63852&amp;dn=Deep+Purple+-+Slaves+And+Masters+%281990%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1302070144,"description":"I just can't put less than 5 stars to a DEEP PURPLE album.Of course Slaves and Masters is far behind Machine head or In rock or Stormbringer but is still a great album.\nJoe Lynn Turner-on vocals on this album-sings like he has never sing before, the music is much stronger than on Rainbow's turner era and he pushes his voice to the limits, coming sometimes close to Coverdale.Slaves and masters suffers from a typically 90's production-Ian Paice's drumming lacks the famous ghosts notes, which makes it more rigid.\nSTill SLAVES grooves hard with FIRE IN THE BASEMENT ,BREAKFAST IN BED, rocks hard with THE CUT RUNS DEEP or WICKED WAYS and puts you in magical moods with KING OF DREAMS, LOVE CONQUERS ALL,...\nSome might say it's more of a RAINBOW album than a DP, well then it's the best Rainbow album since Rising!\nThis break in MARK 2 was not in vain, it prepared the come back of GILLAN for the final Mark 2 BATTLE RAGES ON album and gave us the chance to hear songs like BURN performed by DP in the 90's on stage.\nThe more I write about this album, the more I remember it and the more I want to listen to it and if you still want to hear an album 11 years after its release, it sure means it is a good one.\n\nby Nicole Emery &quot;purpletemple&quot;\n\nTRACKLIST:\n\n01 - King Of Dreams.wma                                          \n02 - The Cut Runs Deep.wma                                       \n03 - Fire In The Basement.wma                                    \n04 - Truth Hurts.wma                                             \n05 - Breakfast In Bed.wma                                        \n06 - Love Conquers All.wma                                       \n07 - Fortuneteller.wma                                           \n08 - Too Much Is Not Enough.wma                                  \n09 - Wicked Ways.wma  \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:9da69caba212843ae506924b68dac236a4f63852","amp;dn":"Deep+Purple+-+Slaves+And+Masters+%281990%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da69caba212843ae506924b68dac236a4f63852","infoHashBuffer":{"type":"Buffer","data":[157,166,156,171,162,18,132,58,229,6,146,75,104,218,194,54,164,246,56,82]},"announce":[],"urlList":[]}}