{"title":"Ashley Tisdale - Headstrong (htut)","uid":6303228,"size":89793815,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f3c56299eb1bd7f8b22e73c3ed08f6b5cfc49d5&amp;dn=Ashley+Tisdale+-+Headstrong+%28htut%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"htut","files":-1,"time":1302233152,"description":"Headstrong is the debut studio album by American recording artist Ashley Tisdale. The album was first released on February 6, 2007 via Warner Bros. Records. Tisdale began working on the project after the first installment of High School Musical (2006), and after she had achieved the feat of being the first female artist to debut with two songs on the Billboard Hot 100. The singer worked with a variety of established writers and producers on the album, including Diane Warren, J.R. Rotem, Ryan Tedder, Evan &quot;Kidd&quot; Bogart, and Kara DioGuardi, among others. Commenting that the album garnered its title from her personality, Tisdale said she wanted to use her first album to formally introduce herself personally, and as not one of the characters she portrays.\n\nHeadstrong's music derives mainly from the genres of dance-pop and R&amp;B, provided by electronica. Meanwhile, it incorporates hip hop beats and some tracks infuse dancehall and other world music. The album also lyrically explores themes in teen pop. Many critics compared her first effort to the first works of fellow Disney-alums Britney Spears and Christina Aguilera. Carrying primarily an urban tone, the &quot;hip pop&quot; of Gwen Stefani is also said to be an influence on the album. Headstrong itself was given mixed reviews by critics, who while complimenting it overall, called it ordinary and panned the ballads. Whereas the album debuted at number five on the Billboard 200, selling over 64,000 copies in its opening week, it also charted in numerous international markets. It was later certified Gold by the Recording Industry Association of America and Irish Recorded Music Association.\n\nThe album's lead single, &quot;Be Good to Me,&quot; charted moderately in the United States and select European markets. Tisdale's breakthrough hit, &quot;He Said She Said&quot; peaked at fifty-eight in the US, and appeared on several international charts, peaking in the top twenty in Germany and Austria. The last two singles were released in certain countries in Europe exclusively. The third single, &quot;Not Like That&quot; charted in the top half of several European charts, while &quot;Suddenly&quot; charted in Germany. Tisdale supported the album with promotional appearances, High School Musical: The Concert, and her tour, Headstrong Tour Across America.","torrent":{"xt":"urn:btih:9f3c56299eb1bd7f8b22e73c3ed08f6b5cfc49d5","amp;dn":"Ashley+Tisdale+-+Headstrong+%28htut%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3c56299eb1bd7f8b22e73c3ed08f6b5cfc49d5","infoHashBuffer":{"type":"Buffer","data":[159,60,86,41,158,177,189,127,139,34,231,60,62,208,143,107,92,252,73,213]},"announce":[],"urlList":[]}}