{"title":"HTML, XHTML and CSS For Dummies, 7th Edition","uid":6229876,"size":25573930,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f96c893bc8f2ae0b577fe84148651e1c693897d&amp;dn=HTML%2C+XHTML+and+CSS+For+Dummies%2C+7th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"ImSoJaded","files":1,"time":1299669273,"description":"The indispensable introductory reference guide to HTML, XHTML and CSS\n\nEven though new technologies enable people to do much more with the Web, in the end HTML, XHTML and CSS are still at the root of any Web site. The newest edition of this bestselling guide is fully updated and revised for the latest technology changes to the field, including HTML5 and CSS3. Illustrated in full color, this book provides beginner and advanced coders the tools they need to be proficient at these programming languages.\n\n    * Shows you how to create a Web page and formulate XHTML document structure\n    * Addresses working with content management systems (WordPress, Drupal, and Joomla), and designing for mobile devices (iPhone, BlackBerry, and Android)\n    * Introduces HTML5 and CSS3, tools critical to mobile Web development\n    * Reviews working with text, lists, and images, and customizing links\n    * Demonstrates ways to employ cascading style sheets (CSS) and get creative with colors and fonts\n    * Details integrating scripts with XHTML and understanding deprecated HTML markup tags \n\nWritten by two veteran computer whizzes, HTML, XHTML and CSS For Dummies will help you get the design results you want!","torrent":{"xt":"urn:btih:9f96c893bc8f2ae0b577fe84148651e1c693897d","amp;dn":"HTML%2C+XHTML+and+CSS+For+Dummies%2C+7th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f96c893bc8f2ae0b577fe84148651e1c693897d","infoHashBuffer":{"type":"Buffer","data":[159,150,200,147,188,143,42,224,181,119,254,132,20,134,81,225,198,147,137,125]},"announce":[],"urlList":[]}}