{"title":"Coast to Coast AM - 2011-01-23 - Parapsychology","uid":6160871,"size":56610476,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9fc56bfcaccea28ed308088d6d38b9ded1d7bebb&amp;dn=Coast+to+Coast+AM+-+2011-01-23+-+Parapsychology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1297208308,"description":"Date: \t01-23-11\nHost: \tGeorge Knapp\nGuests: \tBarry Taff\n\nGeorge Knapp was joined by parapsychologist Dr. Barry Taff, who shared details on his investigations into cases of high strangeness as well as the difficulties in applying science to the paranormal. &quot;I think we're seeing the tip of a very large iceberg and the biggest thing we've found is that there is this other force of nature at work,&quot; Taff observed. As such, he mused, that ultimately paranormal research is limited because it amounts to &quot;measuring the effect of an unknown cause.&quot; Cases discussed by Taff ranged from the humorous, such as a deceased Star Trek fan who kept turning on the TV when his favorite program aired, to the terrifying, notably the haunting event which inspired the film The Entity.\n\nHe recalled one investigation which he said was &quot;by far, the most disturbing thing that's ever happened to me.&quot; Taff explained that he was asked to investigate an abandoned house where witnesses had reported seeing ghosts of the previous owners carrying on everyday activities as if they were still alive. During the investigation, a large, older man, who was &quot;not part of our group,&quot; appeared in the room. This entity attacked Taff and tried to strangle him until the other investigators pulled the old man off of him. At that point, the entity merely faded away and in his place was his grandson, who had brought the group to the house and now had bruises on his body where the investigators had hit the apparition. Eerily, Taff said, the male members of his group saw the ghost of the old man attack him, but the female members saw the attacker as the grandson.\n\nOn trying to unlock the source behind hauntings, Taff put forward a more human origin for most incidents. He surmised that &quot;after thousands and thousands of cases, I'd say that 95 to 98% are suggestive of a psychokinetic manifestation.&quot; That said, he conceded that there are a few cases which &quot;strongly suggest&quot; the possibility of discarnate intelligence. Unfortunately, Taff mused, &quot;in order to prove that, you've got to get rid of the psychokinesis hypothesis,&quot; which is &quot;almost impossible to rule out.&quot; Behind these psychokinetic events, he opined, seem to be &quot;forces working in concert&quot; that include geophysical, neurophysiological, and emotional influences. &quot;You look back at all the cases, you see the same data, over and over,&quot; he said of hauntings, &quot;these things are not an influence, it's a confluence.&quot;\nWebsite(s):\n\n    * barrytaff.net\n\nBook(s):\n\n    * Aliens Above, Ghosts Below\n","torrent":{"xt":"urn:btih:9fc56bfcaccea28ed308088d6d38b9ded1d7bebb","amp;dn":"Coast+to+Coast+AM+-+2011-01-23+-+Parapsychology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fc56bfcaccea28ed308088d6d38b9ded1d7bebb","infoHashBuffer":{"type":"Buffer","data":[159,197,107,252,172,206,162,142,211,8,8,141,109,56,185,222,209,215,190,187]},"announce":[],"urlList":[]}}