{"title":"Dumbass (2011)","uid":6182972,"size":6515338823,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a177b484930d59c93e402d1dba109a5f644a6a3e&amp;dn=Dumbass+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KINGRamoneProd","files":3,"time":1298019763,"description":"&quot;Dumbass&quot; was shot throughout 2007 by then-amateur filmmaker Ritchie Ramone, and assembled as five 15-minute episodes in August 2009 for a YouTube and DVD release.  However, the DVD release was only available for a very short period of time in the fall of 2009, and did not have any bonus features present.  The YouTube version of the video was released in September 2010.  In late 2010, the film was reassembled with the intention of releasing a &quot;special edition&quot; version, which would have included a great deal of special features such as deleted scenes that was not present in the original 2009 DVD release.  \n\nThis release ended up falling through at the last minute due to time constraints and prolonged delays.  \n\nWith production in limbo, it was eventually settled that &quot;Dumbass&quot; would be finally released in two parts: the &quot;core&quot; program with alternate audio commentary in February 2011 in order to celebrate the 4th anniversary of the first day of principal photography on February 20, 2007, and a full release containing deleted scenes and the original, previously unreleased 90-minute &quot;rough cut&quot; assembly (that was completed in December 2008) later in the year.  As of this writing, there has been no official release date set for the second part of this release.\n\nThe &quot;Main Program&quot; file contains all five YouTube episodes of &quot;Dumbass,&quot; extended and uncensored from the version that was released on YouTube.  The runtime is approximately 70 minutes. The bonus commentary was recorded on September 6, 2009, and features director/producer Ritchie Ramone, and stars Austin Gilbert and Alex Hensley.  Aside from the audio, the two videos are identical in both length and content.","torrent":{"xt":"urn:btih:a177b484930d59c93e402d1dba109a5f644a6a3e","amp;dn":"Dumbass+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a177b484930d59c93e402d1dba109a5f644a6a3e","infoHashBuffer":{"type":"Buffer","data":[161,119,180,132,147,13,89,201,62,64,45,29,186,16,154,95,100,74,106,62]},"announce":[],"urlList":[]}}