{"title":"Golden Yeggs(1950)-Hyperdrive25.avi","uid":6175406,"size":39714458,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a409afe32c22dd1922c76e5657ed00ca81dd123c&amp;dn=Golden+Yeggs%281950%29-Hyperdrive25.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":1,"time":1297754867,"description":"                        Golden Yeggs (1950)\n                        -------------------  \nGolden Yeggs is a 1950 Merrie Melodies short animated film, released on August 5, 1950 by Warner Bros. Cartoons, Inc. and directed by Friz Freleng. It features Daffy Duck and Porky Pig in a forerunner of the Rocky and Mugsy cartoons, with Rocky already in his present-day form.\n\nThe story was written by Tedd Pierce and animated by Arthur Davis, Gerry Chiniquy, Ken Champin, Virgil Ross and Emery Hawkins. Paul Julian painted the backgrounds and Hawley Pratt designed the layouts. Mel Blanc provided all the voices and Carl Stalling the music.\n\n&quot;Yegg&quot; is a slang term for a burglar or safecracker. The same play-on-words was used in the title of the 1947 Bugs Bunny cartoon, Easter Yeggs.\n\nSummary\n-------\nWhen Porky finds a golden egg in his henhouse, it was revealed that one of the geese laid it. But, knowing well about what happened to the goose that laid the golden egg (a reference to Aesop's Fables), he claims that Daffy laid it. After finding out about the fame Daffy got for laying the egg, Rocky and his gang hustle him back to their den and demand more output. Daffy tries to stall for time, at one point asking for surroundings that would make him more comfortable. Rocky and his henchmen oblige, but then demand the egg.\n\nDaffy tries to stall for time, but is given five minutes to lay his egg or else. The duck tries various ways to escape his predicament, but is stopped at every turn. When time runs out, the gangsters stalk Daffy ... only to find he really has laid a golden egg!\n\nDaffy is relieved that he met Rocky's demand and will be allowed to go free ... until Rocky escorts the duck into a room containing dozens of egg crates and orders him to &quot;Fill 'em up!&quot; Daffy moans, &quot;Aw, my achin' back!&quot; and faints.\n\nCensorship\n----------\nOn the ABC airing of this cartoon, the part where Daffy is shot in the head by Rocky after confessing that he hasn't laid any eggs is replaced with a repeat shot of the mob members playing cards and reading magazines (from earlier in the cartoon). This is also how the scene was shown in the compilation film The Looney, Looney, Looney Bugs Bunny Movie\n\nThe Nickelodeon version also edited the scene that was cut on ABC, but the scene was edited with a fake iris-out just as Rocky says, &quot;So long, pal&quot; and a fake iris-in after Daffy is shot.\n\nThe CBS airing of this cartoon leaves in the gun gag at the end, but cuts an early scene where after Porky tells the mobsters he doesn't want to sell Daffy, Daffy is then shown being carried out and the scene cuts to Daffy in the mobsters' apartment. What was cut was a short scene of Porky in a trough with a shovel broken over his head, burnt matches in his hooves, and money shoved in his hands, looking beaten up, and uttering, &quot;T-t-they talked me into it.&quot;\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. Just burn the file onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n","torrent":{"xt":"urn:btih:a409afe32c22dd1922c76e5657ed00ca81dd123c","amp;dn":"Golden+Yeggs%281950%29-Hyperdrive25.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a409afe32c22dd1922c76e5657ed00ca81dd123c","infoHashBuffer":{"type":"Buffer","data":[164,9,175,227,44,34,221,25,34,199,110,86,87,237,0,202,129,221,18,60]},"announce":[],"urlList":[]}}