{"title":"Hua Jai Chocolate Lakorn TV5 [Thai Movie]","uid":6228113,"size":9904650240,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a4e4ccdeccc2c12560e3da3e7480a04c1590b49b&amp;dn=Hua+Jai+Chocolate+Lakorn+TV5+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"poothaijaa","files":-1,"time":1299593618,"description":"Title: Hua Jai Chocolate\nBroadcast: TV5\nReleased : 10/10/2006\n14 Episodes\n\nCast:\nPatiparn Pataveekarn (Mos) as Chun\nPhiyada Akkrasenee (Aom) as Wan\nSakawjai Poolsawas (Aom) as Sai\nJamie Booher as Tam\nPanomkorn Tangtatsawas (Sane) as Petch\nKrit Hirunpruk as Man\nSitthiporn Niyom (Dong) as Nop\nKitti Chiaowongsakul as Khai\n\nSource: V2D\n\n\nSynopses:\nChun is a son of the hoteliers and owner family. He's arrogant and pricky and he has problem with his father, Chon, who spend his most time for work and force Chun to carry on his business. However, Chun tries to refuse it because he always think that this career make him grow up lonely without his father. Chun has a girlfriend, named Sai. She's also a millionair's daughter and has family's problem same as Chun. Anyway, Chun and Sai quarrel so often because they both are spoiled and self-centered. Sai secretly has another boyfriend, Non, a rising star singer.\n\nWan, a receptionist is going to give up her love career and get married to her boyfriend, Man. Although her friends, Tam and Nop, who secretly love her, try to oppose because Man is too selfish, Wan still want to get married to him because she loves him.\n\nChon wants Chun to go to take Hotel Management course in Switzerland before coming back to take care of his new hotel. Chun tries to refuse and challenge his father by teasing Wan in front of his father. But he feels sorry for Wan and tries to apologize her after that, so Wan can reslize that he is just a lonely boy.\n\nOne day, Wan unexpectedly sees that her boyfriend cheats on her, so she breaks up with him and decides to study in Switzerland with Tam.\n\nIn Switzerland, Wan and Tam have new classmate, Petch and Khai including Chun.Anyway, Chun unwillingly come to study, so he doesn't want to make friend with anyone. That makes everybody think that he's so arrogant and unfriendly.","torrent":{"xt":"urn:btih:a4e4ccdeccc2c12560e3da3e7480a04c1590b49b","amp;dn":"Hua+Jai+Chocolate+Lakorn+TV5+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e4ccdeccc2c12560e3da3e7480a04c1590b49b","infoHashBuffer":{"type":"Buffer","data":[164,228,204,222,204,194,193,37,96,227,218,62,116,128,160,76,21,144,180,155]},"announce":[],"urlList":[]}}