{"title":"Fair.Game.2010.Divx-Xvid.DK.Subtitles","uid":6265374,"size":1146725560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a565fd9c766dd8ef082f8c3aa63b0a5d278557fd&amp;dn=Fair.Game.2010.Divx-Xvid.DK.Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"musefix","files":2,"time":1300885230,"description":"Full version.\n\nDu kender nok historien om invasionen af Irak d. 20. marts 2003. HÃƒÂ¸jtstÃƒÂ¥ende embedsmÃƒÂ¦nd i USA hÃƒÂ¦vder, at der er fundet beviser for, at Saddam Hussein fremstiller masseÃƒÂ¸delÃƒÂ¦ggelsesvÃƒÂ¥ben. I Fair Game bliver vi taget med bag kulisserne hos CIA, og fÃƒÂ¥r et uhyggeligt indblik i sandheden om Irak. Du fÃƒÂ¥r serveret en historie, der er sÃƒÂ¥ rÃƒÂ¥, sÃƒÂ¥ intens og mest af alt afslÃƒÂ¸rende, at man nÃƒÂ¦sten tror det er en dokumentarfilm.\n \nInstruktÃƒÂ¸r Doug Liman (Bourne Identity, Mr. Og Mrs. Smith) fortÃƒÂ¦ller en ÃƒÂ¦rlig og nÃƒÂ¥deslÃƒÂ¸s historie om et svÃƒÂ¦rt ÃƒÂ¦gteskab mellem CIA-agenten Valerie Plame (Naomi Watts) og den pensionerede embedsmand Joe Wilson (Sean Penn), og en nation der bliver fÃƒÂ¸rt bag lyset af den demokratisk valgte regering. Alt mens vores hovedpersoner forsÃƒÂ¸ger at afdÃƒÂ¦kke den reelle trussel i Irak, har Det Hvide Hus travlt med at lyve for den amerikanske befolkning, og gÃƒÂ¥ i krig pÃƒÂ¥ falsk grundlag.\n \nSpÃƒÂ¦nding i velkendt handling\n Det er langt fra fÃƒÂ¸rste gang, at Hollywood har taget en sandfÃƒÂ¦rdig og god historie til sig, og laver en film ud af det. Det er ligeledes langt fra fÃƒÂ¸rste gang, at Bush-regeringen mÃƒÂ¸der hÃƒÂ¥rd kritik for skyggespillet op til Irakkrigen. Fair Game er centreret omkring en velkendt problemstilling, og har en konklusion som vi alle kender. Men som spÃƒÂ¦ndingsfilm fungerer den fortrÃƒÂ¦ffeligt, og underholdningen er garanteret fra de fÃƒÂ¸rste billeder glider over skÃƒÂ¦rmen, til virkelighedens Valerie Plame toner frem til slut.\n \nFilmen kombinerer pÃƒÂ¥ fineste vis det bedste fra politiske dramaer, og spÃƒÂ¦ndingen fra klassiske spionfilm. Der er ingen skuddueller eller drabelige biljagter, men til gengÃƒÂ¦ld et intelligent manuskript, prÃƒÂ¦gtige skuespilprÃƒÂ¦stationer og en tiltalende og personlig billedside.\n \nSolide prÃƒÂ¦stationer af Watts og Penn\n Fair Game er en film om mandsmod, om at sige stop nÃƒÂ¥r man har fÃƒÂ¥et nok, og ikke vil finde sig i mere. Det er en film om unfair game, og de to hovedkarakterers dybde og menneskelige fejl, giver filmen en realisme der er decideret uhyggelig. Watts og Penn spiller samtidig deres roller helt fÃƒÂ¦nomenalt, og du vil opleve dyb empati med de to helt til slutningen af filmen, hvor det stadig er svÃƒÂ¦rt at forstÃƒÂ¥ uretfÃƒÂ¦rdigheden og intensiteten i deres personlige drama.\n \nDe to pragtprÃƒÂ¦stationer bliver understÃƒÂ¸ttet til fulde af filmens plot, og den uvirkeligt usympatiske reaktion de to oplever fra deres medamerikanere og isÃƒÂ¦r den amerikanske presse. Alt dette gÃƒÂ¸r Fair Game til en af ÃƒÂ¥rets stÃƒÂ¦rkeste spÃƒÂ¦ndingsfilm, og sÃƒÂ¥ endda uden action.\n","torrent":{"xt":"urn:btih:a565fd9c766dd8ef082f8c3aa63b0a5d278557fd","amp;dn":"Fair.Game.2010.Divx-Xvid.DK.Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a565fd9c766dd8ef082f8c3aa63b0a5d278557fd","infoHashBuffer":{"type":"Buffer","data":[165,101,253,156,118,109,216,239,8,47,140,58,166,59,10,93,39,133,87,253]},"announce":[],"urlList":[]}}