{"title":"LESIEM - Mystic Spirit Voices_(2000)_m4a{nobody2007}","uid":6236075,"size":171568394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a59ce6943fab43189afba757cb551c402aa20e57&amp;dn=LESIEM+-+Mystic+Spirit+Voices_%282000%29_m4a%7Bnobody2007%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nobody2007","files":16,"time":1299877049,"description":"RIPP: iTunes for Mac, VBR 320kb/s\nplay time total: 1:10:57\nfile size total: ~172MB\ncoded: acc / m4a\n\n\ntrack list\n\n1. Lesiem ... 5:07\n2. Occultum ... 3:52\n3. Fundamentum ... 4:48\n4. Vivere ... 4:04\n5. Open Your Eyes ... 4:15\n6. Indalo ... 3:56\n7. Liberta ... 4:28\n8. Miracle Eyes ... 4:04\n9. Una Terra ... 4:14\n10. Mater Gloria ... 3:54\n11. Veni Creator Spiritus ... 4:49\n12. Lacrimosa ... 4:37\n13. Floreat ... 5:11\n14. In Taberna Mori ... 4:01\n15. Ave Fortuna ... 5:11\n16. Liberta ... 4:27\n\n\ncomments from buyers of these CD:\n\n1.\nLesiem's MYSTIC SPIRIT VOICES took many by storm with this enchanting yet sinister album of a world trapped between the darkness and GOD. One second the atmosphere will be light and simple with the next being dark and heavy. This may be a spiritual journey but it's definitely not your average church music. In fact, in the eyes of some purists (and I mean PURISTS!) this might be shunned for it can be rather cold at times (aka, &quot;Mater Gloria&quot;). Songs like the uplifting, almost regae sounding &quot;Indalo&quot;, however, always succeed in melting away the ice. The mystic-pop reminisance of ENIGMA with the Gregorian chantings reminisant to ERA always bring light to the surface with entrancing male choirs, Pink-Floyd-esqued guitars and worldbeat loop to loops exhilerating the experience of this well-executed album. There is even some feminine presence here on the spoken &quot;Open Your Eyes&quot;, the soulful &quot;Liberta&quot;, the trip-hoppy &quot;Miracle Eyes&quot; as well as the operatic &quot;Mater Gloria&quot;. The best song, however, would have to be their single, &quot;Fundamentum&quot; which is absolutely stunning. The way they ended the CD too was really quite clever with the mixture of Gregorian chantings with the celtic/pink floyd influenced &quot;Ave Fortuna&quot;. I mean, ENIGMA is one of my favorite bands but if you think that they're the best in its genre than think again - for you obviously haven't heard Lesiem before!\n\n2.\nThis beautiful CD is a delight to the eyes, ears, senses, and soul. The packaging is as beautiful as the sound, and both are deeply spiritual. Looking at the lush images -- while being in the moment and, at the same time, being open to be taken on the journey where the music impels -- is a lush, dynamic meditation that takes one through the portal into another time and space. Once one has begun listening to music that expands the consciousness, there is no going back, and if this music is lacking, there is a real yearning and longing for the experience. This CD fulfills that longing exquisitely and very beautifully, and it expands one's horizons as well. Some of these songs are in English -- how fortunate we are! But listening to ancient Gregorian chant in Latin is a humbling, yet very profoundly empowering experience. Add to that the experience of hearing that music set in THIS millennium and accompanied with music from THIS century, and, well - the sum of those two is MANY times the parts.\n\nThe genre of music to which this CD belongs is deeply inspiring and profoundly moving. Experiencing it is a transformational experience which enables an individual in one's own evolution. This CD deserves a HUGE forum, because it is not a cheap imitation of Enigma like a lot of music that is hyped by the record industry. This is an exquisitely beautiful and moving compilation of music which has been wonderful executed in its own setting and not as an imitation of anything else. Buy it, and prepare yourself for the wonderful, profound, and humbling-but-empowering journey it will create to another time and space. Highly, Highly Recommended!!!!","torrent":{"xt":"urn:btih:a59ce6943fab43189afba757cb551c402aa20e57","amp;dn":"LESIEM+-+Mystic+Spirit+Voices_%282000%29_m4a%7Bnobody2007%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59ce6943fab43189afba757cb551c402aa20e57","infoHashBuffer":{"type":"Buffer","data":[165,156,230,148,63,171,67,24,154,251,167,87,203,85,28,64,42,162,14,87]},"announce":[],"urlList":[]}}