{"title":"Mix Mechanic - House Party 3 (Old School Video Mixes)","uid":6226048,"size":1122183244,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a5f98ec906a196d661ff3cd67648862c625aab27&amp;dn=Mix+Mechanic+-+House+Party+3+%28Old+School+Video+Mixes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ControlGeniuss","files":4,"time":1299512877,"description":"DJ Blend Daddy - House Party 3 - Old Scool Mixes (2011)\n\n\nAl &quot;DJ Blend Daddy&quot; Perkins Jr. Of Mix Mechanic Music, Inc. is known for his Mega-Mixes, The All Mixed Up Series, The Old School Super Mixes &amp; his DJ Tool Beats &amp; Mega-Mix Series. Blend Daddy Began DeeJaying in the late 70's, blending &amp; mixing where ever he could from house parties to convention centers from Block Parties To Major Clubs. He's Won &amp; Judged DJ Battles In the Inland Empire &amp; Los Angeles Areas, he's taught local legends like Faze IV &amp; Tom Tom System also one of the OC's Hottest jocks Michael &quot;Mikee Mouse&quot; Pena (The Conga Room).\nBlend Daddy became interested in mixing after hearing Inland's legendary Jock Lance &quot;Bits &amp; Pieces&quot; Rabon, who taught him the ins &amp; outs of beat counting, pitch, tempo &amp; key matching. Taking this new found knowledge &amp; love for music, Blend Daddy would mix, scratch &amp; blend records for hours until his sets were near flawless. While playing at the infamous Club Don Juan's In the Inland Empire, club goers would request tapes of his sets, the mixes then were named &quot;Al Mixed Up&quot;, as in Al Perkins Jr. Mixed Up, were acquired by area radio stations KGGI 99.1, KUCR 88.1 KKBT 92.3, KDAY 1580 KUOR 89.1 they started airing them during drive time &amp; calling them &quot;All Mixed Up&quot; because of the way Daddy blended the vocals over different instrumental tracks. They became so popular he kept the name. The V.I.P. store located in Long Beach &amp; every swapmeet in Southern Cali began selling them, the rest of course is...History.\nNeeding a new challenge, Sean Jones of LRJ Entertainment and Blend Daddy were talking about how cool it would be to be able to have the Music Video's match the layout of the &quot;All Mixed Up&quot; audio mixes. Daddy stayed in the Lab perfecting this new &amp; different form of Mixtape. In late 2001 early 2002 he emerged with the All Mixed Up DVD series. The Mixes are flawless &amp; being able to visually see the mix unfold is truly indescribable.\nBlend Daddy is one of those rare talents that captivate &amp; excite listeners as soon as he blesses the Tables. Style, energy &amp; the ability to move the crowd in ways you won't soon forget. This Inland Empire transplant has been puttin' it down, for so long in such a way, you can't figure out which captivates you more, the style of the smooth blends or the flavor of the precise scratches that will surely make you itch. A true Dee Jay from back in the day, with a unique mixing style that fuses the past to the present and has the future written all over it.\nFinally after years of cultivating his unique craft, people have recognized that Blend Daddy has the skills to take him thru this millennium and beyond. With his advanced style and ability to take you on a journey with the use of his hands, Daddy is destined to become one of the industries legendary Hip-Hop icons.","torrent":{"xt":"urn:btih:a5f98ec906a196d661ff3cd67648862c625aab27","amp;dn":"Mix+Mechanic+-+House+Party+3+%28Old+School+Video+Mixes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5f98ec906a196d661ff3cd67648862c625aab27","infoHashBuffer":{"type":"Buffer","data":[165,249,142,201,6,161,150,214,97,255,60,214,118,72,134,44,98,90,171,39]},"announce":[],"urlList":[]}}