{"title":"Homewrecker [2009] Dylan Vox","uid":6159838,"size":1136763697,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a70fdabe1cf7812ea877a450ea327e90c3b15956&amp;dn=Homewrecker+%5B2009%5D+Dylan+Vox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1297171693,"description":" &lt;a href=&quot;http://bayimg.com/oADAMaaDM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/oADAMaaDM&lt;/a&gt;\n\nHomewrecker (2009) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1260573/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1260573/&lt;/a&gt;\n\nHomewrecker is a gay spoof of all those melodramatic Lifetime Channel movies, and it centers around Boyd (The Lair's Dylan Vox), a young actor who wants to be a big movie star. Although he was once fired from a TV sitcom pilot called Down River because he wasn't attractive enough, five years later Boyd is now a muscular hunk with a brand new look--with a little help from his most devoted fan, Sheila (Eating Out's Rebekah Kochan). He decides to pursue a role on the new top-secret TV series by Down River creators--and married couple--Derrick (Peter Szeliga) and Collin (Bruce L. Hart, who also co-wrote and produced the film), who mistakenly believe that he is Shawn, the cousin of Derrick's college friend who is supposed to be coming to stay with them. Of course, Boyd sees this as a golden opportunity to infiltrate his way into the couple's lives, and the rest of the film has &quot;Shawn&quot; using any means necessary to become a TV star--including sex and blackmail. \n\n  Dylan Vox  ...  Shawn Johnson  \n  Bruce L. Hart  ...  Collin Lawrence  \n  Peter Szeliga  ...  Derrick Hardy  \n  Rebekah Kochan  ...  Sheila  \n\n\nAdapted from Hart and Paul Vander Roest's play, Naked Deception, and directed by Paul Hart, Homewrecker is now a light and silly feature-length film with a catchier title. I would highly recommend it for Dylan Vox fans and anyone looking for some mindless entertainment.\n\nThe acting in Homewrecker is mostly over-the-top, but Szeliga and Hart do make a cute and believable couple. And if I had to select someone for best acting honors, I would choose Lukas Roberts, who provides the most laughs as Derrick and Collin's flamboyant friend, Rex. Unfortunately, the comedic talents of Kochan are completely wasted as the actress is given very little to do with her limited screen time and underwritten character.\n\nHowever, if you're a fan of Mr. Vox, who is also known as gay porn star Brad Benton, then this flick is for you. With his curled upper lip and husky voice, Vox sneers and cackles his way through the script's many twists and turns with wild abandonment. He's the evil Eve Harrington of this show who will do anything to become a star--even bare his fine backside for the camera (sorry, no full frontal). \n\nWhile completing post production for &quot;Homewrecker&quot; the producers were surprised to get a call from their color correction lab. It seems this lab has a extreme case of homophobia. They refused to work on the film even though they had a contract. The reason given: it made them uncomfortable due to all the gay characters. \n\nWhen &quot;Homewrecker&quot; was released via Artiztical Entertainment, Proposition 8's denial of marriage to gay couples was in full swing in California so brothers Paul and Bruce L. Hart altered their comedy to show their support for marriage equality.\n\nSays Paul Hart, who directed the film, &quot;Our film involves three gay couples and we wanted to present them as married. We felt Proposition 8 was unconstitutional and would be eventually overturned. So we decided to make some adjustments to the dialogue even though we had already shot the entire film.&quot;\n\nWhat they did was go back into the sound studio and dub over all of the dialogue where the characters refer to each other as &quot;partners&quot; and substitute the word &quot;husband&quot;. Adds producer Bruce L. Hart, &quot;Although this film is pure comedy and not political we wanted to show our support for the repeal of Prop 8. It was a tiny change but one we felt was necessary.&quot;\n\n","torrent":{"xt":"urn:btih:a70fdabe1cf7812ea877a450ea327e90c3b15956","amp;dn":"Homewrecker+%5B2009%5D+Dylan+Vox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a70fdabe1cf7812ea877a450ea327e90c3b15956","infoHashBuffer":{"type":"Buffer","data":[167,15,218,190,28,247,129,46,168,119,164,80,234,50,126,144,195,177,89,86]},"announce":[],"urlList":[]}}