{"title":"[swelog]Bulletstorm_CRACKFIX_READNFO-FLT","uid":6199102,"size":25206,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a98ce966e7b28908e68cd066fa4e08dae1bca7f0&amp;dn=%5Bswelog%5DBulletstorm_CRACKFIX_READNFO-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"swelogz","files":3,"time":1298547733,"description":"bulletstorm/\n\nANSiJEDACiD\n\nIn Their 24th Year Of Glory, FairLight Released #999\n\nBulletstorm CRACKFIX (c) Electronic Arts\n\n:  Supplied by: FAIRLIGHT            : : Release Date: 24/02/2011\nCracked by:  FAIRLIGHT              Game Type: FPS\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: DVD                          Protection: G4WL\n\nSystem Requirements: Lysergic acid diethylamide\n\nGame Information\n=================\n\nKill with Skill. Incredible New &quot;Skillshot&quot; System - Every enemy presents a\nnew opportunity for stylish, over-the-top and ever increasingly bloody ways\nto take them down. The Circle of Awesome - Kill with Skill to rack  up  the\npoints. Cash in these points for upgrades. Use these upgrades to  pull  off\ncrazier &quot;skillshots&quot; and earn even more points. Badass Weaponry - From  the\nplayer's trusty Peace Maker Carbine to the explosive Flail Gun, Bulletstorm\ndelivers an arsenal of the most inventive, death-dealing weapons ever seen.\n\nCrackfix Information\n=====================\n\nSkidrow's quick  and poor approach  at  making a  crack for  this  game  has\nresulted in crashes for many  people. This is due to  their memory  patching\nonly working with an older version of xlive.dll. Their crack only works with\nthe GFWL client shipped with the game. Obviously to produce a proper  before\nwe  had  noticed our error  and had time to finish our  crackfix they didn't\nthink about future versions of xlive working with their crack. An update was\nalready out,  v3.4.18.0 of  the xlive.dll  and Skidrow's crack  is  redemeed\nuseless already and crashes for people with that build.  Eventually everyone\nwill experience this crash once they do update their GFWL client as its used\nsystem wide, not just on this game... and we doubt they keep updating  their\ncrack for each new GFWL version that comes out in the years  to  come.  Even\nif that is the case we don't think you want to wait for  them to do so  each\ntime. It would be  more or less like  them releaseing a  new version of  the\ncrack each  time the Steam client was updated\n\nWe also don't accept other groups nuking for false reasons. This is  related\nto their  claim that  our release is  corrupting  the saved  games. This  is\ncompletely untrue and  just  thrown  in  there  to  make their  proper  seem\njustifiable. What you in Skidrow may have encounterd is the  fact  that  our\nsaves use a  different Xuid and  aren't  encrypted  using  GFWL. Hence  they\ndisappeared from when playing with GFWL\n\nHere is our crackfix, as  it now enables all settings (video settings worked\nbefore, this is why we missed this in our first crack) to be saved and works\nno  matter what  version of  GFWL you have  installed  and will  never  stop\nworking because of GFWL updates. Also note that if  you  used  our  previous\ncrack your savegames will still work with this one\n\nInstallation Information\n========================\n\nIf you only installed our previous  release  and  not  the  other  group's\ncrackfix (did you  need  it  anyways?), just copy over our fixed xlive.dll\nto your existing BinariesWin32 game folder. Now your done\n\nIf you replaced  our  release, or  parts  of  it  already  with  mentioned\ncrashing crack, uninstall  it  first (unless you kept backups) and  repeat\nthe instructions given in  our  main  release.  Finally, copy/replace  the\nxlive.dll from this crackfix to the BinariesWin32 game folder as  before\n\nEnjoy a fully working release now without any worries of getting in a bind\nwith future G4WL updates\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\nbulletstorm/\n\n","torrent":{"xt":"urn:btih:a98ce966e7b28908e68cd066fa4e08dae1bca7f0","amp;dn":"%5Bswelog%5DBulletstorm_CRACKFIX_READNFO-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a98ce966e7b28908e68cd066fa4e08dae1bca7f0","infoHashBuffer":{"type":"Buffer","data":[169,140,233,102,231,178,137,8,230,140,208,102,250,78,8,218,225,188,167,240]},"announce":[],"urlList":[]}}