{"title":"LEGO STAR WARS III: THE CLONE WARS BY JKRILIN","uid":6282820,"size":134217728,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:a9b694f732126b158db6aa9950eb048dd3336098&amp;dn=LEGO+STAR+WARS+III%3A+THE+CLONE+WARS+BY+JKRILIN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gaditano_cc","files":1,"time":1301504603,"description":"En poco mÃƒÂ¡s de un mes LEGO Star Wars III:  The Clone Wars llegarÃƒÂ¡ a las tiendas! A partir de hoy mismo, ya puedes descargar la demo del videojuego para Xbox360 y PS3.\n\nAdemÃƒÂ¡s, confirmamos que la fecha de disponibilidad de la versiÃƒÂ³n para Nintendo 3DS de LEGO Star Wars III: The Clone Wars es 25 de marzo, coincidiendo con la salida al mercado de la nueva consola de Nintendo.\nPodrÃƒÂ¡s disfrutar de tus personajes Jedi favoritos como Anakin Skywalker, Obi-Wan Kenobi y Ahsoka Tano. O formar parte del grupo separatista, de la mano del CapitÃƒÂ¡n Rex o del Comandante Cody. La versiÃƒÂ³n 3DS del tÃƒÂ­tulo incluye nuevas modalidades de juego, que permiten crear y controlar desde la consola los momentos mÃƒÂ¡s divertidos de la serie de televisiÃƒÂ³n. Con escenarios realizados al completo en 3D, la nueva versiÃƒÂ³n para dispositivos portÃƒÂ¡tiles permite disfrutar de combates en el espacio y mini-juegos adicionales, como la guerra de bolas de nieve o la partida de volleyball con droides. AdemÃƒÂ¡s, las funcionalidades de Nintendo 3DS Street Pass y Play Coins permitirÃƒÂ¡n desbloquear nuevos personajes y descargar contenidos adicionales.\n\n","torrent":{"xt":"urn:btih:a9b694f732126b158db6aa9950eb048dd3336098","amp;dn":"LEGO+STAR+WARS+III%3A+THE+CLONE+WARS+BY+JKRILIN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b694f732126b158db6aa9950eb048dd3336098","infoHashBuffer":{"type":"Buffer","data":[169,182,148,247,50,18,107,21,141,182,170,153,80,235,4,141,211,51,96,152]},"announce":[],"urlList":[]}}