{"title":"R.E.M. - Green (1988) WMA320","uid":6153656,"size":112009895,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9d08ae45941cd4b15fd2dc6b9d036808f63256c&amp;dn=R.E.M.+-+Green+%281988%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1296963586,"description":"&quot;Green&quot; is a very bizarre album - and I mean this in the best possible way. The year is 1988 and R.E.M., for the past seven years, having being the champions and yardstick for alternative and independent music, ditch their label IRS and sign with Warner Bros. Sellout? Opinion was (and still is) divided. &quot;Green&quot; is often measured as the end of the &quot;old&quot; R.E.M. and the beginning of a new, commercialised wannabe supergroup. The album features bright, bubblegum songs such as &quot;Pop Song 89&quot;, &quot;Get Up&quot; and &quot;Stand&quot; - the last one becoming a huge hit due to its radio friendliness - something which R.E.M. had always avoided. Michael Stipe's singing has become much clearer (however this had already been underway since 1986's &quot;Lifes Rich Pageant&quot;) and, shock horror, the entire lyrics to a song (&quot;World Leader Pretend&quot;) are printed on the sleeve. Is &quot;Green&quot; the end of R.E.M. as we know it? In the humble opinion of this writer, no. Allow me to elucidate. True, the &quot;bubblegum/pop song&quot; factor IS prevalent on &quot;Green&quot;, in the songs mentioned above. However, they still have that subversive touch that is true to R.E.M. The opener, &quot;Pop Song 89&quot; lifts ideas from The Doors' &quot;Hello, I Love You&quot; and seems to be a selection of platitudes and chat-up lines. &quot;Stand&quot; seems to be an overall, life affirming song about...well, life itself and &quot;Get Up&quot; is a song about the conflict between dreaming and getting out and living life - their contradictory nature, they both &quot;complicate&quot; and &quot;complement&quot; the singer's life. True, they all seem straightforward, but you can't help notice that in all these songs, Michael Stipe may be winking at us. He could be being sarcastic or sincere - perhaps both - it is this ambiguity that IS the subversion that characterises R.E.M.'s music; and it is no less present on &quot;Green&quot; than it is on their earlier albums. The accusations of selling out to commercialism don't seem to stick. A song like &quot;Orange Crush&quot; is the ultimate R.E.M. song - a song that leaves the listener asking &quot;What the hell is this about?&quot; while at the same time leaving an impact. It is a hard hitting song; while it may not leap out at you with answers, something clicks somewhere. Other songs on the album are similar - &quot;World Leader Pretend&quot; (in my opinion one of their best songs EVER) is a mellow tale of self reflection, self awareness and, ultimately, self hatred. The fact that the lyrics are printed (even though Stipe's vocals are totally understandable anyway) is almost the singer wanting to make his point crystal clear. However, the words don't make a lot of sense when simply read - when they are FELT things become clearer; another facet of R.E.M. - passion, not simply words, make the songs easier to relate to. &quot;Green&quot; IS a bizarre album - it is also very good; their first effort on a major label, with songs that are speciously commercial but still retain the R.E.M. brilliance. Other songs are testimony to this - &quot;You Are the Everything&quot; is beautiful. It's simple combination of mandolin, bass, accordion and vocals, but the song has such a haunting quality. It's inspiring and makes you want to live life in all its beauty. &quot;The Wrong Child&quot; is difficult to listen to; it is a cacophony of relentless singing, without any real melody to speak of. However, it is heartfelt and soulful. I don't think any other rock band has done a song about a disabled child. &quot;Turn You Inside Out&quot; and &quot;Hairshirt&quot; are probably the album's lesser moments. The first is interesting - a very nasty song about power and manipulation, but is seems very restricted and doesn't really go anywhere (LOVE the opening though!) and &quot;Hairshirt&quot; is a pale imitation of the album's other acoustic tracks. &quot;I Remember California&quot; is another haunting piece, with a simple but excellent guitar riff, while the album ends, with typical R.E.M. slyness, with a nameless track. &quot;Green&quot; is not just a good album; it is a great one. It is a band who have taken another step forward; signing to a huge record company after seven years with an alternative label is guaranteed to make fans wary. However, &quot;Green&quot; passes the test; it's an album with the same touches of brilliance as &quot;Murmur&quot;. They have lost nothing of their old selves, but they have also become more mature. Let's hope history judges &quot;Green&quot; fairly. \n\nby Brian May\n\nTRACKLIST:\n\n01 - Pop Song 89.wma                                             \n02 - Get Up.wma                                                  \n03 - You Are The Everything.wma                                  \n04 - Stand.wma                                                   \n05 - World Leader Pretend.wma                                    \n06 - The Wrong Child.wma                                         \n07 - Orange Crush.wma                                            \n08 - Turn You Insideout.wma                                      \n09 - Hairshirt.wma                                               \n10 - I Remember California.wma                                   \n11 - This World Is Big.wma    \n\nWMA 320Kbps 44100Hz STEREO\n\nDEDICATED TO azza1969","torrent":{"xt":"urn:btih:a9d08ae45941cd4b15fd2dc6b9d036808f63256c","amp;dn":"R.E.M.+-+Green+%281988%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d08ae45941cd4b15fd2dc6b9d036808f63256c","infoHashBuffer":{"type":"Buffer","data":[169,208,138,228,89,65,205,75,21,253,45,198,185,208,54,128,143,99,37,108]},"announce":[],"urlList":[]}}