{"title":"Rumpole andthe Golden Thread - John Mortimer","uid":6206319,"size":133775497,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9d91a8d8f579a7d9b441c0d51eee8fbeb87e9ba&amp;dn=Rumpole+andthe+Golden+Thread+-+John+Mortimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":10,"time":1298820646,"description":"Unabridged and read by Bill Wallis. 9 hours 16 mins duration. 8 CD's. (32kbps / 22 kHz Mono, Fraunhofer CBR ) \n\n \n[1983] \nThe Golden Thread that the great British defence attorney, Horace Rumpole, refers to is an inalienable presumption in British Common Law, that any individual brought before the bar for judgement has a presumption of innocence in his/her favour, i.e. that we are all presumed innocent until we are proven guilty beyond a reasonable doubt to twelve good people true (our peers). This holds whether in Old Bailey, or the wilds of darkest Africa--wherever the British system of justice has taken root and grown. Rumpole is a loveable old curmudgeon, writing his memoirs about cases he has tried before the Bar. There are six stories in this book: \n\nRumpole and the Genuine Article, where a painting's genuine nature is in dispute;\nRumpole and the Golden Thread, where he goes to a former British colony in Africa to see justice done;\nRumpole and the Old Boy Net, about a &quot;friendly house&quot; and a charge of blackmail;\nRumpole and the Female of the Species, where he uses manipulation to get a young girl barrister hired in their Chambers; \nRumpole and the Sporting Life, where he defends the said barrister's sister, who is charged with murdering her husband, a successful and well-loved jockey;\nRumpole and the Last Resort, wherein he is broke, and left by his wife Hilda (whom he calls She Who Must Be Obeyed); he collapses in court while pleading a case, and the aftermath.\n\n* Bill Wallis is my favourite Rumpole narrator.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a9d91a8d8f579a7d9b441c0d51eee8fbeb87e9ba","amp;dn":"Rumpole+andthe+Golden+Thread+-+John+Mortimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d91a8d8f579a7d9b441c0d51eee8fbeb87e9ba","infoHashBuffer":{"type":"Buffer","data":[169,217,26,141,143,87,154,125,155,68,28,13,81,238,232,251,235,135,233,186]},"announce":[],"urlList":[]}}