{"title":"Prince Of Persia-The Sand Of Time","uid":6236800,"size":627785860,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:abdfc84eadb12ec98f3ac3bb625439d7d13c77b3&amp;dn=Prince+Of+Persia-The+Sand+Of+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sukusuman","files":2,"time":1299905060,"description":"Prince of Persia: The Sands of Time is a 2010 sword-and-sorcery action film written by Jordan Mechner, Boaz Yakin, Doug Miro, and Carlo Bernard; directed by Mike Newell; produced by Jerry Bruckheimer; and distributed by Walt Disney Pictures. The film is a retelling of the 2003 video game of the same name, developed and released by Ubisoft Montreal.\n\nThe film stars Jake Gyllenhaal as Prince Dastan, Gemma Arterton as Princess Tamina, Ben Kingsley as Nizam, and Alfred Molina as Sheik Amar.\n\nThe film has the same title as the video game Prince of Persia: The Sands of Time, and is primarily based on it. Elements from Prince of Persia: Warrior Within and Prince of Persia: The Two Thrones, two other titles from the Prince of Persia video game franchise, are also incorporated. However, apart from the basic elements such as treachery and the Sands of Time, the film\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s plot is quite distinct from that of the video game franchise. For example, the film is focused on stopping the antagonist from releasing the Sands, whereas in the game the Prince must fight past hordes of sand monsters to seal the Sands of Time back into the hourglass.\n\n\n\n\n\n\n\n\n\nPLEASE SEED &amp; HAVE FUN!!!!","torrent":{"xt":"urn:btih:abdfc84eadb12ec98f3ac3bb625439d7d13c77b3","amp;dn":"Prince+Of+Persia-The+Sand+Of+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abdfc84eadb12ec98f3ac3bb625439d7d13c77b3","infoHashBuffer":{"type":"Buffer","data":[171,223,200,78,173,177,46,201,143,58,195,187,98,84,57,215,209,60,119,179]},"announce":[],"urlList":[]}}