{"title":"Coast to Coast - Apr 01 2011 - Poltergeists &amp; Open Lines","uid":6290718,"size":55810992,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ac862775acf63e71fc5311e3c509a3bef2ef87fe&amp;dn=Coast+to+Coast+-+Apr+01+2011+-+Poltergeists+%26+Open+Lines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":5,"time":1301801472,"description":"Poltergeists/Open Lines\n\nDate: 04-01-11 \nHost: George Noory \nGuests: Michael Clarkson, Open Lines \n\nIn the first half, investigative reporter Michael Clarkson (book link) talked about his research into poltergeists and paranormal phenomena. Having reviewed 75 cases of alleged poltergeist activity, Clarkson contended that &quot;we're dealing with haunted people rather than haunted buildings.&quot; He pointed to high stress levels in adolescents entering puberty as a common denominator amongst the cases he's investigated. Additionally, Clarkson said that research done on these &quot;poltergeist agents&quot; after the activity had dissipated revealed that they suffer from a &quot;slightly higher rate of epilepsy and schizophrenia.&quot; When all of these factors come together, he said, it forms the &quot;perfect psychic storm&quot; which manifests itself as &quot;recurrent spontaneous psychokinesis,&quot; where objects are seemingly moved by unseen forces. \n\nBased on his research, Clarkson surmised that this &quot;poltergeist energy&quot; only lasts a few weeks to a couple of months and generally tends to dissipate as the stress levels in the home decrease. He dismissed the idea that poltergeist activity is evil, as the cases he's investigated suggest a &quot;mischievous intent&quot; rather than outright malevolence. Clarkson credited the reports of police officers who investigated poltergeist incidents as key sources for his research, since law enforcement officials risk their credibility by providing honest accounts of the strange activity they have witnessed. Conversely, Clarkson lamented that victims of poltergeist activity are often reticent to bring in paranormal investigators, due to fear of ridicule or media attention, and, if they do so, it happens when the activity has begun to dissipate. \n\n--------------------- \n\nThe latter half of the show featured Open Lines and included Leanne in Alabama warning of psychic dreams she has been having which portend the end of the world. Having had previous premonitions which came true, she was particularly troubled by these recent apocalyptic visions. In these dreams, Leanne said, she is in a barren field where there were once houses that have now disappeared. She then manages to find a ride to civilization, but, upon her arrival, the people there soon die and their houses vanish as well, leaving Leanne alone again. So vivid are these dreams, she said, that she wakes up begging God to &quot;just take me&quot; so that she is not the last person left on Earth. Chillingly, she also revealed that her grandmother and mother have been having the same dreams.\n\nLater, Gretchen in North Hollywood talked about her conversion to veganism and how it has improved her life. Saying that her whole family switched to a vegan lifestyle ten years ago, she claimed that they have all seen significant weight loss without dieting or exercise. &quot;It just happens,&quot; she said, &quot;the weight just falls off people. I've seen it so many times.&quot; Gretchen implored people to switch to a &quot;plant-based diet,&quot; since it will benefit their health and also be merciful to animals. Other callers during the evening included Curtis in Atlanta who shared the story of his friend's ghost encounter which nearly killed him and April in Utah who gave George &quot;an energy gift&quot; via the phone. \n\nIn the final half hour, George paid tribute to the late Jose Arguelles by playing a portion of his 4/1/2009 C2C appearance. \n\nNews segment guests: Mitch Battros &amp; Catherine Austin Fitts. \n\nBook(s): \nThe Poltergeist Phenomenon \nPoltergeists \n\nthanks for helping to seed","torrent":{"xt":"urn:btih:ac862775acf63e71fc5311e3c509a3bef2ef87fe","amp;dn":"Coast+to+Coast+-+Apr+01+2011+-+Poltergeists+%26+Open+Lines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac862775acf63e71fc5311e3c509a3bef2ef87fe","infoHashBuffer":{"type":"Buffer","data":[172,134,39,117,172,246,62,113,252,83,17,227,197,9,163,190,242,239,135,254]},"announce":[],"urlList":[]}}