{"title":"Teeny Tucker...Two Big M's(2008)[FLAC]","uid":6241693,"size":221045230,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ae7949c28cb43f87a2c7046f9cdb84d6aa24c831&amp;dn=Teeny+Tucker...Two+Big+M%5C%27s%282008%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":14,"time":1300090860,"description":"[img]http://image.allmusic.com/00/amg/cov200/drj800/j821/j82151lz627.jpg[/img]\n[color=Blue]2008 Two Big M's CD TeBo 30190 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  Hound Dog -Leiber, Stoller 2:50 \n  2  Unlucky Girl -Dupree, Thornton 3:04 \n  3  Bumble Bee -Lawler, Thornton 3:44 \n  4  Rockhouse -Duffy 2:24 \n  5  Ramblin Blues -Mendelsohn, Smith 3:24 \n  6  Whole Lotta Shakin -Williams 3:16 \n  7  Saint Louis Blues -Handy, Henderson 2:46 \n  8  Sassy Mama F-ields, Thornton 3:54 \n  9  Two Big M's -Hughes, Tucker, Westbrook 5:48 \n  10  Heavy Load -McDowell, Thornton 3:10 \n\nWhen Maria Muldaur recorded her fine blues-trilogy album recently,I liked them but was not completely won over - there was something artificial about Muldaur singing songs by early blues stars and althought she was sincere and her heart was in the right place,I would have prefered someone who actually has stronger connections with blues (Muldaur was child of folkie era and jug bands).No worries,Teeny Tucker is here and she is real thing - not only she has right background (her father was famous &quot;Hi Heel Sneakers&quot; composer Tommy Tucker) but girl also has right attitude,passion and booming voice to cover classics and has no need to step back when facing material sung by music giants from another era,she is right there with them.\nIt was Amy Winehouse who somehow brought retro-soul back on charts and ever since we have musicians going back to old school,probably because right now old school simply sounds better than any of alternatives.Teeny Tucker sound goes even further back,we are talking about early 1950s r&amp;b/blues when powerful voices like  Big Maybelle (&quot;Candy&quot;) or Big Mama Thornton (&quot;Hound dog&quot;,&quot;Ball and Chain&quot;) hardly ever crossed on national charts in original versions but white singers had hits with their own whitewashed covers of their songs.(LaVern Baker could tell you thing or two about it,she even went to court to stop Georgia Gibbs covering her songs note by note) This album is actually tribute to both Thornton and Maybelle and as such is truly enjoyable and honest look at music that inspired many musicians back than but somehow still sound fresh and right even today - nothing old-fashioned here,no electronic tricks either,just simply good music that can be played and danced to.Something to crack the volume up and sing your heart out while driving or even shaking the bootie when nobody see you around the house.\n&quot;Hound dog&quot;,&quot;Whole lotta shakin' going on&quot; and &quot;Bumble Bee&quot; are just some of the highlights here,other might point at excellent backing band and playing of guitarist Robert Hughes,pianist Vernon Hairston or vocal trio that sounds like Raelettes behind Ray Charles.The biggest surprise comes at the end when in &quot;Heavy load&quot; Tucker voice suddenly comes in &quot;old&quot; mono sound accompanied only with guitar and it truly sound like something recorded decades ago,it could have been Memphis Minnie moaning at sunset at the crossroads and than having one more for the road,truly inspired ending of a perfect album.More please.\nP.S. It speaks volumes that this jewel of the album is self-produced as big companies would not touch something that is &quot;not commercial&quot; enough.\nPersonaly,I could throw all of Britneys and Celines and Kylies of this world out of the window for exchange for music like this,real music with passion,fire and joy.There is Angela Brown still singing blues like this but for some reason Brown and Tucker are known to only you and me while plastic rules the charts,damn.\n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2011/02/23/teeny-tucker/[/url]","torrent":{"xt":"urn:btih:ae7949c28cb43f87a2c7046f9cdb84d6aa24c831","amp;dn":"Teeny+Tucker...Two+Big+M%5C%27s%282008%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7949c28cb43f87a2c7046f9cdb84d6aa24c831","infoHashBuffer":{"type":"Buffer","data":[174,121,73,194,140,180,63,135,162,199,4,111,156,219,132,214,170,36,200,49]},"announce":[],"urlList":[]}}