{"title":"Kinky - Mexican Radio  (2nafish)","uid":6148988,"size":125755396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:af12ded80cc8a5310df854ede3cb829bd76a30e2&amp;dn=Kinky+-+Mexican+Radio++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1296810091,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Mexican Radio&quot; is a song written and performed by the band Wall of Voodoo, and produced by Richard Mazda. The track was initially made commercially available on their 1983 album Call of the West. The song peaked at #58 on the Billboard Hot 100 chart in the U.S. while peaking at #58 in the U.K, #33 in Australia, and #21 in New Zealand.\n\nKinky, a Mexican electronic/rock band from Monterrey Mexico has covered this song as well. They kept the upbeat rhythm of the song with their own electronic twist and added some lyrics in Spanish. This version is in their album Reina De Lujo, and their Sassy EP, and also is featured in Need for Speed Undercover.\n\nReina is a self produced album by the Mexican electro-pop band Kinky. It was released on September 5, 2006 on Nettwerk. The album's lyrics are sung more in English than Spanish, unlike Kinky's two preceding albums, Kinky (2002) and Atlas (2003). Reina is a mixture of many musical styles with electronica, Latin percussion, traditional Mexican accordion, heavy rock electric guitars and bass guitars all occupying the same musical space. Guest singer Colin Hay of Men at Work provides guest vocals on &quot;Monday Killer.&quot; &quot;How Do They Do That?&quot; has even drawn comparisons to the 1990s American alternative rock group Morphine.\n\nA music video was released for the lead song, &quot;Sister Twisted&quot;, in September 2006. In the music video, a Mexican cowboy, played by David Bernal, does a twisted locking and popping while a war against aliens occurs in the background.\n\nThe album received mixed reviews.\n\nReina was re-released on Feb. 5th, 2008 with two additional tracks: a new remix of &quot;A Donde Van Los Muertos&quot; by Brazilian Girls and a cover of Wall of Voodoo's hit, &quot;Mexican Radio.&quot;\n\nKinky is a five-member band from Monterrey, Nuevo Leon, Mexico, formed in 1998 and consisting of Gilberto Cerezo, Ulises Lozano, Carlos Chairez, Omar GÃƒÂ³ngora, and Cesar Pliego. The band's music is heavily influenced by Latin music, rock, dance, and techno. Although a majority of songs are sung in Spanish, some songs contain English lyrics. Since the release of their studio album, Kinky have been signed with Sonic360 Records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:af12ded80cc8a5310df854ede3cb829bd76a30e2","amp;dn":"Kinky+-+Mexican+Radio++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af12ded80cc8a5310df854ede3cb829bd76a30e2","infoHashBuffer":{"type":"Buffer","data":[175,18,222,216,12,200,165,49,13,248,84,237,227,203,130,155,215,106,48,226]},"announce":[],"urlList":[]}}