{"title":"Coast to Coast AM - 2011-01-18 - Quantum Thinking","uid":6160854,"size":54163660,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b06952160e8bc0c5cff37e3bc12d163707124173&amp;dn=Coast+to+Coast+AM+-+2011-01-18+-+Quantum+Thinking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1297208041,"description":"Date: \t01-18-11\nHost: \tGeorge Noory\nGuests: \tAmit Goswami, Marshall Klarfeld\n\nProfessor emeritus in the physics department of the University of Oregon, Dr. Amit Goswami discussed a plan of action that involves applying &quot;quantum thinking&quot; to a variety of societal issues. In the new way of looking at science, we say that consciousness is the ground of all being, rather than matter, he noted, adding that &quot;you've got to wake up to quantum physics because it is connected with your everyday aspirations, everyday happiness.&quot;\n\nGoswami has put forward the idea of &quot;quantum activism,&quot; a kind of manifesto for changing oneself and the world, based on the power of consciousness. He listed three components to personal transformation-- right thinking (getting away from a materialist world view, and recognizing the primacy of consciousness), right living (learning to relax within activities, and focus on being open to possibilities), and right livelihood (finding an occupation that has meaning built into it, and allows for spare time).\n\nDiscontinuity, change, and even catastrophe are how we discover new meaning, which can lead to creative evolution and quantum leaps, he suggested. Negativity, which is sometimes bred into our way of thinking, takes us away from wholeness, he observed. Interestingly, Goswami called the CERN/Hadron Collider project (to discover the so-called God Particle) an expensive &quot;boondoggle.&quot; No one doubts that this particle exists, and its finding has no relevance in the way we should live, he commented.\nCloning a Woolly Mammoth\n\nFirst hour guest, author Marshall Klarfeld commented on the plan to clone a woolly mammoth from intact DNA of the extinct creature. The initial experiment would involve an elephant acting as a surrogate mother, providing an egg, so the clone would only be half-mammoth, he pointed out.\n\nNews segment guest: Christian Wilde\nWebsite(s):\n\n    * amitgoswami.org\n    * QuantumActivist.com\n    *\n\nBook(s):\n\n    * How Quantum Activism Can Save Civilization\n    * The Self-Aware Universe\n    * God is Not Dead\n    * Adam, The Missing Link\n","torrent":{"xt":"urn:btih:b06952160e8bc0c5cff37e3bc12d163707124173","amp;dn":"Coast+to+Coast+AM+-+2011-01-18+-+Quantum+Thinking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b06952160e8bc0c5cff37e3bc12d163707124173","infoHashBuffer":{"type":"Buffer","data":[176,105,82,22,14,139,192,197,207,243,126,59,193,45,22,55,7,18,65,115]},"announce":[],"urlList":[]}}