{"title":"PC Streams v1.4","uid":6292356,"size":6887814,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b0dd1459e4afebdcc349110f6c8f5afc521e4adf&amp;dn=PC+Streams+v1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"timbukje","files":1,"time":1301865619,"description":"                         PC Streams v1.4\n\n\n\nWith PC Streams you can watch free soccer from the Dutch Eredivisie, Premier League, Bundesliga, Primera Division, Serie A, Jupiler League, UEFA Europa League, UEFA Champions League\nJust install the program and you can see what games are broadcasted and where to find them.\nAditional software like veetle, tvu, sopcast is sometimes needed ( included in program ) but also there are flash streams available\n\n\n\nMit PC Streams kÃƒÂ¶nnen Sie freiem FuÃƒÅ¸ball vom hollÃƒÂ¤ndischen Eredivisie, Premier League, Bundesliga, Primera Division, Serie A, Jupiler League, UEFA Europa League, UEFA Champions League\nNur das Programm instalieren und Sie kÃƒÂ¶nnen sehen welche Spiele live sind, und wo du sie finden kanst.\nExtra software wie veetle, tvu, sopcast ist manchmal notwendig ( ist im das programm ) aber es gibt auch es gibt auch flash streams.\n\n\n\nMet PC Streams kijk je gratis voetbal uit de Eredivisie, Premier League, Bundesliga, Primera Division, Serie A, Jupiler League, UEFA Europa League, UEFA Champions League|\nJe hoeft alleen het programma te instaleren en je kunt zien wat er wordt uitgezonden en waar je het kan vinden.\nExtra software zoals veetle, tvu, sopcast is soms nodig ( zit bij de instalatie ) maar er zijn ook flash streams beschikbaar","torrent":{"xt":"urn:btih:b0dd1459e4afebdcc349110f6c8f5afc521e4adf","amp;dn":"PC+Streams+v1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0dd1459e4afebdcc349110f6c8f5afc521e4adf","infoHashBuffer":{"type":"Buffer","data":[176,221,20,89,228,175,235,220,195,73,17,15,108,143,90,252,82,30,74,223]},"announce":[],"urlList":[]}}