{"title":"Coast to Coast AM - 2011-01-19 - ET Communications","uid":6160859,"size":55017788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b11669a9c97a7348d3cff57bbe5ab6670149177d&amp;dn=Coast+to+Coast+AM+-+2011-01-19+-+ET+Communications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1297208091,"description":"Date: \t01-19-11\nHost: \tGeorge Noory\nGuests: \tMichael Ellegion, Aurora Light, Jerome Corsi\n\nChannelers and contactees Michael Ellegion and Aurora Light (third hour) spoke about ET communications, encounters and interventions. Ellegion described going onboard a spaceship in 1979, and told he would have contacts with a being named Ashtar (whom he later channeled). Contacts with benign, human-appearing ETs such as what he, Aurora, and other contactees like Billy Meier have experienced have been suppressed or debunked in favor of stories of sinister grey aliens and abductions. &quot;I think there was a massive agenda and bias against anything that's uplifting...and helps empower and prepare us for the time that is coming ahead,&quot; he commented.\n\nWe could see the mass appearance of UFOs, in a series of waves possibly within the next two years, to help humanity deal with the upheaval and changes that are coming, Ellegion outlined. This could involve a mass evacuation of vibrationally attuned individuals, he added. The arrival of Planet X or Wormwood has been confirmed by his ET contacts. He described it as a dwarf star on an elliptical orbit that may or may not have catastrophic effects on Earth this time around.\n\nAurora Light detailed her encounters with ETs while living in Michigan, including a dramatic intervention in which she was saved from an impending car accident, and experienced frozen time and telepathic communications. She also spoke about seeing a medium handle Dr. Ray Brown's &quot;Atlantean&quot; crystal, in which it changed colors and looked like &quot;neon Jello.&quot;\nMexican Trucks in US\n\nFirst hour guest, author Jerome Corsi commented on the Obama administration plan to open US highways to Mexican trucks. He expressed concern that illegal contraband could be hauled on the Mexican vehicles, and that the plan is part of a globalist agenda to undercut American truck and rail workers. More here.\n\nNews segment guest: Mish Shedlock\nWebsite(s):\n\n    * prepareforthelandings.com\n    * channelforthemasters.com\n    * vortexnetworknews.com\n    * healthgalleria.com\n    * jeromecorsi.com\n    * gilfordsecurities.com\n\nVideo(s):\n\n    * LORD ASHTAR &quot;Divine Intervention and the Activation of the Light Guardians&quot;\n\nBook(s):\n\n    * Prepare for the Landings!\n    * The Late Great U.S.A.: The Coming Merger With Mexico and Canada\n","torrent":{"xt":"urn:btih:b11669a9c97a7348d3cff57bbe5ab6670149177d","amp;dn":"Coast+to+Coast+AM+-+2011-01-19+-+ET+Communications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11669a9c97a7348d3cff57bbe5ab6670149177d","infoHashBuffer":{"type":"Buffer","data":[177,22,105,169,201,122,115,72,211,207,245,123,190,90,182,103,1,73,23,125]},"announce":[],"urlList":[]}}