{"title":"Dude Wheres My Car(2000)DVDRip.AC3(ENG)-DROCK","uid":6247532,"size":733092957,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b16baae4c3615bfe5f3a30c8b68be408cf8d6652&amp;dn=Dude+Wheres+My+Car%282000%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300282924,"description":"The startling effects of chemically induced short-term memory loss provide the backdrop for this resinous teen comedy. Jesse (Ashton Kutcher) and Chester (Seann William Scott) are two hard-partying dudes who wake up after a very long night on the town to discover they've forgotten the presents they bought for their girlfriends Wanda (Jennifer Garner) and Wilma (Marla Sokoloff), twins who are more than a bit miffed that the stoners they've come to tolerate appear to have forgotten their anniversary. The presents are in Jesse's car, but they're so fuzzy on the details of the previous 24 hours that they have no idea where they left said automobile. Jesse and Chester set out to find their wheels, and along the way they discover that they had an even more eventful evening than they imagined, as strippers, aliens, a suitcase full of money, and a kitchen full of pudding become important pieces in the puzzle of the missing car. Dude, Where's My Car? also stars Hal Sparks, Kristy Swanson, Kevin Christy, and Fabio; it was written by Philip Stark, previously a writer for the TV series That 70's Show, which also features Kutcher in its cast.\n\nRipped with Handbrake.\n\nLength: 1 Hour 23 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:b16baae4c3615bfe5f3a30c8b68be408cf8d6652","amp;dn":"Dude+Wheres+My+Car%282000%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b16baae4c3615bfe5f3a30c8b68be408cf8d6652","infoHashBuffer":{"type":"Buffer","data":[177,107,170,228,195,97,91,254,95,58,48,200,182,139,228,8,207,141,102,82]},"announce":[],"urlList":[]}}