{"title":"One School DVD","uid":6169485,"size":4424435712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3bfbdc66e042e5658d919a2fbe9230b70981604&amp;dn=One+School+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Globetroller","files":27,"time":1297471087,"description":"&quot;By telling small human stories in a compelling observational way&quot;\n\n\n&quot;een simpel gegeven dat in mooie beelden de soms tragische \n werkelijkheid van Zuidoost-Turkije weergeeft&quot;\n\nDVD Turkish &amp; Kurdish\nEnglish &amp; Dutch subtitles\n\nOne year in the life of a Turkish teacher, teaching the Turkish language to \nKurdish children in a remote village in Turkey. The children can't speak \nTurkish, the teacher can't speak Kurdish and is forced to become an exile \nin his own country. On the Way to School is a film about a Turkish teacher \nwho is alone in a village as an authority of the state, and about his \ninteraction with the Kurdish children who have to learn Turkish. The film \nwitnesses the communication problem emphasizing the loneliness of a teacher \nin a different community and culture; and the changes brought up by his \npresence into this different community during one year. The film chronicles \none school year, starting from September 2007 until the departure of the \nteacher for summer holiday in June 2008. During this period, they begin to \nknow and understand each other mutually and slowly. \nWritten by Ozgur Dogan and Orhan Esikoy\n\nDocumentaire van Orhan Esikoy, Ozgur Dogan die zich op het platteland\nvan Turkije afspeelt. De jonge Turkse onderwijzer Emre krijgt een baan in \neen afgelegen Koerdisch dorpje 'in the middle of nowhere'. De overgang had \nniet groter kunnen zijn. Emre komt uit de stad, waar hij van stromend water \nen alle andere woongemakken was voorzien. Nu moet hij zich zien te redden \nin een eenvoudig huisje zonder enig comfort, in een gebied waar regelmatig \ndagenlang de stroom uitvalt. De nieuwe woonsituatie is nog tot daar aan toe, \nop het schooltje waar hij les gaat geven staan hem nog veel grotere \nuitdagingen te wachten... Allereerst moet hij de kinderen naar school zien \nte krijgen. In de eerste dagen gaat hij de huizen af om te zien of zich daar \nnog leerlingen schuilhouden. Heeft hij de kinderen eenmaal op school, dan is \ndaar het taalprobleem. De meeste kinderen spreken geen Turks en Emre spreekt \ngeen Koerdisch. Tijdens een ouderbijeenkomst probeert hij de ouders ervan te \novertuigen dat het belangrijk is dat zij hun kinderen helpen met het Turks. \nZijn pleidooi moet voor de aanwezige moeders vertaald worden, want ook zij \nspreken alleen Koerdisch. Als ze begrijpen wat de bedoeling is, halen ze \nlaconiek hun schouders op. 'Wij hebben al jaren met ze te stellen, nu ben jij \naan de beurt,' zeggen ze lachend. Een vader is cynisch: 'In die paar jaar op \nschool leren ze amper Turks.' Orhan Esikoy en Ozgur Dogan volgen Emre gedurende \nzijn eerste jaar in het dorp. Met gevoel voor humor brengen ze in beeld hoe de \ndocent en zijn leerlingen langzaam maar zeker naar elkaar toe groeien. En al \nverstaan ze elkaar na een jaar nog steeds niet zo goed, de basis voor een \nvertrouwensrelatie waarin de kinderen zich verder kunnen ontwikkelen, is gelegd.\n\nHolland Doc: &lt;a href=&quot;\nhttp://player.omroep.nl/?aflID=10187552&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://player.omroep.nl/?aflID=10187552&lt;/a&gt;\n\nBoston Turkish Filmfestival &lt;a href=&quot;\nhttp://www.bostonturkishfilmfestival.org/2010Festival/films/IkiDilBirBavul_OnTheWayToSchool.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bostonturkishfilmfestival.org/2010Festival/films/IkiDilBirBavul_OnTheWayToSchool.html&lt;/a&gt;\n\nYouTube:\n","torrent":{"xt":"urn:btih:b3bfbdc66e042e5658d919a2fbe9230b70981604","amp;dn":"One+School+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3bfbdc66e042e5658d919a2fbe9230b70981604","infoHashBuffer":{"type":"Buffer","data":[179,191,189,198,110,4,46,86,88,217,25,162,251,233,35,11,112,152,22,4]},"announce":[],"urlList":[]}}