{"title":"Democracy Now - 15 mar 2011","uid":6244916,"size":449793493,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b414a09c3a8d6a69f83354380784c860b2cf5fdb&amp;dn=Democracy+Now+-+15+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1300204704,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 15, 2011\n\n- Japan Faces Nuclear Crisis After Third Explosion At Plant\n- Radiation Leaks Force Over 70,000 To Evacuate\n- Thousands of Bodies Wash Up On Japan's Shore\n- Bahrain Declares State of Emergency; Saudi Forces Arrive to Quell Protests\n- Libya: Pro-Gaddafi Forces Close in on Rebels as No-Fly Zone Debate Persists\n- Young People Lead Massive Protests in Palestine\n- Bradley Manning's Father Speaks Out Against Son's Treatment\n- Aristide to Return to Haiti Before Elections Despite U.S. Wishes\n- Wisconsin Dems Still Held in Contempt, Votes Not Counted or Recorded\n- Iowa Considers Bill to Criminalize Undercover Videos At Farms\n- Guatemalans Intentionally Infected With Diseases Sue U.S. Government\n- Sen. Al Franken: Violations of Net Neutrality Should Be a Crime\n\n\nSpecial reports\n\n- &quot;This Could Become Chernobyl on Steroids&quot;: Nuclear Engineer Arnie Gundersen on Japan's Growing Nuclear Crisis\n\nJapan is on the verge of a nuclear catastrophe after a third explosion at the Fukushima Daiichi nuclear power plant, which was heavily damaged by Friday's 9.0-magnitude earthquake and tsunami. The blast seriously damaged the plant's Number Two reactor's steel containment structure, causing nearby radiation levels to rise to eight times the legal limit for exposure in a year. Plant workers &quot;were manually opening valves into into these containments to keep the pressure from building up,&quot; says our guest Arnie Gundersen, a nuclear engineer. &quot;I would suspect that a lot of those efforts have been abandoned because of high radiation levels.&quot;\n\n\n- Vermont Gov. Fights to Close Vermont Yankee, One of 23 U.S. Nuclear Plants Nearly Identical to Failed Japan Plant\n\nOne day before the earthquake and tsunami hit Japan and sparked a nuclear crisis, the U.S. Nuclear Regulator Commission announced it would renew the license for Vermont Yankee Nuclear Power Plant. Vermont state legislators had voted to close the plant when its license expires in 2012. The 38-year-old facility has had a series of radioactive tritium leaks, and is almost identical to the troubled Fukushima Dai-ichi plant in Japan. &quot;My heart goes out to the people of Japan in this extraordinary crisis,&quot; Gov. Peter Shumlin says, &quot;It's everyone's worst nightmare when they have aging nuclear power plants in their country or their state. Vermont is no different. We have an aging nuclear power plant owned by Entergy Louisiana, a company we found we cannot trust. It asks all of us to reexamine our policy of irrational exuberance when it comes to extending the lives of aging nuclear power plants.&quot;\n\n\n- &quot;Get the Children Away From the Reactors&quot;: Japan Urged To Expand Evacuation Area Around Nuclear Plants As Leaking Radiation Spreads\n\nJapanese anti-nuclear activist Aileen Mioko Smith and nuclear engineer Arnie Gundersen question whether Japanese officials are doing enough to protect civilians from radiation, including proper monitoring and widening the evacuation zones. Some 70,000 residents have been forced to evacuate their homes and another 140,000 people have been ordered not to step outside. &quot;You can't protect people from reality,&quot; Smith says. And Gundersen says, &quot;If I was in Japan, I would go least get the children away from the reactors. They're more susceptible. I would go at least 50 kilometers.&quot;\n\n\n- &quot;Bahrain is No Longer An Independent Country, It Is Occupied by Saudi Forces&quot;: Activist Says Pro-Democracy Protests Will Continue\n\nThe King of Bahrain has declared a state of emergency for three months following weeks of pro-democracy protests. The king's announcement comes one day after about 1,000 Saudi troops crossed into Bahrain to help defend Bahrain's ruling family. Pro-democracy protesters have described the Saudi presence on the island as a declaration of war. We speak to journalist Yana Kunichoff reporting from Manama and to Husain Abdulla of Americans for Democracy and Human Rights in Bahrain. &quot;For the White House not to condemn such an invasion makes a clear statement that the United States knew very well this was going to happen,&quot; Adbulla says.\n\n\n- Yemen Expands Crackdown on Pro-Democracy Movement, Deports Journalists\n\nAnti-government protests are swelling in Yemen amidst U.S.-backed President Ali Abdullah Saleh's refusal to step down after more than 32 years in power. On Monday, dozens were wounded after state forces opened fire on demonstrators in Marib province. As unrest grows, the Yemeni government is cracking down on international media coverage of the protests. Four journalists, including two U.S. citizens, were arrested and deported on Monday. We speak with Yemeni activist and blogger in Sana'a, Atiaf Alwazir, and to Gregory Johnsen, a Near Eastern studies scholar at Princeton University currently in Cairo.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:b414a09c3a8d6a69f83354380784c860b2cf5fdb","amp;dn":"Democracy+Now+-+15+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b414a09c3a8d6a69f83354380784c860b2cf5fdb","infoHashBuffer":{"type":"Buffer","data":[180,20,160,156,58,141,106,105,248,51,84,56,7,132,200,96,178,207,95,219]},"announce":[],"urlList":[]}}