{"title":"A FIlm Unfinished (2010) DD2.0 NL Subs --TBS","uid":6289396,"size":3828396303,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b4c52852c92fbc5dc551e96e152f7b59bdacab75&amp;dn=A+FIlm+Unfinished+%282010%29+DD2.0+NL+Subs+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1301743487,"description":"A FIlm Unfinished (2010) DD2.0 NL Subs\n\n\n\nNederlands:       \n\nNa de Tweede Wereldoorlog werd een, nu beruchte, onafgemaakte Nazi film zonder soundtrack ontdekt over het getto van Warschau. Historici zagen er een authentieke bron in voor hun werk, ook al was het duidelijk geconstrueerd als propaganda. Later werd er meer materiaal van gevonden dat de manipulatie door de cameracrews liet zien bij het filmen van 'alledaagse scenes'; welgestelde Joden die chique diners en theatervoorstellingen bijwonen en nonchalant over de dode lichamen van mede-Joden stappen, blijken onwillige acteurs die vrezen voor hun lot als ze niet meewerken.\n &lt;a href=&quot;\nhttp://www.rottentomatoes.com/m/film_unfinished/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rottentomatoes.com/m/film_unfinished/&lt;/a&gt;\n\nEnglish\n Yael Hersonski's powerful documentary achieves a remarkable feat through its penetrating look at another film-the now-infamous Nazi-produced film about the Warsaw Ghetto. Discovered after the war, the unfinished work, with no soundtrack, Film Forum...  Yael Hersonski's powerful documentary achieves a remarkable feat through its penetrating look at another film-the now-infamous Nazi-produced film about the Warsaw Ghetto. Discovered after the war, the unfinished work, with no soundtrack, Film Forum is proud to present Yael Hersonski's A FILM UNFINISHED, having its U.S. theatrical premiere on Wednesday, August 18. Since the end of WWII, one copy of a 60-minute (unfinished) propaganda film, shot by the Nazis in the Warsaw Ghetto in May 1942 (a year prior to the uprising), labeled simply &quot;Ghetto,&quot; sat undisturbed in an East German archive. A FILM UNFINISHED presents the entire film, both documentary and fictionalized sequences (e.g. dozens of Jewish patrons at an elegant restaurant; a luxurious funeral cortege). It includes a revealing interview with Willy Wist, the only cinematographer identified with the production (himself caught onscreen in his SS uniform), as well as scenes in which now-elderly former residents of the Warsaw Ghetto, reviewing the footage, occasionally recognize their neighbors, or report upon the filmmakers' efforts to stage fantasies of affluence and well-being, or of Jews treating their less fortunate compatriots with callous disdain. This is a film of enormous import: it documents conditions under which ghetto residents lived and the efforts (however imperfect) of the perpetrators to recast this reality to suggest an entirely different scenario. A FILM UNFINISHED is presented with support from the Joan S. Constantiner Fund for Jewish and Holocaust Film.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1568923&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1568923&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVDR\nAudio          : English DD 2.0 \nBron           : Downloaded from the net\nOndertitels    : NL\nGenre          : Documentaire\nCover          : Ja \n \nBrought by TBS","torrent":{"xt":"urn:btih:b4c52852c92fbc5dc551e96e152f7b59bdacab75","amp;dn":"A+FIlm+Unfinished+%282010%29+DD2.0+NL+Subs+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c52852c92fbc5dc551e96e152f7b59bdacab75","infoHashBuffer":{"type":"Buffer","data":[180,197,40,82,201,47,188,93,197,81,233,110,21,47,123,89,189,172,171,117]},"announce":[],"urlList":[]}}