{"title":"The world at war dvd 3 -10 (NLsubs)(TinkerBell) TBS","uid":6155889,"size":4519202089,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b50f778047993355120b6976ee781e842dde20ca&amp;dn=The+world+at+war+dvd+3+-10+%28NLsubs%29%28TinkerBell%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Mad_Parrot","files":35,"time":1297033778,"description":"\nThe World at War Box DVD 3-10       \n\n \nNu de hele geschiedenis van de Tweede Wereldoorlog op 5 dubbel DVD's met in totaal meer dan 30 uur materiaal!\nU wordt getuige van de opkomst van de nazi's tot en met de overwinning op Japan. In dit complete overzicht ziet u in beeld en geluid alle feiten en gebeurtenissen in deze boeiende periode van de wereldgeschiedenis.\nDe gehele serie heeft een 9.9 rating op IMDB.com en is verder alom geroemd om de volledigheid, objectiviteit en punctualiteit van deze documentaire. De gehele serie wordt van commentaar voorzien van Sir Laurence Olivier.\n\nDVD Extra's: Elke afzonderlijke DVD is voorzien van bewegende menuschermen, een fotogalerie van het Imperial War Museum; Biografieen, Kort overzicht van de Tweede Wereld Oorlog;samenvatting van de verschillende afleveringen, Toespraken, Songs, Nieuwsberichten en Overzichtskaarten.\n\nProduct Informatie DVD: Ondertiteling Nederlands, Audio Materiaal: Engels 2.0, Dolby Digital, 4:3\n\n\nEngels:\n\nA multi-volumed documentary mini-series, &quot;The World at War&quot; covers the entire history of World War II from the causes of the 1920s to the aftermath of the Cold War in the 1950s. \nEmphasis is also placed on several inside story episodes, where events are covered which occurred inside Germany and Japan such as resistance to Hitler, life in general under a dictatorial regime, and particular emphasis is focused on the Jewish Holocaust.\n\n\n\n\nSeason 1, Episode 8: The Desert: North Africa - 1940-1943\nIn 1940 Mussolini deploys a massive army to invade British held Egypt, to capture the Suez Canal and most of all to establish an Italian empire to rival Germany's. So begins a multi-year campaign over a meaningless stretch of desert involving forces from a dozen nations and characterized by persistent attackers, stubborn defenders and ultimately controlled by supply line challenges.\n\nSeason 1, Episode 9: Stalingrad: June 1942-February 1943\nGermany is dealt a crushing defeat when the Russians' stubborn defense of Stalingrad delays the German offensive giving the Russians time to mass their forces for a counter attack that surrounds then destroys the German Sixth Army and its supporting forces.\n\nSeason 1, Episode 10: Wolf Pack: U-Boats in the Atlantic - 1939-1944\nFor three years German u-boats ravage transatlantic convoys. Despite the critical need for the supplies and materiel British leadership give scant attention to the matter for two years. Finally in 1943 the allies begin introducing new tactics and weapons while Germany continues to focus on the numbers game\n.\nSeason 1, Episode 11: Red Star: The Soviet Union - 1941-1943\nBent on fulfilling Hilter's policy of colonizing Russia, German forces invade subjecting inhabitants of occupied lands to servitude or death. Russians respond with a mass evacuation and scorched earth policy, reestablishing their industrial capacity far to the east. After German forces fail to break Lenigrade or to capture Kursk and the surrounding Russian forces Russia goes on the offensive with its military production at full capacity.\n\n\n\n\n\n\nSpotinformatie\n \nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nAudio         : Engels DD 2.0\nOndertitels   : Nederlands\nMenu          : Ja\nExtra's       : Ja\nGenre         : Documentaire\n\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071075/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071075/&lt;/a&gt; \n\n &lt;a href=&quot;\nhttp://www.theworldatwar.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theworldatwar.com/&lt;/a&gt;\n\n\nAangeboden door TinkerBell @ TBS","torrent":{"xt":"urn:btih:b50f778047993355120b6976ee781e842dde20ca","amp;dn":"The+world+at+war+dvd+3+-10+%28NLsubs%29%28TinkerBell%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b50f778047993355120b6976ee781e842dde20ca","infoHashBuffer":{"type":"Buffer","data":[181,15,119,128,71,153,51,85,18,11,105,118,238,120,30,132,45,222,32,202]},"announce":[],"urlList":[]}}