{"title":"The Office Special Threat Level Midnight The Movie &gt;OLdI3497&lt;","uid":6187114,"size":851572113,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b543ad75b29477709e3dab7495301c399c2b00be&amp;dn=The+Office+Special+Threat+Level+Midnight+The+Movie+%3EOLdI3497%3C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oldie497","files":1,"time":1298144766,"description":"Michael screens his action film Threat Level Midnight to the office after eleven years of writing, shooting, re-shooting and editing. The film features Michael as Agent Michael Scarn, Dwight as Scarn's sidekick Samuel L. Chang, Jim as archnemesis &quot;Goldenface,&quot; Pam as Hostage #1, and Darryl as the President, as well as several people from Michael's past including Jan (Melora Hardin) as a femme fatale named Jasmine, Karen (Rashida Jones), Roy (David Denman), Helene (Linda Purl), Todd Packer (David Koechner), Tony Gardner (Mike Bruner) and Troy Underbridge (Noel Petok).\n\nPam tells everyone to try to not make fun of his film. However, halfway through, Jim starts laughing uncontrollably at a particular scene, causing everyone else to laugh with him. Michael angrily stops the movie and takes it away. When Michael asks Holly what she thought, she says she wasn't impressed. Michael then gets mad at her and asks if anyone else wants to watch and they all agree. While watching, Michael goes back to Holly and admits that it's bad. They go back to watch the movie and laugh with the rest of the office.\n\nThis is the real thing guys i only uploaded it cause no one else had\n\nIf you have any torrent requests just let me know and ill see if i have it in my library","torrent":{"xt":"urn:btih:b543ad75b29477709e3dab7495301c399c2b00be","amp;dn":"The+Office+Special+Threat+Level+Midnight+The+Movie+%3EOLdI3497%3C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b543ad75b29477709e3dab7495301c399c2b00be","infoHashBuffer":{"type":"Buffer","data":[181,67,173,117,178,148,119,112,158,61,171,116,149,48,28,57,156,43,0,190]},"announce":[],"urlList":[]}}