{"title":"300-Norsk.txt DVDRip 5.1 XviD-Sn666py","uid":6165310,"size":1836459466,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b55585c2099f3a3e73132221fa4728c0ee1fe191&amp;dn=300-Norsk.txt+DVDRip+5.1+XviD-Sn666py&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sn666py","files":-1,"time":1297364514,"description":"Frank Millers (Sin City) storslÃƒÂ¥tte, malende roman kaster seg blodig og tordnende inn pÃƒÂ¥ lerretet, og skaper ÃƒÂ¦refrykt med sin ville visuelle stil i en intens miks av levende bilder og CGI-animasjon. Filmen gjenforteller den eldgamle historien om slaget ved Thermopylae, og tegner et livaktig bilde av det voldsomme sammenstÃƒÂ¸tet hvor kong Leonidas (Gerard Butler) og 300 spartanere ofret livet i kampen mot Xerxes (Rodrigo Santoro) og hans massive persiske armÃƒÂ©. NÃƒÂ¥ kan du oppleve historien fra bare en sverdlengdes avstand. Dette er filmkunst pÃƒÂ¥ sitt beste.\n\nKong Leonidas og hans 300 tapre spartanere stÃƒÂ¥r opp mot en overveldende persisk hÃƒÂ¦r for ÃƒÂ¥ gi sine greske allierte mulighet til ÃƒÂ¥ vinne et avgjÃƒÂ¸rende slag. Det blir en demonstrasjon av heltemot, blod og ÃƒÂ¦re - med en uunngÃƒÂ¥elig slutt.\n\nSlaget ved Thermopylene finner sted i ÃƒÂ¥r 480 f.Kr. da den spartanske kongen Leonidas I og 300 av hans beste krigere forsÃƒÂ¸ker ÃƒÂ¥ stanse den persiske hÃƒÂ¦rens invasjon av Hellas. Historikerne strides om stÃƒÂ¸rrelsen pÃƒÂ¥ hÃƒÂ¦ren til perserkongen Xerses I, men det er mulig den talte hele 250.000 soldater. Mot denne overmakten skal de taktisk sterke spartanerne forsvare seg ved Thermopylene, et pass som pÃƒÂ¥ denne tiden er sÃƒÂ¥ smalt at bare ÃƒÂ©n hestevogn kan passere om gangen.\n\nXerxes foreslÃƒÂ¥r for Leonidas at han skal gÃƒÂ¥ over til persernes side i bytte mot ÃƒÂ¥ bli konge over hele Hellas. Leonidas svarer at det er bedre ÃƒÂ¥ dÃƒÂ¸ for Hellas enn ÃƒÂ¥ bli monark over sine landsmenn. Deretter ber Xerses Leonidas om ÃƒÂ¥ overgi seg. Spartaneren gir svaret som er blitt gjentatt mange ganger senere i historien av ukuelige generaler og politikere: &quot;Kom og ta dem.&quot; Xerses venter noen dager. SÃƒÂ¥ gir han ordre om fÃƒÂ¸rste frontalangrep... ","torrent":{"xt":"urn:btih:b55585c2099f3a3e73132221fa4728c0ee1fe191","amp;dn":"300-Norsk.txt+DVDRip+5.1+XviD-Sn666py","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b55585c2099f3a3e73132221fa4728c0ee1fe191","infoHashBuffer":{"type":"Buffer","data":[181,85,133,194,9,159,58,62,115,19,34,33,250,71,40,192,238,31,225,145]},"announce":[],"urlList":[]}}