{"title":"Intergenerational Effects of Historical Trauma caused by Tyranni","uid":6246903,"size":734234397,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7e48667d5b6c1deabb044cd0f133c7fad3f219b&amp;dn=Intergenerational+Effects+of+Historical+Trauma+caused+by+Tyranni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"c4ll7","files":3,"time":1300268583,"description":"On March 3, 2011, White Bison released the long-awaited Wellbriety Movement: Journey of Forgiveness documentary on DVD regarding long-lasting effects of intergenerational trauma suffered by Native Americans at Indian boarding schools in the British Occupation Zone of the Americas.\n\nFull DVD and some related documents.\n\nAbout White Bison\n\nWhite Bison, Inc., is an American Indian non-profit charitable organization operating under the provisions of 501(c)3 of the Internal Revenue Code and is based in Colorado Springs, Colorado. Through White Bison, it's Founder and President Don Coyhis, Mohican Nation, has offered healing resources to Native America since 1988. White Bison offers sobriety, recovery, addictions prevention, and wellness/Wellbriety learning resources to the Native American community nationwide. Many non-Native people also use White Bison's healing resource products, attend its learning circles, and volunteer their services.\n\nWhite Bison's mission is to assist in bringing 100 Native American communities into healing by 2010. This mission is being realized by means of the many Wellbriety resources, Wellbriety conferences, specialized community training events, Wellbriety coalitions, and the popular grass roots Firestarters circles of recovery groups across the nation.\n\n\nWhite Bison is a proud facilitator of the Wellbriety Movement. Wellbriety means to be sober and well. Wellbriety teaches that we must find sobriety from addictions to alcohol and other drugs and recover from the harmful effects of drugs and alcohol on individuals, families and whole communities. The \\&quot;Well\\&quot; part of Wellbriety is the inspiration to go on beyond sobriety and recovery, committing to a life of wellness and healing everyday.\nCoalitions, Networks, and Events for Wellbriety\n\nWhite Bison participates in the following Coalitions, Networks and Events in an effort to provide a voice for Native Americans in recovery and healing.","torrent":{"xt":"urn:btih:b7e48667d5b6c1deabb044cd0f133c7fad3f219b","amp;dn":"Intergenerational+Effects+of+Historical+Trauma+caused+by+Tyranni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e48667d5b6c1deabb044cd0f133c7fad3f219b","infoHashBuffer":{"type":"Buffer","data":[183,228,134,103,213,182,193,222,171,176,68,205,15,19,60,127,173,63,33,155]},"announce":[],"urlList":[]}}