{"title":"Jon Allen The Infinity Deck","uid":6173099,"size":235118563,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b9182eab598aaf0f222570452b1be81023fa10bf&amp;dn=Jon+Allen+The+Infinity+Deck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cheekychap","files":17,"time":1297660789,"description":"If you enjoy this, and want many more other killer effects just like this one,\n\nThen you are welcome to come share with us on www.magicprop.com on the 20th, as we are a Unique LEVEL 10 Tracker\n\nSo read the txt file, and screeners for a demo of what we have\t\n\n\nJon Allen's Infinity Deck is like no other deck of cards. It is gimmicked in a way that you just won't believe!\n\nMost gimmicked decks enable you to perform only one effect, or many similar effects. The Infinity Deck enables you to do a variety of different effects with virtually no difficult sleight of hand.\n\nThe specially gimmicked deck comes with eight powerful effects covering such things as peeks, reversals, think-a-card, visual changes, transpositions and mental effects. All this without the use of breaks, crimps, side-steals, passes, top changes, in-jogs, out-jogs, glides or false shuffles. Also included is Triumphinity, the routine from Jon Allen's IBM award-winning act. It is the easiest and most effective triumph routine you will ever do!\n\nNo other deck of cards does such a variety effects with such a minimum of effort!\n\nYou will be able to master it in a couple of minutes. You may even come up with some effects of your own! The Infinity Deck is a truly amazing deck of cards.\n\n\nIf you enjoy this, and want many more other killer effects, \nThen you are welcome to come share with us on www.magicprop.com on the 20th, as we are a Unique LEVEL 10 Tracker\n\nSo read the txt file, and screeners for a demo of what we have","torrent":{"xt":"urn:btih:b9182eab598aaf0f222570452b1be81023fa10bf","amp;dn":"Jon+Allen+The+Infinity+Deck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9182eab598aaf0f222570452b1be81023fa10bf","infoHashBuffer":{"type":"Buffer","data":[185,24,46,171,89,138,175,15,34,37,112,69,43,27,232,16,35,250,16,191]},"announce":[],"urlList":[]}}