{"title":"The War for Late Night (Leno/Conan) - Bill Carter","uid":6151454,"size":197900734,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:baf06207de51b52ee0546190dccc423afc55cc11&amp;dn=The+War+for+Late+Night+%28Leno%2FConan%29+-+Bill+Carter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"nlmnyc","files":3,"time":1296890658,"description":"A dramatic account of the politics and personalities behind NBC's calamitous attempt to reinvent late-night television. \n\nWhen NBC decided to move Jay Leno into prime time to make room for Conan O'Brien to host the Tonight show-a job he had been promised five years earlier-skeptics anticipated a train wreck for the ages. It took, in fact, only a few months for the dire predictions to come true. Leno's show, panned by critics, dragged down the ratings-and the profits-of NBC's affiliates, while ratings for Conan's new Tonight show plummeted to the lowest levels in history. Conan's collapse, meanwhile, opened an unexpected door of opportunity for rival David Letterman. What followed was a boisterous, angry, frequently hilarious public battle that had millions of astonished viewers glued to their sets. In The War for Late Night, New York Times reporter Bill Carter offers a detailed behind-the-scenes account of the events of the unforgettable 2009/2010 late-night season as all of its players- performers, producers, agents, and network executives-maneuvered to find footing amid the shifting tectonic plates of television culture.","torrent":{"xt":"urn:btih:baf06207de51b52ee0546190dccc423afc55cc11","amp;dn":"The+War+for+Late+Night+%28Leno%2FConan%29+-+Bill+Carter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baf06207de51b52ee0546190dccc423afc55cc11","infoHashBuffer":{"type":"Buffer","data":[186,240,98,7,222,81,181,46,224,84,97,144,220,204,66,58,252,85,204,17]},"announce":[],"urlList":[]}}