{"title":"Desenho Marco","uid":6291925,"size":11570718720,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bb505e5a9612e428dc128415483095e38ae80bc1&amp;dn=Desenho+Marco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EPC1974","files":52,"time":1301849377,"description":"Nome do Seriado: Marco\nTemporada: Completa\nDuraÃƒÂ§ÃƒÂ£o: 24 Min\nLegenda: Sem Legenda\nIdioma do Audio: PT e ES\nQuant. de MÃƒÂ­dias: 2 DVD's\nTamanho: 190 a 235 Mb\nQualidade: DVDRip\nResoluÃƒÂ§ÃƒÂ£o: 640x480\n\n\nA sÃƒÂ©rie mostra Marco, um garoto que vive com sua famÃƒÂ­lia em GÃƒÂªnova, ItÃƒÂ¡lia, durante a depressÃƒÂ£o de 1881. O pai de Marco, Pietro Rossi, ÃƒÂ© um mÃƒÂ©dico que se dedica a cuidar de pacientes pobres, o que leva a famÃƒÂ­lia a dificuldades financeiras. Sua amada mÃƒÂ£e, Anna Rossi, vai para a Argentina para trabalhar como empregada domÃƒÂ©stica a fim de ganhar dinheiro para sustentar o filho. Quando suas cartas param de chegar, depois da notÃƒÂ­cia de que estava doente, Marco teme que o pior tenha acontecido e, jÃƒÂ¡ que seu pai estÃƒÂ¡ bastante ocupado na clÃƒÂ­nica e seu irmÃƒÂ£o AntÃƒÂ´nio ÃƒÂ© mandado em treinamento de condutor de locomotiva em MilÃƒÂ£o, ele ÃƒÂ© o ÃƒÂºnico que pode sair a procura da mÃƒÂ£e.\n\nMarco leva consigo o macaco de estimaÃƒÂ§ÃƒÂ£o de seu irmÃƒÂ£o, Amedeo, e juntos eles embarcam no Andrea Dora, um navio rumo ao Brasil. Aqui, ele entra em um navio de imigrantes e finalmente chega em Buenos Aires, onde encontra um animador de marionetes, Peppino, e sua famÃƒÂ­lia que ele conhecera em GÃƒÂªnova. Eles o acompanham a Bahia Blanca (Argentina), para tentarem localizar a mÃƒÂ£e de Marco. Neste local, ele descobre que seu tio escondia as cartas que sua a mÃƒÂ£e lhe enviava. Ele volta para Buenos Aires e parte em um navio para RosÃƒÂ¡rio (Argentina), onde ele tenta partir em um trem para CÃƒÂ³rdoba (os amigos italianos de Marco juntam dinheiro e compram para ele uma passagem de trem). Marco chega em CÃƒÂ³rdoba e encontra o engenheiro Mister Mequinez.\n\nO engenheiro diz a Marco que sua mÃƒÂ£e trabalha para seu irmÃƒÂ£o em TucumÃƒÂ¡n e lhe dÃƒÂ¡ o dinheiro para pagar a passagem de trem (Marco acaba gastando o dinheiro para salvar a vida de uma garota pobre que ele encontra).\nEntÃƒÂ£o, ele se esconde em um trem mas ÃƒÂ© pego e expulso em local ermo. Um grupo de ciganos o resgata e lhe empresta um burro velho. ApÃƒÂ³s alguns dias, o burro morre e Marco continua sua viagem para TucumÃƒÂ¡n a pÃƒÂ©. Ele finalmente chega a seu destino cansado e faminto e encontra sua mÃƒÂ£e (ela estÃƒÂ¡ muito doente e precisa ser operada). TÃƒÂ£o logo ela vÃƒÂª Marco, se fortalece e consegue passar pela cirurgia com sucesso. No final da sÃƒÂ©rie, Marco e sua mÃƒÂ£e voltam a GÃƒÂªnova, onde a famÃƒÂ­lia se reÃƒÂºne novamente.\n\n","torrent":{"xt":"urn:btih:bb505e5a9612e428dc128415483095e38ae80bc1","amp;dn":"Desenho+Marco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb505e5a9612e428dc128415483095e38ae80bc1","infoHashBuffer":{"type":"Buffer","data":[187,80,94,90,150,18,228,40,220,18,132,21,72,48,149,227,138,232,11,193]},"announce":[],"urlList":[]}}