{"title":"Oingo Boingo - Weird Science [promo].VOB","uid":6166618,"size":131244032,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc5f903286c491ed75c3e896868b2743e45bb2b2&amp;dn=Oingo+Boingo+-+Weird+Science+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1297412426,"description":"Oingo Boingo - Weird Science [promo].VOB\n\n\nVery HQ movie soundtrack promo music video. &quot;Weird Science&quot; is a song that was written and performed by Oingo Boingo. It is the theme song to the Weird Science film and television series. It was released on the film's soundtrack, as well as Oingo Boingo's 1985 album, Dead Man's Party in a different version.\n\nThe version on the soundtrack, the recording released as a single, runs 3:45 long. The version on Dead Man's Party is a much different arrangement, running 6:00. The song was also released in a dance mix on a 12-inch single.\n\nDespite its moderate mainstream popularity, it is believed that the song is one of Oingo Boingo's least favorite tracks, with the band having felt that it was a rushed effort. It was rarely, if at all, performed live during the years following the song's release. According to various sources, the record company and movie producers were pushing for a final track of the song. The band had worked on various compilations of the song, but was not yet ready to submit the official recording yet. Nevertheless, one night after the band had worked on the song for some time, the record company executives found what they believed was the final or finished recording. And that &quot;unfinished&quot; piece became the released recording of the song.\n\nOingo Boingo was an American new wave band. They are best known for their influence on other musicians, their soundtrack contributions and their high energy Halloween concerts. The band was founded in 1972 as a performance art group called The Mystic Knights of the Oingo Boingo, and from 1976 it was led by songwriter/vocalist Danny Elfman, who has since achieved substantial renown as a composer for film and television.\n\nThe group's format changed twice. In 1979, it changed from a semi-theatrical music and comedy troupe into a ska-influenced New Wave octet and shortened their name to Oingo Boingo. In 1994, the band reshuffled its lineup, adopted an alternative rock sound and rechristened themselves Boingo. The band retired after a farewell concert on Halloween 1995, having reverted to the name Oingo Boingo for the concert.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Weird_Science_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Weird_Science_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PadJkaAdm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PadJkaAdm&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9641kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:03:40\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:bc5f903286c491ed75c3e896868b2743e45bb2b2","amp;dn":"Oingo+Boingo+-+Weird+Science+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5f903286c491ed75c3e896868b2743e45bb2b2","infoHashBuffer":{"type":"Buffer","data":[188,95,144,50,134,196,145,237,117,195,232,150,134,139,39,67,228,91,178,178]},"announce":[],"urlList":[]}}