{"title":"Dr. Jekyll and Mr. Hyde(2008)DVDRip.AC3(ENG)-DROCK","uid":6240886,"size":736018432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bdbbcfbec775aa678d51d38e316f941953f9990d&amp;dn=Dr.+Jekyll+and+Mr.+Hyde%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300058833,"description":"Dougray Scott essays the role of author Robert Louis Stevenson's maniacal medico in director Paolo Barzman's retelling of the classic gothic tale. A highly regarded physician who dedicates all of this spare time to unlocking the secrets of a rare Amazonian flower, Dr. Henry Jekyll (Scott) is about to discover a side of himself that he never knew existed. The sacred flower is said to possess a mystical power that can literally separate the soul, summoning man's Dark Self and unleashing a side of the personality that lies dormant until awoken by its mysterious psychotropic properties. As Dr. Jekyll attempts to isolate those properties and unlock the flower's mysteries, a series of gruesome murders begin making headlines all across the city. Dr. Jekyll knows that this is no coincidence, because every morning when he wakes up clutching a grim memento from the night before, the screams of his terrified victims still echoing through his head. Realizing that it's only a matter of time before the personality he calls &quot;Mr. Edward Hyde&quot; takes over completely, Dr. Jekyll enlists the aid of compassionate attorney Claire Wheaton (Krista Bridges) in ensuring that he be placed in an asylum - where Mr. Hyde can do no further harm. In the courtroom, Mrs. Wheaton gives such a convincing case for mental imbalance that the judge readily agrees to have Dr. Jekyll institutionalized. But while this may be the end of Dr. Jekyll it's only the beginning for Mr. Hyde, because the harder Claire tries to help the conflicted physician the more dangerous his murderous alter ego becomes. \n\nRipped with Handbrake.\n\nLength: 1 Hour 29 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:bdbbcfbec775aa678d51d38e316f941953f9990d","amp;dn":"Dr.+Jekyll+and+Mr.+Hyde%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdbbcfbec775aa678d51d38e316f941953f9990d","infoHashBuffer":{"type":"Buffer","data":[189,187,207,190,199,117,170,103,141,81,211,142,49,111,148,25,83,249,153,13]},"announce":[],"urlList":[]}}