{"title":"Winamp Pro","uid":6238190,"size":11588452,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:befdadbf489cd71bc0a3b3480f460028f7157c23&amp;dn=Winamp+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BoomDeadFAIL","files":7,"time":1299954599,"description":"Serial:\nName: Socrates\nSerial Number: WCASWHBHSNNE5U96ALSL\nIf Serial Does'nt work Plese Leave Comment\n\nPlugins incleded:\nDFX + .REG\nFLAC\nMAC Winamp Plugin (PIMP)\n\n\nWinamp is a media player for Windows-based PCs and Android devices, written by Nullsoft, now a subsidiary of AOL. It is proprietary freeware/shareware, multi-format, extensible with plug-ins and skins, and is noted for its graphical sound visualization, playlist, and media library features. Winamp was released by Justin Frankel in 1997, and its popularity grew quickly, along with the developing trend of MP3 file-sharing. Winamp supports music playback using MP3, MIDI, MOD, MPEG-1 audio layers 1 and 2, AAC, M4A, FLAC, WAV and WMA. Winamp was one of the first common music players on Windows to support playback of Ogg Vorbis by default.[2] It supports gapless playback for MP3 and AAC, and Replay Gain for volume leveling across tracks. CD support includes playing and import music from audio CDs, optionally with CD-Text, and burning music to CDs. The standard version limits maximum burn speed and datarate; the &quot;Pro&quot; version removes these limitations. Winamp supports playback of Windows Media Video and Nullsoft Streaming Video. For MPEG Video, AVI and other unsupported video types, Winamp uses Microsoft's DirectShow API for playback, allowing playback of most of the video formats supported by Windows Media Player. 5.1 Surround sound is supported where formats and decoders allow.\n\nBoomDeadFAIL\n\n","torrent":{"xt":"urn:btih:befdadbf489cd71bc0a3b3480f460028f7157c23","amp;dn":"Winamp+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"befdadbf489cd71bc0a3b3480f460028f7157c23","infoHashBuffer":{"type":"Buffer","data":[190,253,173,191,72,156,215,27,192,163,179,72,15,70,0,40,247,21,124,35]},"announce":[],"urlList":[]}}