{"title":"El color del crimen.2006","uid":6206797,"size":733500216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf7b5af9fd6c41862142ea23e726d1bb768e0919&amp;dn=El+color+del+crimen.2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fanclubt","files":2,"time":1298837252,"description":"El color del crimen.2006\n\nDuraciÃƒÂ³n: 112 min.\n\nReparto: Samuel L. Jackson,  Julianne Moore,  Edie Falco,  Ron Eldard,  William Forsythe,  Aunjanue Ellis,  Anthony Mackie\n\nGÃƒÂ©nero: Intriga. Thriller\n\nSINOPSIS  \n\tYa entrada la noche, en un barrio obrero de las afueras de Nueva Jersey, una mujer ensangrentada llega, tambaleÃƒÂ¡ndose y aturdida, hasta la sala de urgencias del Centro MÃƒÂ©dico de Dempsy. Tras someterla a un tratamiento para curarle la conmociÃƒÂ³n y la histeria, Brenda Martin (Julianne Moore) explica al comisario de policÃƒÂ­a de Dempsy, Lorenzo Council (Samuel L. Jackson), la terrible historia de cÃƒÂ³mo le han robado el coche en el terreno aislado y sin urbanizar que separa las viviendas de protecciÃƒÂ³n oficial de Dempsy del barrio obrero de Gannon, donde ella vive; afirma que un hombre de raza negra la forzÃƒÂ³ a salir del coche. Sin embargo, durante el interrogatorio, Council sospecha que le faltan datos y, tras varias horas de interrogatorio, finalmente, Brenda se derrumba y confiesa que Cody, su hijo de cuatro aÃƒÂ±os, estaba durmiendo en el asiento trasero del coche robado. Dirigidos por la activista Karen Collucci (Edie Falco), diversos miembros de las comunidades de Dempsy y Gannon se unen en la bÃƒÂºsqueda del niÃƒÂ±o desaparecido, pero la investigaciÃƒÂ³n criminal del presunto secuestro apunta a un sospechoso que al parecer reside en las viviendas de protecciÃƒÂ³n oficial lo que, rÃƒÂ¡pidamente, enciende la chispa de las tensiones raciales que llevaban largo tiempo gestÃƒÂ¡ndose entre ambas poblaciones.\n\n","torrent":{"xt":"urn:btih:bf7b5af9fd6c41862142ea23e726d1bb768e0919","amp;dn":"El+color+del+crimen.2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7b5af9fd6c41862142ea23e726d1bb768e0919","infoHashBuffer":{"type":"Buffer","data":[191,123,90,249,253,108,65,134,33,66,234,35,231,38,209,187,118,142,9,25]},"announce":[],"urlList":[]}}