{"title":"Fifty Pills(2006)DVDRip.AC3(ENG)-DROCK","uid":6252415,"size":710748912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c18e33339108d7b4b947ab4210f3b6ad6b786e84&amp;dn=Fifty+Pills%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"drock232","files":-1,"time":1300448262,"description":"This collegiate farce directed by Theo Avgerinos had its world premiere at the 2006 Tribeca Film Festival. After a party thrown by his roommate, Coleman (John Hensley), violates their dorm-room probation, college freshman (at a thinly veiled New York University) Darren (Lou Taylor Pucci) loses his scholarship money and scrambles to raise the funds by selling 50 ecstasy pills given to him as an apology by Coleman over the course of a hectic day. While loading the pills off on fellow college students, friends, family, and Coleman's customers -- including a dominatrix named Petunia (Monica Keena) and an insanely off-kilter stock trader (Eddie Kaye Thomas) -- Darren must also finish a paper on Dante's Inferno, deal with his parents (Jane Lynch and John Kapelos) in New Jersey, who think he's gay, elude the mysterious Soul Man (Ron Yuan), and try to convince his crush, Grace (Kristen Bell), that he's not a sleazy drug dealer. Darren's crazy day comes to a head when some stupid but vengeful thugs led by Eduardo (Michael Pena) track down both Coleman and Darren at their dorm while the stock trader shows up looking for more pills.\n\nRipped with Handbrake.\n\nLength: 1 Hour 23 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:c18e33339108d7b4b947ab4210f3b6ad6b786e84","amp;dn":"Fifty+Pills%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18e33339108d7b4b947ab4210f3b6ad6b786e84","infoHashBuffer":{"type":"Buffer","data":[193,142,51,51,145,8,215,180,185,71,171,66,16,243,182,173,107,120,110,132]},"announce":[],"urlList":[]}}