{"title":"HISTORY OF POP AND ROCK MUSIC - part 292","uid":6292732,"size":380097162,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c2c9f8b837c2f8f101d15b6d55bf968f72d30dbd&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+292&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1301882745,"description":"                        PART  292\n\n\n\n          PAUL SIMON  - Fifty ways to leave your lover  (1976)\n          SIMON &amp; GARFUNKEL  -  El Condor Pasa (2004)\n          ISRAEL KAMAKAWIWO  -  Over The Rainbow  (1993)\n\n\n\n    &quot;50 Ways to Leave Your Lover&quot; is a 1975 hit song by Paul Simon, from his album &quot;Still Crazy After All These Years&quot;. Backing vocals on the single were performed by Patti Austin, Valerie Simpson and Phoebe Snow. &quot;50 Ways to Leave Your Lover&quot; broke in the U.S. in late December 1975 becoming number one on the U.S. Billboard Hot 100 on February 7, 1976, and remaining there for three weeks. It was certified gold on March 11, 1976, and remained a best seller for nearly five months. The song also topped the adult contemporary chart for two weeks. It remains Simon's biggest solo hit. On the UK Singles Chart, the song reached position number 23 in January 1976.\n\n    &quot;El CÃƒÂ³ndor Pasa&quot; is a song from the zarzuela El CÃƒÂ³ndor Pasa by the Peruvian composer Daniel AlomÃƒÂ­a Robles written in 1913 and based on traditional Andean folk tunes. It is possibly the best-known Peruvian song worldwide due to a cover version by Simon &amp; Garfunkel in 1970 on their &quot;Bridge Over Troubled Water&quot; album. This cover version is called El Condor Pasa (If I Could).\n\n    &quot;Over the Rainbow&quot; (often referred to as &quot;Somewhere Over the Rainbow&quot;) is a classic Academy Award-winning ballad song with music by Harold Arlen and lyrics by E.Y. Harburg. It was written for the movie The Wizard of Oz (1939), and was sung by Judy Garland in the movie. Over time it would become Garland's signature song.\n            Israel Kamakawiwo ole's album &quot;Facing Future&quot;, released in 1993, included an ukulele medley of &quot;Over the Rainbow&quot; and &quot;What a Wonderful World&quot;. The song reached #12 on Billboard's Hot Digital Tracks chart the week of January 31, 2004. In the UK the song was released as a single under the title &quot;Somewhere Over the Rainbow&quot;. It entered the UK Official Singles Chart in April 2007 at #68. After several returns to the chart, in September 2008 it reached its peak position so far going up to #46. In Germany, the single also returned back to the German Singles Chart in September 2010. After only 2 weeks on that chart, the song already received gold for 150,000 copies sold.In October 2010 the song reached No. 1 in the German charts and in February, 2011 it has been certified 2x Platinum for selling more than 600,000 copies. It stayed 12 non-consecutive weeks at the top spot and was the most successful single in Germany in 2010. In France, the song debuted at #4 in December 2010 and reached number one.","torrent":{"xt":"urn:btih:c2c9f8b837c2f8f101d15b6d55bf968f72d30dbd","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+292","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c9f8b837c2f8f101d15b6d55bf968f72d30dbd","infoHashBuffer":{"type":"Buffer","data":[194,201,248,184,55,194,248,241,1,209,91,109,85,191,150,143,114,211,13,189]},"announce":[],"urlList":[]}}