{"title":"Stan Ridgway - Black Diamond  [1996]  [Robbie60] [FLAC]","uid":6232268,"size":352274873,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4e219d9a4e8a1a8c0ff894918478c05ddefd058&amp;dn=Stan+Ridgway+-+Black+Diamond++%5B1996%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Robbie6ty","files":-1,"time":1299750670,"description":"Stan Ridgway\nBlack Diamond\n\nLabel: Birdcage Records\nReleased: 1996\nSource: Original CD \nSize Torrent: 335 MB\nFormat: FLAC\n\n\n\n\n\n\n&quot;Black Diamond, is a little different from anything I've ever written. It's a leaner, more intimate record, kind of old fashioned really, and at the risk of sounding like some wounded folkie, this is probably the most personal record I've madeso far. I'd call it a song cycle for dreamers and schemers. The songs took shape during the summer of '95, at a time when I was coming to grips with a lot of conflicting thoughts and feelings: insecurity, loneliness, the need to control, bitterness, success, failure and, of course, the Big Three: anger, love and loss.&quot; Stan Ridgway's fourth solo album challenges more than a few of the assumptions that have been made about him as a songwriter. \n\n&quot;This is a record where I deliberately forced the songs to stand on their own,&quot; Ridgway says of Black Diamond's spare and spacious production. &quot;The music is as simple and unadorned as we could make it. The musicians and I tried to let the songs flow out of our heads and onto the tape without a lot of fussiness and second-guessing in between. My true interest has always been in the surreal, the dream-states we encounter when we're asleep or wide awake with caffeine buzzing in our heads. And in fact,&quot; Ridgway says, &quot;I wrote most of this music from dreams I'd had. I've really moved myself into fresh territory with these songs, I think.&quot; \n\nIndeed, Black Diamond's songs explore music and moods that are both subtler and more far-ranging than anything Ridgway has previously attempted. An example of the singer's fascination with the dream state, &quot;Stranded&quot; melodically melts from one level of reality to the next, encompassing a ghostly, fractured Titanic slipping beneath the waves, an anxious lone hitchhiker and an object in decaying orbit destined for a fiery oblivion. By contrast, the warmly haunting &quot;Luther Played Guitar&quot; finds Ridgway stepping into the shoes of one of his heroes, Johnny Cash, to lament the passing of Luther Perkins, lead guitarist for the great balladeer's original band, The Tennessee Three. \n\n\n\nPersonnel\n\nStan Ridgway (vocals, guitar, acoustic guitar, electric guitar, harmonica, recorder); \nTodd Sharp (woodwinds, saxophone); \nPietra Wexstun (keyboards, background vocals);\nTed &quot;Sticks&quot; Andersen (drums, percussion).\n\n\n\nTrack Listing\n\nBig Dumb Town \nGone The Distance \nKnife and Fork \nDown the Coast Highway \nLuther Played Guitar \nStranded \nWild Bill Donovan \nMan of Stone \nPink Parakeet \nUnderneath the Big Green Tree \nAs I Went Out One Morning \nCrystal Palace\n","torrent":{"xt":"urn:btih:c4e219d9a4e8a1a8c0ff894918478c05ddefd058","amp;dn":"Stan+Ridgway+-+Black+Diamond++%5B1996%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e219d9a4e8a1a8c0ff894918478c05ddefd058","infoHashBuffer":{"type":"Buffer","data":[196,226,25,217,164,232,161,168,192,255,137,73,24,71,140,5,221,239,208,88]},"announce":[],"urlList":[]}}