{"title":"Bob Marley - The Legend Live","uid":6186419,"size":730136576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c6328088ef8c298d09d8c679a83c54d03cad9314&amp;dn=Bob+Marley+-+The+Legend+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theimp9","files":1,"time":1298124744,"description":"Bob Marley: The Legend Live (Sanctuary/Trojan, 2003)\n\nBack on November 25 1979, no one in the Santa Barbara County Bowl in Santa Barbara, California -- not the audience, not the stage hands, not the band, perhaps not even the star himself  -- would have imagined that they were witnessing what would be the last recorded performance of the great Bob Marley, that a mere year and a half later he would be dead (at least, physically).  Now, to the delight of fans everywhere, the video documentation of this concert has resurfaced (it has long been out of print since being released in the early '80s), this time in crisp, 21st century DVD format.  As such, both audio and video are remastered and lush, particularly considering the source.  If you're like me -- and like most of Marley's fans -- you were never able to see him perform in person, which makes a release like The Legend Live so valuable and so mesmerizing.  Seeing him on stage, swaying and gesticulating with a magnetic air amidst a throng of band members (12 or more, although Marcia Griffiths is noticeably absent) in front of towering, colorful images of Haile Selassie, Marcus Garvey, and the Ethiopian flag, you truly get a sense of the dynamic appeal that made him a legend.  The energy of the crowd, like the band, builds slowly throughout the outdoor dusk-time concert, reaching a dizzying crescendo during the last selection, the iconic anthem &quot;Get Up Stand Up&quot; (a few rhythmically challenged audience members detracting only mildly from the viewing experience).  As the concert was part of the tour promoting the Survival album, several of the tunes performed are from that set -- &quot;Zimbabwe,&quot; &quot;Wake Up and Live,&quot; &quot;Ambush in the Night,&quot; &quot;Ride Natty Ride&quot; &quot;Africa Unite&quot; -- leaving less time for some of the Wailers' better-known songs, likely to some listeners' disappointment (I could name several that I would've preferred, but I suppose no one will ever get to hear all of the Marley tracks that they want in one concert.).  On the bright side, though, this DVD release includes an impressive 7 more songs than the '80s VHS edition -- &quot;Wake Up and Live,&quot; &quot;Concrete Jungle,&quot; &quot;Them Belly Full,&quot; &quot;Ride Natty Ride,&quot; &quot;So Much Things to Say,&quot; &quot;Is This Love,&quot; and &quot;War/No More Trouble&quot; -- all recorded two days later at another concert at the Roxy in Hollywood, California (although frankly I couldn't tell a difference, the transition is so seamless).  Other extras included here are an in-depth documentary detailing Marley's life and the roots and tenets of Rastafarianism -- including previously unseen footage of a Marley interview -- as well as a summary of the Santa Barbara concert and revealing footage of fan interviews outside of the Roxy concert.  While you can't truly see Bob Marley live any more, The Legend Live is about as close as fans can get.","torrent":{"xt":"urn:btih:c6328088ef8c298d09d8c679a83c54d03cad9314","amp;dn":"Bob+Marley+-+The+Legend+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6328088ef8c298d09d8c679a83c54d03cad9314","infoHashBuffer":{"type":"Buffer","data":[198,50,128,136,239,140,41,141,9,216,198,121,168,60,84,208,60,173,147,20]},"announce":[],"urlList":[]}}