{"title":"Bret Easton Ellis, Imperial bedrooms","uid":6179196,"size":168805814,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c877492098e5afb34be1d7ea8cf61c2de33f09d6&amp;dn=Bret+Easton+Ellis%2C+Imperial+bedrooms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dsgjsd2","files":60,"time":1297886126,"description":"Twenty-five years on from &quot;Less Than Zero&quot;, we pick up again with &quot;Clay&quot;. In 1985, Bret Easton Ellis shocked, stunned and disturbed with &quot;Less Than Zero&quot;, his 'extraordinarily accomplished first novel' (&quot;New Yorker&quot;), successfully chronicling the frightening consequences of unmitigated hedonism within the ranks of the ethically bereft youth of 80s Los Angeles. Now, twenty-five years later, Ellis returns to those same characters: to Clay and the band of infamous teenagers whose lives weave sporadically through his. But now, some years on, they face an even greater period of disaffection: their own middle age. Clay seems to have moved on - he's become a successful screenwriter - but when he returns from New York to Los Angeles, to help cast his new movie, he's soon drifting through a long-familiar circle. Blair, his former girlfriend, is now married to Trent, and their Beverly Hills parties attract excessive levels of fame and fortune, though for all that Trent is a powerful manager, his baser instincts remain: he's still a bisexual philanderer. Then there's Clay's childhood friend, Julian - who's now a recovering addict - and their old dealer, Rip - face-lifted beyond recognition and seemingly even more sinister than he was in his notorious past. Clay, too, struggles with his own demons after a meeting with a gorgeous actress determined to win a role in his movie. And with his life careening out of control, he's forced to come to terms with the deepest recesses of his character - and with his seemingly endless proclivity for betrayal. \t\t","torrent":{"xt":"urn:btih:c877492098e5afb34be1d7ea8cf61c2de33f09d6","amp;dn":"Bret+Easton+Ellis%2C+Imperial+bedrooms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c877492098e5afb34be1d7ea8cf61c2de33f09d6","infoHashBuffer":{"type":"Buffer","data":[200,119,73,32,152,229,175,179,75,225,215,234,140,246,28,45,227,63,9,214]},"announce":[],"urlList":[]}}