{"title":"2001 Wimbledon Final - Patrick Rafter vs Goran Ivanisevic","uid":6151562,"size":2205745152,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c905f7955cbac8a77425120fdb0815463a7c2ca0&amp;dn=2001+Wimbledon+Final+-+Patrick+Rafter+vs+Goran+Ivanisevic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"demijon","files":3,"time":1296893477,"description":"The 115th Wimbledon Championships witnessed one of the most dramatic and emotional matches in tennis history. In the Men's Final, Croatia's Goran Ivanisevic, three times runner-up, defeated Australia's Pat Rafter in an epic five set battle. \n\nIvanisevic came into The Championships as one of six wild cards, the other five being low-ranked British players. None of them was expected to go further than one or two rounds. By Men's Final day, the Croatian had defeated a former French Open Champion, the reigning US Open Champion and both of Britain s top players. His weather-delayed semi-final against Tim Henman was particularly memorable. He came back from the brink of defeat to win a rain-interrupted match that lasted three days. \n\nFor Pat Rafter, the number three seed, the route to the Final had not been so arduous, until the semi-final, when his opponent was the second seeded American, Andre Agassi. The game was a rematch of last year's battle and proved to be equally dramatic. The Australian prevailed in five sets, to reach his second Wimbledon Final in as many years. \n\nRafter had talked of retiring from tennis and was therefore playing in what could be his last Wimbledon Championships. Having played and lost three Finals before, Ivanisevic had a burning desire to a bring more successful conclusion to almost ten years of frustration and disappointment. \n\nThe weather, which had been so good for the majority of the competition, broke on the final weekend, forcing the Men's Final to be played on a Monday. Most of the Center Court crowd had queued overnight for their position. The atmosphere was unique, the match sensational.\n\n\nThis torrent is a dvdrip of the following product:\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Wimbledon-2001-Final-Rafter-Ivanisevic/dp/B000V02CT6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Wimbledon-2001-Final-Rafter-Ivanisevic/dp/B000V02CT6&lt;/a&gt;","torrent":{"xt":"urn:btih:c905f7955cbac8a77425120fdb0815463a7c2ca0","amp;dn":"2001+Wimbledon+Final+-+Patrick+Rafter+vs+Goran+Ivanisevic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c905f7955cbac8a77425120fdb0815463a7c2ca0","infoHashBuffer":{"type":"Buffer","data":[201,5,247,149,92,186,200,167,116,37,18,15,219,8,21,70,58,124,44,160]},"announce":[],"urlList":[]}}