{"title":"Metal Church - This Present Wasteland (2005) WMA320","uid":6253475,"size":147009580,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c97491b96e1130e5717797fca59941a3564b8f7f&amp;dn=Metal+Church+-+This+Present+Wasteland+%282005%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1300505580,"description":"You've got to give them credit where credit is due. Sure, just Kurdt Vanderhoof is the lone remaining original member, but Metal Church is still a real band, not just Vanderhoof and a bunch of studio &quot;rented&quot; musicians. Hell, this is singer Ronnie Munroe's 3rd album. As you know, not many bands from the early 80's are still around playing, let alone releasing new material every other year. \nThe music itself you ask? If you are a fan of Metal Church, then you'll enjoy this disc. Is the music just a carbon copy of previous releases? A bit Yes, which is a good thing, and a bit No, which is a great thing. This Present Wasteland is far better than their last effort called A Light in the Dark (which was still good stuff). Kurdt and the boys decided to turn it up a notch or two on the heaviness, distortion, and overall &quot;metal&quot; sound. There are some killer riffs, solos, memorable choruses, heavy drums, and outstanding singing on ALL tracks! Easily the BEST Monroe has done with Metal Church. Also, the songs themselves are well written lyrically and musically. You can tell they took a bit more time in the studio with this one....no filler whatsoever. On many songs, you get that classic &quot;Metal Church&quot; intro sound (before the heavy riff comes in) that could be right out of their S/T album 25+ years ago. \nIn my mind, this band will always have the title of &quot;Most Underated Metal Band&quot;. They'll get no airplay or recognition by any magazines, but any real metal fan knows this doesn't matter, and only makes it better. Metal Church once again delivers. Pick this one up and keep giving them your support. I hope they keep it going for many more years.\n\nby Mike &quot;Metal Mike-Milwaukee&quot;\n\nTRACKLIST:\n\n01 - The Company Of Sorrow.wma                                        \n02 - The Perfect Crime.wma                                            \n03 - Deeds Of A Dead Soul.wma                                         \n04 - Meet Your Maker.wma                                              \n05 - Monster.wma                                                      \n06 - Crawling To Extinction.wma                                       \n07 - A War Never Won.wma                                              \n08 - Mass Hysteria.wma                                                \n09 - Breathe Again.wma                                                \n10 - Congregation.wma     \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:c97491b96e1130e5717797fca59941a3564b8f7f","amp;dn":"Metal+Church+-+This+Present+Wasteland+%282005%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c97491b96e1130e5717797fca59941a3564b8f7f","infoHashBuffer":{"type":"Buffer","data":[201,116,145,185,110,17,48,229,113,119,151,252,165,153,65,163,86,75,143,127]},"announce":[],"urlList":[]}}