{"title":"system shock 2 spanish","uid":6235616,"size":497876767,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ca8d9ca9befdad962ccde0058da5b77b5728ffbd&amp;dn=system+shock+2+spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alforo","files":1,"time":1299860418,"description":"juego pc terror espacial Como su predecesor, System Shock 2 engloba varios gÃƒÂ©neros. Presenta una perspectiva en primera persona complementada con un HUD que muestra un mapa, un inventario e informaciÃƒÂ³n acerca de las armas y el personaje. Al igual que los juegos de acciÃƒÂ³n en primera persona, el jugador posee diversas armas con las que enfrentarse a sus enemigos, mientras que un sistema de rol permite al jugador adquirir una serie de habilidades para su provecho.\n\nAl principio del juego, el jugador debe escoger una carrera en el ficticio Unified National Nominate (UNN); alistarse en los Marines aumenta las habilidades de combate y armas; la Armada proporciona entrenamiento en hackeo e ingenierÃƒÂ­a; y la OSA afina los poderes psÃƒÂ­quicos del jugador. Tras elegir una clase y superar una fase de desarrollo del personaje, el jugador recibe &quot;cyber-mÃƒÂ³dulos&quot; por alcanzar objetivos en el juego. La destreza en determinadas habilidades es mejorada utilizando estos mÃƒÂ³dulos en &quot;unidades de cyber-mejora&quot;.\n\nLas unidades OS permiten mejoras de un sÃƒÂ³lo uso, mientras el dinero del juego se puede usar para adquirir objetos en mÃƒÂ¡quinas expendedoras. Estaciones reconstituyentes, llamadas &quot;MÃƒÂ¡quinas de Bio-ReconstrucciÃƒÂ³n CuÃƒÂ¡nticas&quot;, pueden ser activadas en la mayor parte de las ÃƒÂ¡reas del juego. Si el jugador muere en una zona con una mÃƒÂ¡quina de bio-reconstrucciÃƒÂ³n activa, serÃƒÂ¡ &quot;revivido&quot; en esa mÃƒÂ¡quina. De lo contrario, el juego termina y el jugador debe retomar el juego desde un punto de guardado.\n\nAlgunos dispositivos como teclados, torretas y mÃƒÂ¡quinas expendedoras pueden ser hackeadas para obtener beneficio. Cuando se intenta hackear estos objetos, comienza un minijuego con una red de nodos verdes. Tres nodos iluminados deben estar alineados para que el hackeo funcione. A medida que avanza el videojuego, la dificultad para realizar un hackeo aumenta. Adicionalmente, el jugador puede usar ganzÃƒÂºas electrÃƒÂ³nicas para hackear automÃƒÂ¡ticamente los objetos.\n\nA lo largo del juego, el jugador puede obtener varias armas, incluyendo pistolas, escopetas y armas alienÃƒÂ­genas. Las armas presentan degradaciÃƒÂ³n al usarlas, necesitando ser reparadas para evitar su malfuncionamiento. Existen varios tipos de municiÃƒÂ³n, lo que da ventaja al jugador contra enemigos susceptibles. Debido a que la municÃƒÂ³n escasea, el jugador se ve obligado a buscarla en las estancias y a ser conservador en su uso.incluye traduccion al castellano por clan-dan","torrent":{"xt":"urn:btih:ca8d9ca9befdad962ccde0058da5b77b5728ffbd","amp;dn":"system+shock+2+spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8d9ca9befdad962ccde0058da5b77b5728ffbd","infoHashBuffer":{"type":"Buffer","data":[202,141,156,169,190,253,173,150,44,205,224,5,141,165,183,123,87,40,255,189]},"announce":[],"urlList":[]}}