{"title":"Legend.DVDRip.Sub .avi","uid":6265520,"size":838307840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb2734760e8dec1413645719be72b93ae7abf807&amp;dn=Legend.DVDRip.Sub+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1300891233,"description":"Calidad del video: DVD RIP\nPeso: 700 mb\nIdioma del audio: Version original subtitulos en espaÃƒÂ±ol\n\nChina, 1920. Mientras China esta traumatizada por las escaramuzas militares en la era de los SeÃƒÂ±ores de la Guerra, Shanghai es el centro de todas las miradas, un lugar entre el cielo y el infierno. Uno de los mas memorables heroes de la ciudad es Chen Zhen, quien sin ayuda de nadie vengo la muerte de su maestro matando a todos sus asesinos japoneses en un dojo en Honkou, aunque al final fue detenido por una lluvia de balas mientras lanzaba su legendaria patada voladora. Desaparecido desde entonces, fue dado por muerto aunque su cuerpo nunca se encontro. Siete aÃƒÂ±os despues, un rico empresario llamado Koo regresa del extranjero con una gran entrada en la escena social de Shanghai gracias a su amistad con el mas importante jefe mafioso de la ciudad. Pero este misterioso hombre no es otro que Chen Zhen disfrazado con el fin de infiltrarse en el imperio criminal. Pronto descubre una conexion clandestina entre la mafia y los japoneses. Disfrazado como un cruzado enmascarado, Chen se propone desmantelar gracias a sus artes marciales esta malefica alianza que amenaza el pais. Su mision mas importante sera descubrir la lista con los asesinatos que preparan los japoneses. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:cb2734760e8dec1413645719be72b93ae7abf807","amp;dn":"Legend.DVDRip.Sub+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb2734760e8dec1413645719be72b93ae7abf807","infoHashBuffer":{"type":"Buffer","data":[203,39,52,118,14,141,236,20,19,100,87,25,190,114,185,58,231,171,248,7]},"announce":[],"urlList":[]}}