{"title":"Contact(1997)DVDRip.AC3(ENG)-DROCK","uid":6186478,"size":733358514,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb95edd607781f7f5bc3b2035903e3030cc367c5&amp;dn=Contact%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1298127077,"description":"The search for life outside our solar system becomes a personal and spiritual quest for a young researcher. Ellie Arroway (Jodie Foster) is a scientist who lost her faith in God after her parents died when she was a child. However, Ellie has learned to develop a different sort of faith in the seemingly unknowable: working with a group that monitors radio waves from space, Ellie hopes that some day she will receive a coherent message from another world that will prove that there is a world beyond our own. Ellie's hard work is rewarded when her team picks up a signal that does not appear to be of earthly origin. Ellie decodes the message, which turns out to be plans for a space craft, which she takes as an invitation for a meeting with the aliens. Ellie and her fellow researchers soon run into interference from a White House scientific advisor, David Drumlin (Tom Skerritt), who cuts off their funding and tries to take credit for their achievements. However, Ellie receives moral support from Palmer Joss (Matthew McConaughey), a spiritual teacher who advises President Clinton and tries to persuade her to accept the existence of a higher power, and financial backing from S.R. Hadden (John Hurt), a multi-millionaire willing to fund her attempts to contact the source of the message. Contact was based on a novel by Carl Sagan, who advised director Robert Zemeckis during the film's production until his death in 1996.\n\nRipped with Handbrake.\n\nLength: 2 Hours 29 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:cb95edd607781f7f5bc3b2035903e3030cc367c5","amp;dn":"Contact%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb95edd607781f7f5bc3b2035903e3030cc367c5","infoHashBuffer":{"type":"Buffer","data":[203,149,237,214,7,120,31,127,91,195,178,3,89,3,227,3,12,195,103,197]},"announce":[],"urlList":[]}}