{"title":"Inside the mind of Adolf Hitler","uid":6263551,"size":4020736000,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cbfaf40a70ca2529df1960dfa3ba339286515d1d&amp;dn=Inside+the+mind+of+Adolf+Hitler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"longdutchman2","files":75,"time":1300826981,"description":"Is het mogelijk om te weten hoe hij dacht?\nPsychologische profielen van criminelen en buitenlandse tegenstanders zijn een normaal onderdeel van de moderne wetshandhaving en de wijze waarop inlichtingen worden\nverzameld. Op het hoogtepunt van de Tweede Wereldoorlog was het creÃƒÂ«ren van een profiel van de vijand echter een baanbrekend concept. Deze documentaire brengt de\nwerkzaamheden van de Harvard psychoanalyticus Dr. Walter Langer in beeld, die met een Freudiaans onderzoeksmodel de allereerste psychoanalyse van Adolf Hitler's mentale en emotionele toestand samenstelde. Aan de hand van de bevindingen van Langer dachten de Geallieerden in het brein van Hitler te kunnen doordringen om de acties van hun vijand te voorspellen. Decennia lang is dit onderzoek strikt geheim gehouden. Sinds kort is het onderzoek openbaar geworden en heeft BBC de primeur gekregen er een unieke documentaire van te maken. Onder begeleiding van historicus Dr. Post gaan we terug in de tijd om te zien of de analytici gelijk hadden en het onderzoek destijds het verschil heeft kunnen maken. ","torrent":{"xt":"urn:btih:cbfaf40a70ca2529df1960dfa3ba339286515d1d","amp;dn":"Inside+the+mind+of+Adolf+Hitler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbfaf40a70ca2529df1960dfa3ba339286515d1d","infoHashBuffer":{"type":"Buffer","data":[203,250,244,10,112,202,37,41,223,25,96,223,163,186,51,146,134,81,93,29]},"announce":[],"urlList":[]}}