{"title":"Post.Apocalyptic.Mayhem-RELOADED","uid":6255163,"size":436653981,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc74b526e9fc6c8856c8ca9cd92285fc7ba9a174&amp;dn=Post.Apocalyptic.Mayhem-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":32,"time":1300547028,"description":"03/2011: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action, Racing\n\nPost Apocalyptic Mayhem lets you race and battle heavily-modified vehicles\nthrough numerous breathtaking tracks and lay waste to other racers in\nover-the-top vehicular mayhem. You can use special vehicle abilities to cause\nspectacular destruction to enemy cars as you fight and speed to victory\nYou'll experience remarkable speeds, hilarious and violent weapons\nreinforced vehicles and various exhilarating tracks\n\nThe game offers various intense race modes to allow you to showcase both your\ndriving and battling skills. PAM features an accessible physics-based driving\nmodel that allows you to sense the immense speed of all the post apocalyptic\nvehicles as well as feel every bone-jarring impact from both weapons and the\ntracks. Play single-player or battle up to five friends in online multiplayer\nmode\n\nFeatures\n* Vehicles PAM offers numerous post apocalyptic vehicles. All the\nVehicles are heavily-modified and extremely menacing. All Vehicles are\nheavy-duty, reinforced and are able to take and give a lot abuse. The\nvehicles all look like they can quickly and easily travel over the newly\nscorched wasteland while effortlessly smashing other vehicle along the\nway\n* Weapons All of the vehicles have three unique and powerful abilities\nthat they can use to severely damage opposition vehicles: one front\nattack, a side attack and a rear attack. A Player can receive these\nspecial abilities by picking up Special Ability Barrels that are placed\nthroughout all of the tracks. When a vehicle runs over a Special Ability\nBarrel, the vehicle will gain that specific ability and the Player will\nbe able to use it whenever they prefer\n* Multiplayer Intense Online Multiplayer racing for up to 6 players\n* Environments The PAM tracks will be able to give players numerous\noptions while racing as well as create intense areas for the all\nimportant collisions. All Tracks will contain:\n* Awe-inspiring apocalyptic environments\n* Various paths around certain areas of the tracks\n* Funnel areas were players are forced to drive in close quarters with\nother vehicles\n* Huge Jumps\n* Numerous compelling and completely unique tracks\n* Achievements 35 Steam achievements to be earned and displayed\nproudly\n* Online Leader Boards Every kill, every race and every result will be\nrecorded and uploaded to online leader boards for bragging rights and\nfueled competition\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!.","torrent":{"xt":"urn:btih:cc74b526e9fc6c8856c8ca9cd92285fc7ba9a174","amp;dn":"Post.Apocalyptic.Mayhem-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc74b526e9fc6c8856c8ca9cd92285fc7ba9a174","infoHashBuffer":{"type":"Buffer","data":[204,116,181,38,233,252,108,136,86,200,202,156,217,34,133,252,123,169,161,116]},"announce":[],"urlList":[]}}