{"title":"Chaplin.AVI","uid":6238875,"size":1171296988,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce0dfa65ec1ec85bcaa5dbdebfbff7a5bdf9ef43&amp;dn=Chaplin.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erato99","files":1,"time":1299979668,"description":"Calidad del video: DVD RIP\nPeso: 1098 mb\nIdioma del audio: EspaÃƒÂ±ol EspaÃƒÂ±a\n\nBiografÃƒÂ­a sobre el genial Charles Chaplin. El joven Charlie Chaplin era miembro de una numerosa familia que se ganaba la vida en los teatros de mala muerte de Londres. Pronto viÃƒÂ³ a su padre morir alcoholizado, y a su madre enferma, Hannah, trabajando duramente para sacar adelante a su hermano Sydney y a ÃƒÂ©l mismo. Su ÃƒÂºnica evasiÃƒÂ³n era el teatro. Pero Hannah estÃƒÂ¡ gravemente enferma y debe ser ingresada en un psiquiÃƒÂ¡trico. Chaplin entra entonces a trabajar en una compaÃƒÂ±ÃƒÂ­a de mÃƒÂºsica y pantomima, que le lleva de gira por Estados Unidos. AllÃƒÂ­ conoce al productor de cine Mack Sennett con el que firma un contrato. Chaplin demuestra su gran habilidad para comunicarse con el pÃƒÂºblico. AdemÃƒÂ¡s de actuar, comienza a dirigir los filmes que protagoniza y su personaje de un entraÃƒÂ±able vagabundo da la vuelta al mundo. Su ÃƒÂ©xito artÃƒÂ­stico no se corresponde con el sentimental, casÃƒÂ¡ndose cuatro veces, la primera con la actriz Edna Purviance y la segunda con la conocida Paulette Godard. A la vez Chaplin hace amistad con el actor Douglas Fairbanks, con quien funda la United Artists, junto al director D. W. Griffith y a la actriz Mary Pickford. Activista a favor de los derechos de las minorÃƒÂ­as y de la entrada de los Estados Unidos en la II Guerra Mundial para detener el avance nazi, pronto es tildado de izquierdista y, tras la guerra, el ComitÃƒÂ© de Actividades Antiamericanas le llama a declarar. Charles Chaplin no acepta la citaciÃƒÂ³n y se exilia en Europa. No volverÃƒÂ­a a los Estados Unidos hasta recoger el Oscar honorÃƒÂ­fico que le fue concedido en 1972.\n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:ce0dfa65ec1ec85bcaa5dbdebfbff7a5bdf9ef43","amp;dn":"Chaplin.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0dfa65ec1ec85bcaa5dbdebfbff7a5bdf9ef43","infoHashBuffer":{"type":"Buffer","data":[206,13,250,101,236,30,200,91,202,165,219,222,191,191,247,165,189,249,239,67]},"announce":[],"urlList":[]}}