{"title":"BulletStorm-by ozgurd","uid":6219640,"size":4676069812,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ced97a3487052b1153f2ca59bb5bcd24615f57ac&amp;dn=BulletStorm-by+ozgurd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0zgurd","files":2,"time":1299288242,"description":"Bulletstorm by 0zgurd\n\njust install and play\n\nuses flt proper fix \n\ndisks dvd5\n\nsize of iso is 4.35gb\n\njust Foreignlanguages removed Thats all\n\ntested the complete game 100%\n\nno Degrades of videos\n\n\nGame Info\nBulletstorm is a first-person shooter (FPS) in which players find\nthemselves stranded on a planet that although once an adult-oriented\nparadise planet, is now hell incarnate, complete with savage mutants\nand flesh-eating gangs. The goal is simple: survive, escape the planet\nand pay back the SOB who sent you there. Additional features include\ndeep 2-4 player support, a wide variety of ways to defeat enemies both\nlarge and small, an impressive arsenal of weapons and a Marvel Comics\nwritten storyline.\n\nGame Features\n* Incredible New &quot;Skillshot&quot; System - Combine outrageous gunplay\nwith Bulletstorm's unique kick, slide and leash mechanics as you kill\nwith skill. Every enemy presents a new opportunity for stylish,\nover-the-top and ever increasingly bloody ways to take them down.\n* The Circle of Awesome - Kill with skill to rack up the points. Cash\nin these points for upgrades. Use these upgrades to pull off even\nbigger and better &quot;skillshots&quot; and earn even more points. Bulletstorm's\nupgrade system truly is a circle of awesome that rewards players who\nkill in the most creative ways.\n* Badass Weaponry - From your trusty Peace Maker Carbine to the explosive\nFlail Gun, Bulletstorm delivers an arsenal of the most inventive,\ndeath-dealing weapons ever seen that truly put the fun back into the\nFirst Person Shooter.\n* A Pulp Sci-fi Adventure - Featuring a script by the acclaimed Marvel\nComics writer Rick Remender (The Punisher), Bulletstorm takes you on a\njourney filled with plot twists and turns from betrayal to revenge and\nultimately redemption.\n* A Dangerous Planet of Forgotten Paradise - Travel from scorched\ndesserts to tropical forests and an adult playground resort on a beautifully\nrealized paradise defiled, delivered by the power of the Unreal Engine\n\n\nMinimum System Requirement\nOS: Windows XP (SP3), Windows Vista (SP2), or Windows 7\nProcessor: Intel Core 2 Duo, AMD Athlon X2, or equivalent, running at 1.6 GHz or greater\nRAM: 1.5 GB\nHard Drive: 9 GB Available\nVideo Card: DirectX 9.0c compatible, 256 MB of VRAM; NVIDIA GeForce 7600 GS, ATI Radeon HD 2400 Pro 256 MB, or greater\nSoundcard: DirectX 9.0c compatible, 16-bit\nDisc Drive: 16X CD/DVD Drive\nOther: Network Internet (TCP/IP) connection\n\nenjoy the game \t","torrent":{"xt":"urn:btih:ced97a3487052b1153f2ca59bb5bcd24615f57ac","amp;dn":"BulletStorm-by+ozgurd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced97a3487052b1153f2ca59bb5bcd24615f57ac","infoHashBuffer":{"type":"Buffer","data":[206,217,122,52,135,5,43,17,83,242,202,89,187,91,205,36,97,95,87,172]},"announce":[],"urlList":[]}}