{"title":"Rumpole and the Primrose Path - John Mortimer","uid":6223223,"size":96634357,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf8b7c3057db1a886c27ed4a7fb6f9ed25b171bc&amp;dn=Rumpole+and+the+Primrose+Path+-+John+Mortimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":8,"time":1299417293,"description":"Audio Books : Mystery : Other quality : English\nUnabridged and read by Bill Wallis. 6 hours 42 mins duration. 6 CD's. (32kbps / 22 kHz Mono, Fraunhofer CBR, jetAudio 6+ )\n\n \n[2002]\nRumpole suffered a heart attack in an earlier book and the six stories that comprise THE PRIMROSE PATH occur across the year following that event. The first in the collection, the title story, was on the short list for an Edgar Award when it was published. It finds Rumpole consigned to a convalescent home. When the only bright light in the place, a pleasant nurse, is accused of murdering another patient she befriended, he gladly makes his escape to help her and proves to everyone around him that contrary to their expectations, there's quite a bit of life left in him yet! The other stories include &quot;Rumpole and the New Year's Resolutions,&quot; &quot;Rumpole and the Right to Privacy,&quot; &quot;Rumpole and the Scales of Justice,&quot; &quot;Rumpole and the Vanishing Juror,&quot; and &quot;Rumpole Redeems Himself.&quot; Author Mortimer works from formula, but who cares? It's his original formula and he makes it work over and over again. This is a strong batch of stories that as usual satirise contemporary zeitgeist while sorting out very real issues like of privacy rights vs. public interest, evidence vs. appearances, and juror regulations. Rumpole's is a witty, garrulous voice that asks the other characters in his life to turn down the volume on assumptions, pretentions and biases just long enough to hear the truth.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cf8b7c3057db1a886c27ed4a7fb6f9ed25b171bc","amp;dn":"Rumpole+and+the+Primrose+Path+-+John+Mortimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf8b7c3057db1a886c27ed4a7fb6f9ed25b171bc","infoHashBuffer":{"type":"Buffer","data":[207,139,124,48,87,219,26,136,108,39,237,74,127,182,249,237,37,177,113,188]},"announce":[],"urlList":[]}}