{"title":"INXS - Need Yonight [promo].VOB","uid":6246643,"size":121487360,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cfb6425e31c2dc2f38dcaa4ce208094176186229&amp;dn=INXS+-+Need+Yonight+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1300259999,"description":"INXS - Need You Tonight [promo].VOB\n\n\nVery HQ rare promo music video with untouched AC3 6ch audio from the promo DVD. &quot;Need You Tonight&quot; is the fourth song on INXS's 1987 album Kick as well as the first single from the album released worldwide. It is the only INXS single to reach #1 on the Billboard Hot 100. It also achieved their highest peak at number two on the UK Singles Chart, however this peak was only reached after a re-release of the single in November 1988. On its first run on the UK Charts in October 1987, it stalled at No. 58. While it would arguably become the band's signature song, it was one of the last songs recorded for the album.\n\nThe music video combined live action and different kinds of animation. Directed by Richard Lowenstein, the complete video was actually &quot;Need You Tonight / Mediate&quot;, as it combined two songs from the album. Lowenstein claimed that the particular visual effects in &quot;Need You Tonight&quot; were created by cutting up 35mm film and photocopying the individual frames, before re-layering those images over the original footage.\n\nThe video won five MTV Video Music Awards including Video of The Year and was ranked at number twenty-one on MTV's countdown of the 100 greatest videos of all time.\n\nINXS (pronounced &quot;in excess&quot;) is an Australian rock and New Wave band, formed as The Farriss Brothers in 1977 in Sydney. Mainstays are Garry Gary Beers on bass, Andrew Farriss on keyboards, Jon Farriss on drums, Tim Farriss on lead guitar and Kirk Pengilly on guitar/sax. For twenty years they were fronted by Michael Hutchence on lead vocals, whose &quot;sultry good looks&quot; and magnetic stage presence made him the focal point of the band. Initially known for their New Wave/ska/pop style, they later developed a harder pub rock style, including funk and dance elements.\n\nINXS has won six Australian Recording Industry Association awards including three for 'Best Group' in 1987, 1989 and 1992, and was inducted into the ARIA Hall of Fame in 2001. To date INXS have sold more than 30 million records.\n(video does not have any logos)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Need_You_Tonight&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Need_You_Tonight&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/PaeHIAadH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PaeHIAadH&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 6700kbps\n   Audio: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Duration: 00:03:09\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*          &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) ","torrent":{"xt":"urn:btih:cfb6425e31c2dc2f38dcaa4ce208094176186229","amp;dn":"INXS+-+Need+Yonight+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfb6425e31c2dc2f38dcaa4ce208094176186229","infoHashBuffer":{"type":"Buffer","data":[207,182,66,94,49,194,220,47,56,220,170,76,226,8,9,65,118,24,98,41]},"announce":[],"urlList":[]}}