{"title":"Ok: The Improbable Story of America's Greatest Word-Mantesh","uid":6187577,"size":12180297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d03359f36d2fffd3afc25e11465da20eb53567ca&amp;dn=Ok%3A+The+Improbable+Story+of+America%5C%27s+Greatest+Word-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MANTESH","files":2,"time":1298163746,"description":" &lt;a href=&quot;http://i1130.photobucket.com/albums/m521/cikachuno/0195377931.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i1130.photobucket.com/albums/m521/cikachuno/0195377931.jpg&lt;/a&gt;\n\n\n\n\n\n\n\n\nOxford University Press \nAllan Metcalf\nEnglish\n2010 \nISBN: 0195377931 \n224 pages \nPDF \n12 MB\n\n\n\nIt is said to be the most frequently spoken (or typed) word on the planet, more common than an infant's first word ma or the ever-present beverage Coke. It was even the first word spoken on the moon. It is &quot;OK&quot;-- the most ubiquitous and invisible of American expressions, one used countless times every day. Yet few of us know the secret history of OK--how it was coined, what it stood for, and the amazing extent of its influence.\n\nAllan Metcalf, a renowned popular writer on language, here traces the evolution of America's most popular word, writing with brevity and wit, and ranging across American history with colorful portraits of the nooks and crannies in which OK survived and prospered. He describes how OK was born as a lame joke in a newspaper article in 1839--used as a supposedly humorous abbreviation for &quot;oll korrect&quot; (ie, &quot;all correct&quot;)--but should have died a quick death, as most clever coinages do. But OK was swept along in a nineteenth-century fad for abbreviations, was appropriated by a presidential campaign (one of the candidates being called &quot;Old Kinderhook&quot;), and finally was picked up by operators of the telegraph.\n\nOver the next century and a half, it established a firm toehold in the American lexicon, and eventually became embedded in pop culture, from the &quot;I'm OK, You're OK&quot; of 1970's transactional analysis, to Ned Flanders' absurd &quot;Okeley Dokeley!&quot; Indeed, OK became emblematic of a uniquely American attitude, and is one of our most successful global exports. Anyone who loves the life of words or the quirky corners of American culture will find this delightful book more than just OK.\n\n\n\n\n[/code][/b]","torrent":{"xt":"urn:btih:d03359f36d2fffd3afc25e11465da20eb53567ca","amp;dn":"Ok%3A+The+Improbable+Story+of+America%5C%27s+Greatest+Word-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03359f36d2fffd3afc25e11465da20eb53567ca","infoHashBuffer":{"type":"Buffer","data":[208,51,89,243,109,47,255,211,175,194,94,17,70,93,162,14,181,53,103,202]},"announce":[],"urlList":[]}}