{"title":"Loto dorado [ebook].","uid":6227309,"size":71627198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0b0fc6d377ca40c6fa1b0a99c58878ca76ae9ac&amp;dn=Loto+dorado+%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zurera","files":-1,"time":1299566738,"description":"Loto Dorado forma parte de un famoso ciclo novelÃƒÂ­stico chino de tema erÃƒÂ³tico titulado Chin Ping Mei, escrito en la segunda mitad del siglo XVI por un autor anÃƒÂ³nimo del periodo Chia-ching. Como la literatura galante o licenciosa francesa de los siglos XVII y XVIII, el Chin Ping Mei ha sufrido persecuciones y eclipses. Publicada la obra por primera vez en 1610, fue prohibida por un edicto del emperador Kang Hisis del aÃƒÂ±o 1687 contra los libros licenciosos, pero no por ello dejÃƒÂ³ de ser una de las novelas mÃƒÂ¡s populares de la ÃƒÂ©poca. Cuando fue traducida al manchÃƒÂº a principios del siglo XVIII, la censura oficial manchÃƒÂº obligÃƒÂ³ de nuevo a la obra a tener una vigencia clandestina. Las leyes de la dinastÃƒÂ­a manchÃƒÂº contra los libros de literatura erÃƒÂ³tica eran muy severas para quienes las infringÃƒÂ­an, fuesen los autores, editores o libreros; y por lo que respecta a los lectores, si alguno era sorprendido leyendo un libro de tal ÃƒÂ­ndole era condenado a recibir cien azotes. La vigencia de dichas leyes durÃƒÂ³ hasta 1912. A pesar de sus reiteradas persecuciones, Loto Dorado y las otras novelas del Chin Ping Mei se han seguido publicando, en ediciones de lujo o corrientes.\n\n\n\n\n\nLas razones de esta popularidad son obvias: se deben a su interÃƒÂ©s como novela en sÃƒÂ­ y a las audacias de sus descripciones del amor carnal, mÃƒÂ¡s emparentadas con la gracia salaz de CrÃƒÂ©billon que con la mecÃƒÂ¡nica cruel del erotismo de Sade, aunque no ha faltado crÃƒÂ­tico que haya afirmado que Loto Dorado prefigura al marquÃƒÂ©s de Sade en el hecho de que la virtud es castigada y el vicio recompensado, aunque Hsi Men, el protagonista, encuentra al final el castigo que merecen sus excesos, pero no es un castigo de orden moral, sino natural, como verÃƒÂ¡ el lector.","torrent":{"xt":"urn:btih:d0b0fc6d377ca40c6fa1b0a99c58878ca76ae9ac","amp;dn":"Loto+dorado+%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b0fc6d377ca40c6fa1b0a99c58878ca76ae9ac","infoHashBuffer":{"type":"Buffer","data":[208,176,252,109,55,124,164,12,111,161,176,169,156,88,135,140,167,106,233,172]},"announce":[],"urlList":[]}}