{"title":"Coast to Coast - Mar 24 2011 - Genetic Engineering","uid":6281681,"size":55856528,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d1fcce8cfbb810d867da83963a66135efda53222&amp;dn=Coast+to+Coast+-+Mar+24+2011+-+Genetic+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":4,"time":1301459598,"description":"Genetic Engineering\n\nDate: 03-24-11 \nHost: George Noory \nGuests: Jon Rappoport, Richard C. Hoagland \n\nInvestigative reporter Jon Rappoport warned of alarming future trends in the genetic engineering of human beings. Based on his contacts with several scientists over a period of 20 years, he\\'s concluded that human genetics research is basically a continuation of the Nazi eugenics program, and that medical research into genes as causes of human illness is simply a cover story. \n\nPart of this secret agenda, he detailed, is to demonstrate that people have genetic predispositions to certain diseases like cancer, so in the case of lawsuits, this argument can be made rather than placing blame for illness on environmental factors like pollution. In citing the book Remaking Eden, Rappoport noted that author Lee Silver foresees a time when the \\&quot;gen-rich\\&quot; (genetically enhanced class) will account for 10% of the population, while \\&quot;naturals\\&quot; will work as low paid service providers/laborers. \n\nEventually, the gen-rich class and the naturals will become entirely separate species, with no ability to crossbreed, Silver continued, adding that the trend for genetic enhancement was inevitable. Rappoport had no doubt that some of this research was already underway, possibly under compartmentalized lab studies, so that scientists don\\'t even realize the significance of what they\\'re working on. \\&quot;The best thing that could happen,\\&quot; he stated, \\&quot;is that recognized doctors and researchers stand up together, and say, this has to stop.\\&quot; \n\nConversations with Richard C.\nIn the first hour, C2C science advisor Richard C. Hoagland touched on a variety of topics. He reported that just before the big quake in Japan, magnetometer readings spiked from Project HAARP in Alaska (but this info was subsequently removed from their website). Rather than causing the quake, he speculated that the readings could indicate that HAARP was unsuccessfully used to try and stop the quake. \n\nNews segment guest: Charles R. Smith \n\nWebsite(s): \nnomorefakenews.com \nenterprisemission.com \nBook(s): \nThe Ownership of All Life \nThe Secret Behind Secret Societies \nDark Mission\n\nthanks for seeding...","torrent":{"xt":"urn:btih:d1fcce8cfbb810d867da83963a66135efda53222","amp;dn":"Coast+to+Coast+-+Mar+24+2011+-+Genetic+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1fcce8cfbb810d867da83963a66135efda53222","infoHashBuffer":{"type":"Buffer","data":[209,252,206,140,251,184,16,216,103,218,131,150,58,102,19,94,253,165,50,34]},"announce":[],"urlList":[]}}