{"title":"COAST TO COAST AM 2011-03-06 - Physics, Light &amp; God","uid":6226135,"size":55815478,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d398aa3c5bf77ccc2598f4d89890cd84d7fed622&amp;dn=COAST+TO+COAST+AM+2011-03-06+-+Physics%2C+Light+%26+God&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1299516719,"description":"\nPhysics, Light &amp; God\n--------------------\nDate: 03-06-2011\nHost: George Noory\n\nGuests: Fred Alan Wolf, Marla Martenson\n\n\nPhysicist, writer and lecturer, Fred Alan Wolf, aka Dr. Quantum, discussed how physics is finally understanding the profound implications of God's command: &quot;Let there be light,&quot; as science and spirituality merge. He outlined three important discoveries in quantum physics: The universe is not made of solid stuff, but is composed of the acts of consciousness that observe and recognize it; there is a mind-field that must be present in order for there to be a universe; and everything in the universe is made of light. He referred to various types of light as &quot;luxon,&quot; which not only includes light we see around us, but electrons, quarks, and other subatomic matter.\n\nDescribing the mind-field, he noted that the mind is not contained in the body, but rather the body is contained in the mind, and we are all of this one mind, and not separated from one another. The purpose of life stems from &quot;God wanting to have this experience...we all sense the desire to have life...and as soon as we stop desiring these kinds of cycles, these kinds of dreams, the dream will change,&quot; he stated.\n\nTime loops as demonstrated in the Higgs Field, where particles interact and go backward in time and turn into a loop, fascinatingly hint that time isn't only a one-way street, he detailed. He spoke about the concepts of deja vu, and the more exciting phenomenon of Jamais vu-- &quot;a sudden recognition that something new has just occurred.&quot; Wolf also suggested people become more aware of what is happening in their lives, and by steering away from strictly material goals, they can gain more insight into the mind.\n\nLaw of Attraction:\nFirst hour guest, matchmaker Marla Martenson talked about the law of attraction and how people can make things happen. People are electromagnetic beings-- like big magnets, and the way they vibrate affects what they attract, she explained. Feelings create vibratory levels, and thoughts create feelings, so one should pay careful attention to their thoughts, and keep them positive, she added.\n\nNews segment guests: Catherine Austin Fitts, Robert Zimmerman\n\n\nWebsites:\nfredalanwolf.com\nweb.mac.com/marlamartenson/Site/Marla_Martenson.html\n\nBooks:\nTime Loops and Space Twists\nYoga of Time Travel: How the Mind Can Defeat Time\nTaking the Quantum Leap: The New Physics\nExcuse Me, Your Soul Mate Is Waiting\nDiary of a Beverly Hills Matchmaker\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d398aa3c5bf77ccc2598f4d89890cd84d7fed622","amp;dn":"COAST+TO+COAST+AM+2011-03-06+-+Physics%2C+Light+%26+God","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d398aa3c5bf77ccc2598f4d89890cd84d7fed622","infoHashBuffer":{"type":"Buffer","data":[211,152,170,60,91,247,124,204,37,152,244,216,152,144,205,132,215,254,214,34]},"announce":[],"urlList":[]}}