{"title":"Football Manager 2011 V11.3.0 Spanish/English","uid":6236374,"size":1884085517,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3ecb518ada2bdefce6417554cc5a34afb36fc24&amp;dn=Football+Manager+2011+V11.3.0+Spanish%2FEnglish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JohanSebastianCruyff","files":2823,"time":1299885791,"description":"Languages/Lenguajes: Spanish/English....If you want any other lenguage, just ask for it.\n\nIt\\\\\\'s full game. Don\\\\\\'t need instalation. Just Download and play! Easy. It\\\\\\'s allready cracked and updated to V11.3.0.\n\nNo bullshit, it\\\\\\'s work. Any question, problem, just comments.\n\n\nLa ediciÃƒÂ³n de 2011 estÃƒÂ¡ mÃƒÂ¡s pulida que nunca, Sports Interactive vuelve a establecer un nuevo estÃƒÂ¡ndar para el gÃƒÂ©nero con la adiciÃƒÂ³n de un sinfÃƒÂ­n de caracterÃƒÂ­sticas nuevas. Por primera vez, los aspirantes a mÃƒÂ¡nager puede negociar los contratos con los futbolistas en tiempo real. Y gracias a la colaboraciÃƒÂ³n de multitud de agentes de fÃƒÂºtbol de la vida real, Sports Interactive ha aprendido a reflejar estas negociaciones en el juego con toda la fidelidad posible. PrepÃƒÂ¡rate para encontrarte con distintos tipos de agentes en tus charlas contractuales; cada uno tiene su propia personalidad que requerirÃƒÂ¡ una aproximaciÃƒÂ³n diferente. \n\nCon la implementaciÃƒÂ³n del sistema de entrenamientos mÃƒÂ¡s intuitivo de la saga, existe una nueva zona de entrenamiento para la \\\\\\&quot;preparaciÃƒÂ³n del partido\\\\\\&quot; en la que los mÃƒÂ¡nagers pueden dar a su equipo ÃƒÂ¡reas especÃƒÂ­ficas en las que centrarse antes del partido. TambiÃƒÂ©n hay agendas de entrenamiento mÃƒÂ¡s bÃƒÂ¡sicas para los futbolistas y 14 habilidades individuales diferentes en las que puedes enfocar a tus jugadores. \n\nLa interacciÃƒÂ³n con los jugadores, cuerpo tÃƒÂ©cnico y directiva ha llegado a un nuevo nivel, con una gran cantidad de nuevas peticiones de sala de juntas y de actividades internas, un nuevo mÃƒÂ³dulo de interacciÃƒÂ³n con los futbolistas que permite al mÃƒÂ¡nager tener charlas privadas con los mismos, ademÃƒÂ¡s de conversaciones pÃƒÂºblicas sobre futbolistas de otros equipos. \n\nDos aÃƒÂ±os despuÃƒÂ©s del lanzamiento del Motor de Partidos en 3D, los jugadores podrÃƒÂ¡n ver nuevas mejoras que se han implementado en el juego de este aÃƒÂ±o. Con mÃƒÂ¡s de 100 nuevas animaciones, ademÃƒÂ¡s de nuevos gestos de los futbolistas, nuevos modelos, nuevos estadios, texturas del cÃƒÂ©sped, iluminaciÃƒÂ³n mejorada, partidos con iluminaciÃƒÂ³n nocturna, mÃƒÂ¡s celebraciones para los goles y muchos mÃƒÂ¡s extras que mejorarÃƒÂ¡n la que ya era una de las mejores simulaciones de partidos del mercado. \n\nOtras caracterÃƒÂ­sticas nuevas incluyen un mÃƒÂ³dulo de medios mejorado, que mantendrÃƒÂ¡ a los mÃƒÂ¡nagers al tanto de los eventos que se dan en su mundo del fÃƒÂºtbol, ademÃƒÂ¡s de ser mÃƒÂ¡s personalizable que antes. Y la caracterÃƒÂ­stica mÃƒÂ¡s solicitada en los ÃƒÂºltimos aÃƒÂ±os por la comunidad de Sports Interactive, la reputaciÃƒÂ³n dinÃƒÂ¡mica de la liga, que permite un modelo de simulaciÃƒÂ³n del mundo del fÃƒÂºtbol aÃƒÂºn mÃƒÂ¡s realista. \n\n\n\n\nSystem R:\n\nSO: Windows XP / Vista / W7 \nCPU: XP: 1.4 GHz o mejor; Vista / W7: 2.0 GHz o mejor \nRAM: XP: 512 MB de RAM; Vista / W7: 1.0 GB de RAM \nVIDEO: 128 MB de VRAM; Chipsets Soportados - Nvidia FX 5900 Ultra o mejor; ATI Radeon 9800 o mejor; Intel 82915G / 82910GL o mejor. Las grÃƒÂ¡ficas anteriores a estos modelos podrÃƒÂ­an mostrar sÃƒÂ³lo el Visor de Partido en 2D y ademÃƒÂ¡s podrÃƒÂ­an no ser compatibles \nDirectX: VersiÃƒÂ³n 9.0c (incluido) \nDISC: 2 GB de espacio libre \nSONIDO/Sound: Compatible con DirectX 9.0c \n\nIt\\\\\\'s my first torrent..Hope you like it. ","torrent":{"xt":"urn:btih:d3ecb518ada2bdefce6417554cc5a34afb36fc24","amp;dn":"Football+Manager+2011+V11.3.0+Spanish%2FEnglish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ecb518ada2bdefce6417554cc5a34afb36fc24","infoHashBuffer":{"type":"Buffer","data":[211,236,181,24,173,162,189,239,206,100,23,85,76,197,163,74,251,54,252,36]},"announce":[],"urlList":[]}}