{"title":"Deep Blue Sea(1999)DVDRip.AC3(ENG)-DROCK","uid":6222264,"size":733564212,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d419c8755871702fad97667238ded4cac96eb6db&amp;dn=Deep+Blue+Sea%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1299376143,"description":"Although mako sharks are among the fastest and deadliest predators in the ocean, they're not as smart as humans -- at least, they weren't. However, Dr. Susan McAlester (Saffron Burrows) has been using mako sharks as her test subjects for research on the regeneration of human brain tissues. McAlester has altered the DNA of several sharks, raising them close to the level of human intelligence; the sharks have also become faster and stronger in the process. While these DNA experiments have yielded fascinating results, they're also of questionable ethics and legality, earning her the distrust of several members of her crew, including shark authority Carter Blake (Thomas Jane and cook &quot;Preacher&quot; Dudley (LL Cool J). The financial backers of these experiments have also expressed skepticism, so when McAlester is ready to perform some major tests, financier Russell Franklin (Samuel L. Jackson) arrives for the occasion. McAlester and her team are delicately extracting brain tissue from one of the altered makos when the animal regains consciousness - and becomes very angry. The shark not only attacks the researchers but also damages the floating lab, leaving the crew aboard a literally sinking ship, with the makos eager to go a few rounds - in an arena that favors sharks. Deep Blue Sea was directed by Renny Harlin, and filmed in Mexico at Fox Studios Baja in the underwater filming facilities created for James Cameron's Titanic. \n\nRipped with Handbrake.\n\nLength: 1 Hour 45 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:d419c8755871702fad97667238ded4cac96eb6db","amp;dn":"Deep+Blue+Sea%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d419c8755871702fad97667238ded4cac96eb6db","infoHashBuffer":{"type":"Buffer","data":[212,25,200,117,88,113,112,47,173,151,102,114,56,222,212,202,201,110,182,219]},"announce":[],"urlList":[]}}