{"title":"Dayramir &amp; Habana enTRANCe [FLAC] TQMP","uid":6221917,"size":380234301,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d497b9e65cc8afa43358167bf24b39756a99bcfc&amp;dn=Dayramir+%26+Habana+enTRANCe+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pastafari","files":-1,"time":1299360798,"description":"Dayramir &amp; Habana enTRANCe\n2007\n\nCuban Music Series. The New Generation.\n\nJoJazz, 2005 (Cuban Jazz Contest)\nWinner\nCubadisco 2008\nNominee for Best Jazz Album and Best Newcomer.\n(He lost to Harold Lopez-Nussa's Canciones, previously posted here)\n\nBrought to you by TQMP\nThe Quality Music Project\n\nDayramir Gonzalez (Havana, 1983) began playing at the age of 16 with Diakara, former Irakere Oscar Valdes' band. He played night clubs in Havana and Jazz Plaza festivals in 2000 and 2001. In 2005 he joins Klimax, one of the top timba bands in Cuba, playing for audiences in Spain. Back in Havana he starts his own band, Dayramir &amp; Habana enTrance and wins JoJazz 2005, a contest for new jazz talents in Cuba. This gives him a chance to debut recording. The result is an amazing record that showcases Dayramir talent.\n\nFeaturing guitar wizard Elmer Ferrer, fomer Irakere sax players Cesar Lopez and Javier Zalba, and sax and clarinet player Orlando Sanchez (aka Cubajazz).\n\n[ESPAN~OL]\nEl sello Cinquillo de la Casa Discografica Producciones Colibri se complace en presentar el opus uno de un joven pianista, Dayramir Gonzalez, que se hace acompan~ar por una nomina de estrellas, derecho ganado por el talento y resonancia que desde muy temprano alcanzan muchos de estos jovenes en el panorama jazzistico en Cuba. Asi, los invitados de larga data profesional que acceden a este fonograma, lo hacen en abrazo de iguales.\n\nComo resultado del vuelco que dio a la fusion Chucho Valdes en los 70's a partir de 'Misa Negra', 'Juana 1600','Estela va a estallar', 'Danza de los N~an~igos' y tantos otros clasicos, en ese gran &quot;tren&quot; que es la fusion, se han montado toda suerte de componentes ( y no dejan de llegar otros nuevos) que en realidad son los perfiles basicos de los generos de la musica popular cubana: el cha cha cha, la rumba, el son, el mambo, el filin, a los que se siguen sumando otros,( foraneos y nacionales) como la salsa, la timba, el rap y cualesquiera otros que vengan a cuento.\n\nDayramir Gonzalez es un joven graduado de la Escuela Nacional de Arte (ENA) y cursa la carrera de composicion en el Instituto Superior de Arte (ISA). Ha sido premiado en el concurso Jojazz, lid para jovenes jazzistas, (edicion del 2004) e integra la nomina de excelentes musicos que agrupa el baterista Giraldo Piloto en el grupo Klimax.\n\nEs sabido que por nuestras agrupaciones de la musica bailable han pasado musicos que han devenido monstruos sagrados de la musica cubana: desde Lili Martinez en el Conjunto de Arsenio Rodriguez, pasando por Ruben Gonzalez en la orquesta de Enrique Jorrin, Juan Formell en la orquesta Reve, los hermanos Israel y Orestes Lopez en la orquesta de Arcan~o y sus Maravillas y asi pudieramos continuar en una larga lista.\n\nKlimax es del tipo de agrupaciones que como NG la Banda y hasta la mismisima super banda Irakere, propicia, dada su propuesta de amplio espectro, que sus musicos interactuen y se retroalimenten. Resultado: la fusion de hoy dia en Cuba es una mixtura bien compleja, sin fronteras de generos y que parece regirse por una maxima comun a todos sus cultivadores: la frescura, la actualidad, la fluidez con que decursan todos los componentes que la integran.\n\nCon un contexto semejante y nutrido durante su formacion academica de los clasicos correspondientes, Dayramir tiene todos los ingredientes para poner su olla al fuego. Es asi que partiendo de un &quot;caldo&quot; de latin jazz, encuentran su tono adecuado, lo mismo un danzon, que un cha cha cha, que una timba, que un rap, que un clasico del filin.\n\nPartiendo de estas premisas, en paralelo con su labor dentro de Klimax, Dayramir ha creado su propia formacion, Habana Entrance, con jovenes musicos con los que cruzo travesuras en las aulas de la ENA y que gozan al igual que el, de excelentes ubicaciones en formaciones como el cuarteto de Chucho Valdes, Habana Ensemble ( que dirige el saxofonista Cesar Lopez), Afro Cuban All Star, que dirige el creador del Buena Vista Social Club, el tresero y orquestador Juan de Marcos Gonzalez y el grupo Diakara( que dirige el ex Irakere Oscar Valdes).\n\nY por si fuera poco, ha tenido el privilegio de contar como invitados, a musicos de la talla del guitarrista Elmer Ferrer, el rumbero Amado Dedeu (director del grupo Clave y Guaguanco), y tres grandes saxofonistas: los ex-Irakere Javier Zalba, y Cesar Lopez y el tambien clarinetista y ex integrante del grupo de Pablo Milanes, Orlando Sanchez, Cubajazz.\n\nUno de los rasgos mas sobresalientes de este registro es la total imposibilidad de llegar al aburrimiento, a la sensacion de estar oyendo &quot;mas de lo mismo&quot;. La diversidad de generos abordados y el acierto de los formatos utilizados en cada tema constituyen de por si la garantia de atender y disfrutar cada uno, tan diferente del anterior.\n\n&quot;Gozando&quot;, es la credencial que da inicio a este fonograma. Especie de definicion del perfil, asentamiento de bases del discurso armonico, derroteros sonoros y ritmicos que le interesan a nuestro protagonista, que nos tiene deparadas muchas sorpresas en el transcurso de este disco.\n\nCon un claro proposito de evocar las primeras formaciones danzoneras del siglo XIX, en las que el clarinete tenia un gran protagonismo, Dayramir, nos propone este delicioso tema: &quot;Complaciendo peticiones&quot;, en el que emplea una formacion de dos clarinetes y un clarinete bajo, apareciendo como solista Orlando Sanchez.\n\nEn la estructura del tema, juega con la danza, el danzon y el cha cha cha, (pudiendose apreciar claramente la linea de continuidad genealogica), pero lo mejor es lo fluidamente que anda y desanda de uno al otro y con sabrosura criolla, tradicional. Muy a tono su solo, sin desenfreno de notas, muy por el contrario, centrado en el estilo que acun~aran pianistas como Ruben Gonzalez, Bebo Valdes y Lili Martinez.\n\nUno de los temas mas sobresalientes en este disco: &quot;Interludio&quot;, de Cesar Portillo de la Luz, deviene en doble homenaje: tanto al creador (junto a Jose Antonio Mendez) del filin, como a ese principe indiscutible de la recreacion de temas de filin en el piano: el ya desaparecido pianista ciego Frank Emilio Flynn. Bravo por la eleccion y aun mas por la interpretacion. Solo una cosa no concuerda en este corte: la absoluta maestria con que Dayramir aborda el tema y su extrema juventud. Esa madurez y buen gusto; la pausa y comedimiento, son propios de los que estan ya &quot;de regreso&quot;. Enhorabuena por esta leccion de buen arte.\n\nYa deciamos antes que estos jovenes de la vanguardia creativa de esta isla echaban en su &quot;olla&quot; cuanto elemento sintieran que encajara bien para expresarse. Es asi que el rap entronca con este tema: &quot;San Francisco.com.&quot; Con los raperos del grupo Obsesion, como invitados, este excelente tema se gasta ademas el lujo de incorporarle un texto,  (Ã‚Â¡un texto!)  en el que abordan con inspiracion y honestidad la problematica de que hacer con el tiempo libre, pero quienes buscan que hacer son estos mismos musicos que necesitan acceder a lugares donde escuchar buena musica, &quot;hacer tierra&quot; e interactuar. Y como invitado de lujo, el saxofonista Cesar Lopez, con el swing a que nos tiene acostumbrados. Abrazo de jovenes y consagrados que comulgan en el mismo caliz:  el de la sensibilidad y  derroteros coincidentes.\n\nDe muy buena factura &quot;Mabel's cha&quot;, tanto el tema como el arreglo. Virtuosa e interesante exposicion en bloque de metales y reposada, &quot;como va&quot; la improvisacion de otro de los invitados: el saxofonista y flautista Javier Zalba.  Notese que el pianista que descarga aqui, es el mismo de &quot;Interludio&quot; y de &quot;Complaciendo peticiones&quot;. Con tantos invitados relevantes, si no se tratara de su opus uno como pianista y creador, hubiesemos apostado que el solo de piano ha estado interpretado por veteranos tan respetables como Emilio Morales o Ernan Lopez-Nussa.\n\nUno de los temas mas interesantes, por su riqueza melodico armonica y por la acertada combinacion de la flauta y el clarinete (y las gratas apariciones de los intervalos de cuarta!) es &quot;Camello tropical&quot; ( nada casual este titulo, notese la cadencia del tema y los giros de la melodia). Nuevamente con la intervencion de Orlando Sanchez, &quot;Cubajazz&quot;. Nadie podia resultar mejor escogido que este musico para el solo de clarinete, ya que su discurso suele moverse en franjas &quot;extra muros&quot; de la tonalidad, en lo que vendria siendo un reflujo de SchÃƒÂ¶emberg y Coltrane. Vuelve a sorprendernos Dayramir con un solo que ya tenia como pie forzado, los ambitos por los que se movio Sanchez y que si fuesemos a poner en duda las capacidades de este joven pianista, hubiesemos dicho que se trataba del mismo musico que solto el clarinete y se sento al piano.\n\nDel exotismo de &quot;Camello tropical&quot;, viene un rapido cambio de telon con el danzon &quot;Kimb's blue eyes&quot;, con su correspondiente formato de charanga clasica (cello incluido) y toda la sabrosura y melodismo que exige el genero.\n\nDe que Dayramir tiene los &quot;Patrones&quot; que rigen su creacion muy claramente establecidos y delimitados, no hay duda: por los arreglos y tratamiento timbrico dado a cada tema, por el equilibrio entre la actualidad armonica, rompimientos ritmicos, el manejo de los bloques, las construcciones asimetricas, todo en perfecto encuadre con el genero abordado. No hay que pensar o adivinar que el sexto tema es un danzon, o que el quinto es un cha o que el octavo es un guaguanco. Palmas nuevamente para este joven musico por la perfeccion formal, sonora, la riqueza  (y ricura) de los coros y el arreglo en general de &quot;Patrones&quot;.\n\nCon un formato de jazz band, &quot;Invitation&quot; es el tema que denota que estamos ante el musico completo: creador fresco, de buena lira, bien entendido en los generos de la musica (la popular cubana, la foranea actual, la clasica), buen pianista y lider de banda, nos propone un tema como &quot;Invitation&quot;, donde todos los invitados son todo y parte, cada uno en su momento, con total entendimiento y disfrute de lo que hacen.\n\nSe despide Dayramir con un guin~o de ojos con el solo de piano &quot;Transicion&quot;. Ahi estan volcados sus an~os de estudios academicos, las fuentes clasicas a las que ha decidido tributar: desde Bach hasta Rachmaninov, las mismas  de las que se han servido Chick Corea, Keith Jarret, Chucho Valdes y todos los que han venido y vendran para ser capaces de pintar su paisaje con los mismos siete colores y entonar sus voces con las mismas siete notas que han existido siempre y que solo en manos de  los que han sido tocados por el talento, resultan siempre nuevas.\n\nFuente &lt;a href=&quot;\nhttp://www.lajiribilla.cu/2007/n347_12/347_25.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lajiribilla.cu/2007/n347_12/347_25.html&lt;/a&gt;\n\nTrack List\n01- Gozando\n02- Complaciendo peticiones (A Maria del Carmen)\n03- Interludio\n04- San Francisco.com\n05- Mabel's Cha\n06- Camello Tropical\n07- Kimb's blue eyes\n08- Patrones\n09- Invitation\n10- Transicion\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:d497b9e65cc8afa43358167bf24b39756a99bcfc","amp;dn":"Dayramir+%26+Habana+enTRANCe+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d497b9e65cc8afa43358167bf24b39756a99bcfc","infoHashBuffer":{"type":"Buffer","data":[212,151,185,230,92,200,175,164,51,88,22,123,242,75,57,117,106,153,188,252]},"announce":[],"urlList":[]}}