{"title":"PSP [CSO] FIFA 2011","uid":6140108,"size":927340225,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:d49956e924111fcbb4fb4fe358122e4b1d1f0713&amp;dn=PSP+%5BCSO%5D+FIFA+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"naresh97","files":1,"time":1296471317,"description":"HOW TO USE:\n\n1. Connect PSP to PC. (Must Run CFW)\n2. Transfer game file (CSO/ISO) to DRIVE:\\\\ISO\\\\\n\nHave fun :D\n\n\nFIFA 11 reinvents player authenticity on and off the ball for every player and at every position on the pitch with Personality+, an all-new feature that sees individual abilities reflected in game, enabling clear differentiation for every player.\n\nWith Personality+ a footballers abilities on the pitch is mirrored authentically in game, creating individual personalities. Players will be distinguished from one another through a sophisticated database that evaluates and grades each players skill-set over 36 attributes and 57 traits, compiled by 1700 scouts around the world. Real Madrids Kaka will deliver crisp, creative passes, Barcelonas Andres Iniesta will utilize tighter turns and close control to dribble through defenses, Manchester Uniteds Wayne Rooney will hold off defenders and strike shots from distance with pace, and top-flight defenders like Giorgio Chiellini of Juventus will anticipate, predict and react to offensive players to win back possession.\n\nGoalkeepers have also been injected with Personality+. The real-life personality of the keeper, whether acrobatic or traditional, will dictate his style in game. Dive attributes will determine the keepers with the ability to reach for further shots while reflex attributes determine reaction times, so a keeper like Petr Cech of Chelsea FC will show be able to showcase world-class skills.\n\nBuilding on the FIFA 10 gameplay that won 50 sports game of the year awards, FIFA 11 introduces new Pro Passing where pass accuracy is determined by a gamers ability on the control pad, and player skill, situation and urgency on the pitch, yielding a deeply rewarding passing system. Plus, a series of new customization tools will enable fans to transform FIFA 11 in new and personally meaningful ways. Assign customized chants for every team and league and play music tracks from your existing library from within the game.","torrent":{"xt":"urn:btih:d49956e924111fcbb4fb4fe358122e4b1d1f0713","amp;dn":"PSP+%5BCSO%5D+FIFA+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d49956e924111fcbb4fb4fe358122e4b1d1f0713","infoHashBuffer":{"type":"Buffer","data":[212,153,86,233,36,17,31,203,180,251,79,227,88,18,46,75,29,31,7,19]},"announce":[],"urlList":[]}}