{"title":"COAST TO COAST AM - 2011-02-15 - Economy &amp; NWO","uid":6178782,"size":55079404,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d4a321726e83a1e5b59094e15a1548e32e114f20&amp;dn=COAST+TO+COAST+AM+-+2011-02-15+-+Economy+%26+NWO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":6,"time":1297871461,"description":"\nEconomy &amp; NWO\n-------------\nDate: 02-15-2011\nHost: George Noory\n\nGuests: Damon Vickers, Howard Bloom\n\nChief Investment Officer of Nine Points Capital Partners, and author of The Day After the Dollar Crashes, Damon Vickers discussed how the New World Order (NWO) and globalization are not only inevitable but will usher in a new era of peace and prosperity for the entire world. &quot;I know that the New World Order has been vilified, but the order of things looks like it's in the process of changing; looks like we are moving towards something new,&quot; he said. He's created a video that depicts a 14 Day Timeline showing possible events leading up to the crash of the dollar and the aftermath. The crash might begin with the world refusing to buy U.S. Treasury notes, he detailed.\n\nHuge wage disparities such as between the US and China, as well as the disparity over the costs of production are creating &quot;fault lines&quot; that will result in a global currency crisis, he said, adding that when this enfolds we'll likely get an alignment of a global world government that shares a global currency. America's massive debt as well as the rest of the world's would be reset in a scenario he described as the Global Unification System. A global reserve would potentially replace the Federal Reserve, Vickers explained.\n\nWhile he believes the NWO will ultimately have a very positive effect, he admitted that the transition into it could prove to be difficult, with food scarcities and other problems arising. Vickers noted that even though we are citizens of a particular country, we are also residents of the world, and thus have a global identity. In the NWO, he believes a variety of cultural and religious identities can be preserved, just as multiculturalism is currently promoted in the US. He envisions a body of about 300 people coming together to represent various segments of the global population.\n\nCommentary on Middle East:\nFirst hour guest, author Howard Bloom offered commentary on the impact of the Middle Eastern turmoil. There's a major re-balancing of power going on in the Middle East with the United States, Saudi Arabia, and Iran the major players. Iran has a strong interest in Egypt and seeks to &quot;steal or to co-opt the Egyptian revolution,&quot; he suggested.\n\nNews segment guest: Catherine Austin Fitts, Babak Kalhor\n\nWebsites:\ndamonvickers.com\nnpm.us\nHowardBloom.net\n\nBooks:\nThe Day After the Dollar Crashes\nThe Genius of the Beast: A Radical Re-Vision of Capitalism\nThe Lucifer Principle: A Scientific Expedition into the Forces of History\n\n\n\n\nTHANKS TO ALL WHO ARE ABLE TO SEED.","torrent":{"xt":"urn:btih:d4a321726e83a1e5b59094e15a1548e32e114f20","amp;dn":"COAST+TO+COAST+AM+-+2011-02-15+-+Economy+%26+NWO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a321726e83a1e5b59094e15a1548e32e114f20","infoHashBuffer":{"type":"Buffer","data":[212,163,33,114,110,131,161,229,181,144,148,225,90,21,72,227,46,17,79,32]},"announce":[],"urlList":[]}}