{"title":"Drillbit Taylor(2008)DVDRip.AC3(ENG)-DROCK","uid":6240875,"size":733500244,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4d334fdeabf665a29466cf1bcf0c802cf392884&amp;dn=Drillbit+Taylor%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1300058405,"description":"Determined not to spend their entire high-school career being tormented by the local bully, three freshmen place an ad in Soldier of Fortune magazine seeking an experienced combat veteran to protect them in this comedy produced by Judd Apatow, penned by Seth Rogen and Kristofor Brown, and starring Owen Wilson. It's their first day of high school, and best friends Ryan (Troy Gentile), Wade (Nate Hartley), and Emmit (David Dorfman) are determined to make the most out of the next four years. Trouble soon arises, however, in the form of sadistic hallway hooligan Filkins (Alex Frost) -- an unrelenting bully who makes it his mission to ensure that these three friends suffer all the way through to their senior year. Desperate to find protection by any means possible, Ryan, Wade, and Emmit place an ad in Soldier of Fortune magazine. While most of the responses they get come from men who are either too experienced or too expensive, one down-on-his-luck mercenary named Drillbit Taylor (Wilson) is right in their price range and eager to help out. Drillbit may be homeless (or, as he likes to call it, &quot;home free&quot;), but he's more than willing to offer these three brave souls the mental and physical training needed to fend off Filkins and get on with their lives. Trouble is, Drillbit isn't quite the fearless freelance soldier he has made himself out to be. \n\nRipped with Handbrake.\n\nLength: 1 Hour 41 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:d4d334fdeabf665a29466cf1bcf0c802cf392884","amp;dn":"Drillbit+Taylor%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4d334fdeabf665a29466cf1bcf0c802cf392884","infoHashBuffer":{"type":"Buffer","data":[212,211,52,253,234,191,102,90,41,70,108,241,188,240,200,2,207,57,40,132]},"announce":[],"urlList":[]}}