{"title":"uTorrent Turbo Accelerator v 1.9.0.0 Incl Serial.rar","uid":6303980,"size":2769559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d55d9ab20b3fef5695a7477a4b2e79635e3b0786&amp;dn=uTorrent+Turbo+Accelerator+v+1.9.0.0+Incl+Serial.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chuckeles","files":1,"time":1302259858,"description":"uTorrent Turbo Accelerator is a newly added software in the family of the popular p2p client uTorrent plug-ins. The highly developed architecture behind this app allows you to download movies, music, games and other files you want at the highest possible speed. With uTorrent Turbo Accelerator not only the bandwidth of your Internet connection is managed noticeably with more efficiency but you will have the advantage of locating more sources to download from. \nIf uTorrent is your client of choice than uTorrent Turbo Accelerator should be your add-on of choice: it's that good. Let's admit it: whatever the speed of your download, you'll always crave for just a bit more. uTorrent Turbo Accelerator is just that bit.\nThe program enhances uTorrent's download features; though powerful, it remains unobtrusive with regard to other activities you might conduct on your PC so you won't be bothered by it nor will it eat up your resources, so again rest assured. Once it's running all you have to do is let it do its job. You'll be presented with detailed information about the status of your downloads.\nuTorrent Turbo Booster proves to be not only functional and intuitive but also coquettish. It offers a cool simple interface which will find a fan in any user (advanced or novice).\nThese are uTorrent Turbo Accelerator's main characteristics:\nNice-looking user-friendly interface;\nAutomatically resumes paused downloads;\nConfiguration from last run is saved and auto loads on start-up;\nFinished and invalid files are cleaned automatically;\nAllows finding multiple sources at user-specified intervals;\nClean and free, doesn't include any adware;\nSystem Requirements:\n- uTorrent installed, Windows 95/98/98SE/ME/NT/2000/XP/Win7, Internet connection \n\n","torrent":{"xt":"urn:btih:d55d9ab20b3fef5695a7477a4b2e79635e3b0786","amp;dn":"uTorrent+Turbo+Accelerator+v+1.9.0.0+Incl+Serial.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d55d9ab20b3fef5695a7477a4b2e79635e3b0786","infoHashBuffer":{"type":"Buffer","data":[213,93,154,178,11,63,239,86,149,167,71,122,75,46,121,99,94,59,7,134]},"announce":[],"urlList":[]}}