{"title":"Zygor Leveling Guides 3.1.1972 (April 5th, 2011)","uid":6304187,"size":3066892,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d6044ee7eeaa0061cc550910042a500dde52ab04&amp;dn=Zygor+Leveling+Guides+3.1.1972+%28April+5th%2C+2011%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"forland91","files":-1,"time":1302222426,"description":"Please help seed!\n\nInstructions:\n-------------------\n1. Download.\n2. Extract.\n3. Copy extracted folders to your WoW/Interface/AddOns folder.\n   - Both Horde and Alliance folders are included, if you don't play both, don't worry, WoW will only load the appropriate guide.\n4. Launch WoW.\n5. Once you are logged in and at your character screen, click the AddOns button and make sure that ZygorGuidesViewer and ZygorTalentAdvisor are checked.\n6. Launch the game and enjoy.\n\nBug Fixes:\n-------------------\nApril 5th, 2011\n\nAlliance Guides Change Log:\n* Changed first step in Elwynn Forest 7-10 guide to be the last step in Elwynn Forest 5-7 guide\n* Improved quest path in Netherstorm\n* Improved quest path in Shadowmoon Valley\n* Improved some Borean Tundra travel routes to account for new Cataclysm changes\n\nHorde Guides Change Log:\n* Improved quest path in Netherstorm\n* Improved quest path in Shadowmoon Valley\n\nGuides Viewer Change Log:\n* Fixed Single Guides to Show Alone in Suggest Tab to Avoid Confusion\n* Fixed Guide Losing Transparency Setting After Combat\n* Fixed Freeze Arrow Option (and renamed to &quot;Non-interactive&quot; in Waypoints options for clarity)\n* Fixed Clogwerk Arrow Color-by-Direction Not Working\n* Fixed Quest Detection Weirdness (some quests were being marked as completed when not even accepted yet)\n* Fixed Mobs With Commas in Their Names Being Incorrectly Pluralized\n* Fixed Corpse Arrow Not Working\n* Fixed View Creature NPC Bugs - Should now always display the correct npc\n* Fixed SIS &quot;Skip to Next Guide Early&quot; Popup to Wait to Display Until Out of Combat\n* Added Warning When Loading Guide Section With Too High Initial Level (actually, if the guide is improper for any reason)\n* Added &quot;Corpse humour&quot; Option - You may now disable corpse arrow comments :-)\n* Added New Player Position Arrow to Minimap - A cosmetic difference from the default one, just a tiny tweak so that the arrow rotates on its gem pivot, not on its own center and swiveling the pivot around. Will option this later, just in case you prefer the default player arrow functionality.\n* Added Zygor Logo to Warning Boxes For Clarity\n* Added / Edited NPCs\n\nTalent Advisor Change Log:\n* Fixed Talent Advisor Dropping Selected Build\n* Fixed Talent Advisor Incorrectly Claiming Talents Out of Order\n\nZygor Guides Info:\n-------------------\nThe Cataclysm is upon us! Level from 1-85 now with the fastest, most feature rich guide in the world.\n\n    Completely Redesigned Minimalist User Interface. Switch Between Full or Mini View Modes, the choice is yours\n    4 Full 1-60 Guides For Kalimdor &amp; Eastern Kingdoms. 40 Zones Covered, 12 More Than Competing Guides\n    2 Full 60-70 Guides For Outland and Northrend\n    5 Full 80-85 Guides For All Cataclysm Zones\n    Goblin and Worgen Starter Guides Included\n    In-Game Talent Build Advisor For All Skill Trees\n    Built In Waypoint Arrow, No TomTom Or Other Addons Needed\n    NEW! Loremaster Achievement Guide\n    All Dailies Covered for both Cataclysm and Wrath of the Lich King.\n    Covers all Prerequisites Required To Unlock Dailies including full zone guides for Uldum and Deepholm.\n    Speed Gold Runs Make You Over 300 Gold In Just An Hour\n    Includes All 10 Seasonal Events Needed For The What A Long, Strange Trip It's Been Achievement\n    Get Your Crusader Title And Earn Epic &amp; Heirloom Items","torrent":{"xt":"urn:btih:d6044ee7eeaa0061cc550910042a500dde52ab04","amp;dn":"Zygor+Leveling+Guides+3.1.1972+%28April+5th%2C+2011%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6044ee7eeaa0061cc550910042a500dde52ab04","infoHashBuffer":{"type":"Buffer","data":[214,4,78,231,238,170,0,97,204,85,9,16,4,42,80,13,222,82,171,4]},"announce":[],"urlList":[]}}