{"title":"Coast to Coast AM - 2011.02.18 - Full Moon Open Lines &amp; Middle E","uid":6191226,"size":54299642,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d6cf5c840897d148efd571a86d468135235d04be&amp;dn=Coast+to+Coast+AM+-+2011.02.18+-+Full+Moon+Open+Lines+%26+Middle+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pegasus77","files":5,"time":1298293955,"description":"Full Moon Open Lines / Middle East Unrest\n  \nDate: \t02-18-11\nHost: \tGeorge Noory\nGuests: Open Lines, Greg Hunter\n\nGeorge Noory hosted an evening of Full Moon Open Lines that included callers talking about Earth changes, 2012, and chemtrails. Mary in Madison, Wisconsin claimed that the global warming problem was actually solved in 2007 as a result of a &quot;simple chemical put in the atmosphere to grab the high amounts of carbon dioxide.&quot; Allegedly, she was the one who discovered this chemical solution to bind carbon dioxide and filed the patent on it after her discovery. &quot;Within weeks,&quot; she said, the government stole the formula from her and began spraying it into the air. She was reticent to reveal it on the program, since it could be used as a weapon and &quot;I would feel very responsible.&quot; Additionally, Mary explained that this solution to global warming has not been announced to the public because &quot;there's a lot of politics involved in it,&quot; citing the economic push for 'greener' transportation and population control.\n\nJ.B. in Kentucky shared his theory, based on the work of Zecharia Sitchen, that the various races found on Earth are the result of the Annunaki, who created them in order to differentiate between different types of workers. John in Tampa Florida put forward the suggestion that, in order to salvage the economy, the United States should give the state of Nevada to China and, thus, settle our debt to them. Brandon in Cincinnati contended that chemtrails are made of barium and alluminum. Based on his research, Brandon said that chemtrails are used to jam radar signals and also inadvertently cause illnesses because barium adversely effects the human immune system.\n\n&quot;I think I'm a moron,&quot; lamented Greg in Mill Valley, California as he shared his tale of woe. He explained that he'd gone to the local shopping mall and, when he exited the store, he saw &quot;my car tootling across the parking lot at walking speed.&quot; Realizing that he'd forgotten to use his parking break, Greg dashed after the vehicle, dropping his groceries in the process. Ultimately the car was stopped after it collided with a parked truck. Embarrassed at his gaffe, he left a note on the truck's windshield and quickly sped away. To make matters worse, Greg revealed that he left his wallet, containing $650 dollars, on top of the car before he made his hasty exit. Despite walking five miles along the route to see if he could find it, the wallet never surfaced.\nMiddle East Unrest\n\nDuring the first hour, investigative reporter Greg Hunter talked about how the tumultuous events in the Middle East relate to the US economic crisis. He likened the upheaval in the Egypt and surrounding countries to the fall of the Berlin Wall, but contended that, now, the proverbial wall is the United States dollar's status as the world's reserve currency. Hunter explained that the mass printing of money in the US has created inflation around the world, which fueled the unrest in the Middle East. Ominously, he warned that &quot;pretty significant inflation&quot; will &quot;boomerang&quot; back towards the US in the not too distant future. Hunter also discussed the ongoing debate in Wisconsin over unions and detailed how the situation there is symptomatic of financial problems facing many other American states.\n\nNews segment guest: Jim Berkland\n\nWebsite(s):\nusawatchdog.com","torrent":{"xt":"urn:btih:d6cf5c840897d148efd571a86d468135235d04be","amp;dn":"Coast+to+Coast+AM+-+2011.02.18+-+Full+Moon+Open+Lines+%26+Middle+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cf5c840897d148efd571a86d468135235d04be","infoHashBuffer":{"type":"Buffer","data":[214,207,92,132,8,151,209,72,239,213,113,168,109,70,129,53,35,93,4,190]},"announce":[],"urlList":[]}}