{"title":"Boilsoft.Video.Converter.2.81-MKDEV.TEAM","uid":6152300,"size":11587328,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7e8ee6be48ab3106c7074bd268e9492180d9cb6&amp;dn=Boilsoft.Video.Converter.2.81-MKDEV.TEAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ilefx","files":4,"time":1296915473,"description":"Boilsoft.Video.Converter.2.81-MKDEV.TEAM\n\n\nread the serial.txt\nseed enjoy\n\n\n\nAs a versatile all-in-one video encoder\n\nBoilsoft Video Converter, a powerful video converting tool, allows you convert all popular formats video files into AVI, MPEG, VCD, SVCD, DVD, 3GP, iPod Mp4, PSP MP4, MP4, FLV format. And play them on your iPod, iPhone, iTouch, PSP, PS3, and other digital multimedia devices.\n\nBatch conversion is surely supported. Output video/audio format settings all can be configured. With a super simple control panel, anyone can use Torrent Video Converter without a tutorial. Boilsoft Video Converter's adjustable panel brings you more useful functions, including add watermark, subtitle to your converted video.\n\nA mini video cutter is attached to the preview player of the converter. You can select a certain video clip to covert. Four ways of frame size adjustment are provided-Crop, Stretch, Preserve aspect ratio and Customize. With Boilsoft Video Converter, convert your video more professionally.\n\nWith the help of Boilsoft Video Converter you'll be able to easily encode all your movies to the preferred video format.\n\nHere are some key features of &quot;Boilsoft Video Converter&quot;:\n\nÃ‚Â· Video Converter can convert almost any video files into AVI, MPEG, VCD, SVCD, DVD, 3GP, iPod Mp4, PSP MP4, MP4, FLV format.\nÃ‚Â· Video Converter can convert video to .flv/ Flash format.\nÃ‚Â· Video Converter completely supports all kinds of RMVB files as source.\nÃ‚Â· Video Converter provides a better decoding solution of WMV file.\nÃ‚Â· Video Converter can output WMV file with Windows Codec 7/8/9.\nÃ‚Â· Convert video files to iPod, iPhone, iTouch, PSP, PS3, and other digital multimedia devices.\nÃ‚Â· Output video/audio settings can be fully customized.\nÃ‚Â· Easy to use, with a super simple control panel.\nÃ‚Â· Supports batch conversion.\nÃ‚Â· With a mini video cutter attached to the preview player. You can convert a certain video clip.\nÃ‚Â· Support watermark, watermark image support any format image, even animated GIF.\nÃ‚Â· Support add subtitle, subtitle file support .srt, .idx, .sub, .ssa, etc. file.\nÃ‚Â· Support flip video image.\nÃ‚Â· Support 4 methods of Frame Size adjustment- Crop, Stretch, Preserve aspect ratio and Customize. In Customize adjustment mode,preview image is allowed, video image position and margin to border all can be configured as you like.\n\nRequirements:\n\nÃ‚Â· DirectX 8.01 and above\n\nLimitations:\n\nÃ‚Â· 30 days trial\nÃ‚Â· watermark on output\nÃ‚Â· nag screen","torrent":{"xt":"urn:btih:d7e8ee6be48ab3106c7074bd268e9492180d9cb6","amp;dn":"Boilsoft.Video.Converter.2.81-MKDEV.TEAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7e8ee6be48ab3106c7074bd268e9492180d9cb6","infoHashBuffer":{"type":"Buffer","data":[215,232,238,107,228,138,179,16,108,112,116,189,38,142,148,146,24,13,156,182]},"announce":[],"urlList":[]}}