{"title":"One Piece, All episodes and movies (will update accordingly)","uid":6150084,"size":125119941761,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d83a74a5b6dfe8bb85f36d95c1c96ed7b5a834ae&amp;dn=One+Piece%2C+All+episodes+and+movies+%28will+update+accordingly%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kevink8","files":509,"time":1296848534,"description":"This torrent is my first. Please be gentle.\n\nI have all One Piece episodes and movies and will be updating as they come out. (can I do that? Hope so. Don't want to make a new torrent every week.)\n\nNo, I am not one of the subbing group members, so please do not ask when things will come out.\n\nYes, these are japanese voice with english subs.\n\nThere are various different types of files in here (avi, mkv, etc...) so I suggest VLC player for them. It hasn't turned me wrong yet.\n\nAll Episode (1-485) files are in order labeled One Piece ###. All movies are in a folder (I have not messed with the them, just put them in a single folder).\nNote: This is a LARGE folder, 116 gigs. It Will take a while to download.\nI will seed with 100% of my bandwith for most of the day. Other people need to use the computer during the evening during weekdays, so I will seed at 200kb/s during that time (5pm-10pm EST). Weekends will be worse because I work and they don't, so for most of the day (9am to 9pm EST) I will only be seeding at 200kb/s. And yes, there are some times when I will have to turn off my PC for a bit. She works really hard, so I have to give her a rest every once in a while.\n\nproblems or issues, please let me know. Again, this is my first torrent, so any hints and tips would be appreciated.","torrent":{"xt":"urn:btih:d83a74a5b6dfe8bb85f36d95c1c96ed7b5a834ae","amp;dn":"One+Piece%2C+All+episodes+and+movies+%28will+update+accordingly%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d83a74a5b6dfe8bb85f36d95c1c96ed7b5a834ae","infoHashBuffer":{"type":"Buffer","data":[216,58,116,165,182,223,232,187,133,243,109,149,193,201,110,215,181,168,52,174]},"announce":[],"urlList":[]}}