{"title":"Kenan &amp; Kel Season 1","uid":6183036,"size":2710316030,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d863b37c1bc905186de6295020f8eea9c6210445&amp;dn=Kenan+%26+Kel+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kunal7650","files":13,"time":1298023243,"description":"The comic misadventures of teenagers Kenan and his dimwitted buddy Kel. \n\nIn the moment of many classic team duos with Laurel and Hardy and Abbott &amp;\n\nCostello, it makes a great team as Kenan Thompson and Kel Mitchell were in\n\nfame together. During the time Kenan first appeared in D2: The Mighty Ducks\n\nand Heavyweights, he then joined in the original cast of All That with the helping of Kel. The sketches they have done were original and fresh that all of a sudden, they became famous as Nickelodeon decided to have a series of their own as a\n\nspinoff and that's Kenan &amp; Kel.\n\nKenan Rockmore is a high school student and a grocery worker at Rigby's\n\nGrocery Store in Chicago with his manager Chris Potter. His family The\n\nRockmores live in a fancy apartment with his mom Sheryl, his dad Roger, and\n\nhis younger sister Kyra. He hangs out with his friend Kel Kimble and they go out and do some scheming and other kind of stuff that pokes all the fun.\n\nThis show is so hillarious you can even tell is really funny with all the slapstick you ever want, plus there is many famous lines on the show that many sitcoms\n\never do in a living like Kel saying his famous quote: &quot;Who Loves Orange Soda?&quot; and &quot;Aw! Here It Goes!&quot; and Kenan's quote: &quot;WHYYYYY?&quot;\n\nPlus, every episodes is a classic like &quot;The Taining of a Screw&quot;, &quot;Doing Things The Hemingway&quot;, &quot;Dial O for Oops&quot;, &quot;A Star Is Peeved&quot; as well as the holiday\n\nepisodes like &quot;Merry Christmas, Kenan&quot; and &quot;Turkey Day&quot;.\n\nThis is truly one of the best All That spinoff ever to created, not only that it is really the kind of show Nickelodeon really have with its days. Try to catch many episodes if you can, and you will have a bound with laughter.\n","torrent":{"xt":"urn:btih:d863b37c1bc905186de6295020f8eea9c6210445","amp;dn":"Kenan+%26+Kel+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d863b37c1bc905186de6295020f8eea9c6210445","infoHashBuffer":{"type":"Buffer","data":[216,99,179,124,27,201,5,24,109,230,41,80,32,248,238,169,198,33,4,69]},"announce":[],"urlList":[]}}