{"title":"Much Ado About Nothing (1993) Kenneth Branagh by  Prash008","uid":6181726,"size":1082357851,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9ca9e6acb46e6cdd27067939cef59458aeadb9d&amp;dn=Much+Ado+About+Nothing+%281993%29+Kenneth+Branagh+by++Prash008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Prash008","files":-1,"time":1297976887,"description":"ovies : Comedy : DVD Rip : English\n\nMUCH ADO ABOUT NOTHING \n\nGenres: Comedy, Romance \nPlot Outline Young lovers Hero and Claudio, soon to wed, conspire to get verbal sparring partners and confirmed singles Benedick and Beatrice to wed as well. \nPlot Synopsis: Young lovers Hero and Claudio are to be married in one week. To pass the time, they conspire with Don Pedro to set a &quot;lover's trap&quot; for Benedick, an arrogant confirmed bachelor, and Beatrice, his favorite sparring partner. Meanwhile, the evil Don Jon conspires to break up the wedding by accusing Hero of infidelity. In the end, though, it all turns out to be &quot;much ado about nothing.&quot; \n\nReview: \n\n&quot; &quot;Much Ado About Nothing&quot; is one of those sparkling adaptations that supposedly couldn't have been done. But Kennneth Branagh (director and star of &quot;Hamlet,&quot; and creator of the supremely underrated &quot;Midwinter's Tale&quot;) brought an all-star cast in a sparkling Tuscan setting, to bring this tale of bickering loves and sordid betrayals to life as never before. \nThe sullen Don John has just been stopped in a rebellion against his brother Don Pedro, by young hero Claudio. Now all of them (including Don John, whom his brother has forgiven) are arriving in Messina, the home of kindly Leonato. But when they get there, Claudio immediately falls in love with Leonato's beautiful daughter Hero. And despite the efforts of Don John, Don Pedro manages to get the two young lovers together and altar-bound. \n\nBut Don Pedro isn't willing to stop there. Hero's cousin Beatrice has a long-running feud with Claudio's pal Benedick -- they insult each other, they bicker, they argue about everything (&quot;It is so indeed -- he is no less than a stuffed man!&quot;). What's more, both of them swear to stay single forever. (&quot;All women shall pardon me -- I shall live a bachelor!&quot;) Pedro and the others conspire to get Benedick and Beatrice to somehow fall in love with each other. And at first it seems that everything is going well -- until Don John manages to cast doubt on Hero's honor \n\nThere's a certain timeless quality to &quot;Much Ado&quot; -- not just the dialogue, but the simple costumes and the buildings in it. That leaves the audience free to pay more attention to the dialogue and its plot. And what a plot it is! &quot;Much Ado&quot; is brimming over with funny dialogue, dastardly plots, comedic supporting characters and weird pairings. (Beatrice and Benedick are the sort of love-hate couple that a lot of movies try to have, but don't succeed with) \n\nThe dialogue is mostly (if not all) Shakespeare's own, but it's not necessary to be a Shakespeare buff to understand what they're saying. It's not dumbed down, either -- it's just spoken as normally as ordinary English. And the Tuscan landscape sparkles with life, passion, and lots of fruit and wine. You don't need to be a fan already to understand and appreciate this movie. \n\nKenneth Branagh (who also directed and adapted the play) is amazing as Benedick, lovably witty and egotistical; he gets a little silly at times (such as his bird calls or joyous romp in the fountain), but demonstrates his serious ability after Hero is disgraced. the outstanding Emma Thompson is even better as the sharp-tongued Beatrice, a fiery young woman with her own mind and definitely her own mouth. Thompson lashes out Shakespeare's witty lines as easily as if she just thought them up herself; one of her most powerful scenes is here. Denzel Washington (Don Pedro) looks like he's having a great time; Keanu Reeves (Don John) is a bit flat in places, but glowers well enough. Kate Beckinsale's first movie role (Hero) is suitably sweet and adorable. Robert Sean Leonard (Claudio) is the one weak link in the cast; he seems a bit too overwrought and hysterical to be a major hero. (No pun intended) \n\nThis movie was unavailable for a very long time and only recently was rereleased on DVD. The DVD is pretty spare; aside from the movie, there are a few DVD promos (for &quot;When Harry Met Sally&quot; and &quot;The Princess Bride&quot; -- both, I notice, comedic romances) and a brief making-of featurette. The featurette doesn't really offer much that is new, but does give some insights into the chosen settings and why the cast wished to do the movie. \n\nThose who enjoyed Branagh's &quot;Hamlet&quot; and &quot;Henry V&quot; will rejoice in &quot;Much Ado About Nothing,&quot; the quintessential romantic comedy. Funny, sweet, romantic, and incredibly well-acted, this is a keeper. &quot; \n\nFor more\nFacebook-Prash008\nYoutube-Prashamshah\nTwitter-prasham008","torrent":{"xt":"urn:btih:d9ca9e6acb46e6cdd27067939cef59458aeadb9d","amp;dn":"Much+Ado+About+Nothing+%281993%29+Kenneth+Branagh+by++Prash008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9ca9e6acb46e6cdd27067939cef59458aeadb9d","infoHashBuffer":{"type":"Buffer","data":[217,202,158,106,203,70,230,205,210,112,103,147,156,239,89,69,138,234,219,157]},"announce":[],"urlList":[]}}