{"title":"Collection of useful utilities and apps 2","uid":6302242,"size":974717540,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dab1f3690643bc70d15835eb083318a8cca79e33&amp;dn=Collection+of+useful+utilities+and+apps+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rajeevrn","files":6,"time":1302192725,"description":"Here is part 2 of a collection of useful utilites....\n\n\n{{{{{{{{{  begin info  }}}}}}}}}\n\nAnd I have put up a list here as well as in th torrent of the 65 utilities\n\nthere may be more or less in the actual torrent...that has a list of the exact utilities\n\nI havent grouped them categorywise in the text file to ensure there are enough seeds...\n\nso you have to take your pick\n\n\nDroid Explorer\nExplore your android device...rooted of course!\n\nMacro Maker\nAutomate boring and repititive tasks\n\nKboard for slackers\nKBoard is a tool for slackers. Put your feet up and still sound as if you\\'re typing away. The default WAV file can be replaced with your own\n\nInput Prank\nscrews up the keyboard presses\n\nEfficient Reminder Pro\nexactly what it says\n\nCapsa Network Analyzer Enterprise\nCapsa WiFi is an advanced and reliable wireless network analyzer (packet sniffer, packet analyzer) designed for 802.11 a/b/g/n network monitoring and troubleshooting\n\nKitty Litter the Anti Sniffer\nKitty Litter The Anti-Sniffer is a handy application that can prevent hackers from capturing logins and passwords and viewing traffic on your wireless network by spamming thousands of false-leads per second that are unidentifiable from your regular browsing habits.\n\nTweakRAM Memory Optimizer\nTweakRAM is a handy memory optimizer tool that will keep your computer running faster and efficiently. It increases your system performance by making more memory available for your applications and the operating system.\n\nSuper Network Tunnel\nSuper Network Tunnel is a person http tunnel solution,include client/server,it equal SocksCap+Bidirectional Http Tunnel +Remote Control. Normally used in building a network tunnel between the home and office computer.\n\nSeo Link Pro\nSeo Backlink Building Tool\n\nFreeproxy\nFreeProxy is professional Freeware which channels requests for internet pages via a single computer and enables many computers to share an internet connection. \n\nProxy Finder\nProxy Finder is a small and very easy to use application that allows you to find fresh proxy lists from various proxy servers. \n\nWebmin\nWebmin is a web-based interface for system administration for Unix and for Windows. Using any browser that supports tables and forms (and Java for the File Manager module), you can setup user accounts, Apache, DNS, file sharing and so on.\n\nInstalling on Windows : http://www.webmin.com/windows.html\n\nRemote Desktop Spy\nRemote Desktop Spy is a powerful computer surveillance program which can be used in the home, school or office to monitor and record every detail of PC and Internet activity.\n\nJoomla!\nA content management system based on PHP. Visit site for more details. &lt;a href=&quot;\nhttp://www.joomla.org/about-joomla.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.joomla.org/about-joomla.html&lt;/a&gt;\n\nXMedia Email Backup Pro\nXMedia Email Backup can save emails, address book, settings, mail and news accounts, message rules, blocked senders lists and signatures to a single, compact, compressed backup file that can be easily restored when necessary. \n\nPower email verifier\nThe program works on the same algorithm as ISP mail systems do. There is no need to disturb your clients and friends anymore just to verify their addresses. It connects directly to their SMTP server to check the address you. It does not come to the message sending. It disconnects as soon as mail server informs does this address exist or not. Nothing is sent to the recipient. \n\nPhoto to Cartoon\nPhoto to Cartoon converts photographs into cartoons with a few clicks. No drawing required!\n\nPegasus Mail\ngood old pmail!Who needs outlook check out its features &lt;a href=&quot;\nhttp://www.softpedia.com/get/Internet/E-mail/E-mail-Clients/Pegasus-Mail.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.softpedia.com/get/Internet/E-mail/E-mail-Clients/Pegasus-Mail.shtml&lt;/a&gt;\n\nPeaZip Compression\nGet all the peas in a pod and out of it!\n\nFolder Marker Pro\nA handy shell extension that enables you to mark folder icons to indicate a priority level (high, low, normal), level of project completeness (done, half-done, planned), work status (approved, rejected, pending), and type of information stored within (work, important, temp and private files).\n\nAkvis Colouriage\nAKVIS Coloriage - Add Color to Black and White Photos. Coloriage manipulates colors of an image: from colorizing old black and white photos from your family archive to replacing colors in your color photos. Make a present for your grandmother by adding color to her school photo, replace the colors of your car to see how it would look in scarlet, see how you will look if you dye your hair red. \n\nMagic Camera\nMagic Camera adds a powerful virtual camera to your system for video chat. You can use it as a real webcam and set pre-recorded video, photo albums, animations and desktop screens as its output.\n\nApache Web Server\nOpensource free web server..must have for network admins\n\nNotepad++\nWhats a notepad and twice as good as it?\n\nStickies\nStickies combines the best and most important features that you could want in a notes program with the added glory of being free.\n\nMobiledit 4\nwhat would I do without you and the barrage of phones around me? originally uploaded by aoloffline!\n\nWinSCP\nFTP and SFTP client exceeded 40 million downloads. I dont believe them do you?\n\nGladinet Cloud Desktop\nI have a chunk of files and a simple windows explorer and a search function that tells me very little. But I have so many computers and all of them are online and I didnt know what to do..not anymore.\n\nDesktop Changer 1.3.2\nI want a desktop changer that is less than 20 kb and lets me specify time intervals and even offers previews an runs on windows 7. Am I crazy or what?\n\nSonic DVD Audio\nI want to create a dvd audio disc..\n\nAvoCADo\nAutocad just threw up on me and i\\'m looking for something lightweight and free!! and under 10 mb and supports collaboration??\n\n3DCrafter\n3D Canvas Pro was the best lightweight 3d modeller. guess what now its free!!!\n\nAceMoney PFM\nAceMoney helps people organize and manage their personal finances quickly and easily. It supports all the features required for home or even small-business accounting needs. \n\nSweethome 3d\nA sweet interior design program and OMG its free\n\nSandboxie\nMalware beware! you aint gonna be doing anything in here..\n\nArtRage Pro\nSpoil me with all those options...\n\n3D Analyzer\nI cant play the latest games...my graphics card just gives up...no worries now I can emulate my graphics card..worth every penny\n\nTune up utilities 2009\nwell little\\'s changed except the program getting bloated. somehow still like this.Wish it was free though!\n\nRegistry Mechanic\nthanks to eagerforcc..\n\nKrento widget engine\nI have a high end pc and I dont mind good looks and sound.Maybe you dont so maybe you do?\n\nMicrosoft .NET Framework\nMandatory requirement for several programs.\n\nDirectx (June 2010)\nyou might need this to avoid messy dll errors\n\nAirytec Switch off\nShutdown your PC automatically or remotely from any computer or mobile phone\n\nSteganos Privacy Suite\nEncryption Indiana Jones would be proud of..\n\nEasus Partition Master\nResize/move, merge, split, hide/unhide, set active partition, wipe disk/partition, rebuild MBR, convert dynamic disk to basic, GPT disk partitioning, convert partition to/from primary/logical, disk surface test.\n\nDiskaid\nSimply put an ipod explorer\n\nHijackthis\nStill a good malware identifier.still free...\n\nFlash Owner Guard\nI own a website and I am scared someones gonna steal my flash files..\nFlash OwnerGuard is the ultimate Security, Copy Protection, Digital Rights Management (DRM), Licensing and Distribution Management solution for Adobe Flash SWF and FLV Video Files\n\nDaemon Tools Pro\nHow could I miss this after years of bit torrent?\n\nConvertx to dvd\nBetter off with linux and mencoder but then this isnt a bad alternative...\n\nBluetooth Soleil\nthanks to mfaraz!!!\n\nVirtual dub!!!\nOpen source video editor. Be sure to read the documentation. 32 bit\n\nNvidia Video Decoder\nthanks to kaktosjaaz!!!\n\nTeamViewer\nCollaborative editing anyone?\n\nDFX Audio Enhancer\nEnhance your PC Audio\n\nArt Plus Digital Photo\nRecover photos from even formatted memory cards...\n","torrent":{"xt":"urn:btih:dab1f3690643bc70d15835eb083318a8cca79e33","amp;dn":"Collection+of+useful+utilities+and+apps+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab1f3690643bc70d15835eb083318a8cca79e33","infoHashBuffer":{"type":"Buffer","data":[218,177,243,105,6,67,188,112,209,88,53,235,8,51,24,168,204,167,158,51]},"announce":[],"urlList":[]}}