{"title":"DEATH NOTE: the Last name [DVDRip Xvid Mp3 Jap HardSub Ita]","uid":6277818,"size":1280188416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db12acc4b8ba5039e3196644623d6335d6967439&amp;dn=DEATH+NOTE%3A+the+Last+name+%5BDVDRip+Xvid+Mp3+Jap+HardSub+Ita%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Collerom","files":-1,"time":1301324476,"description":"HARDSUB ITALIANO\n\n\nDEATH NOTE: the Last name\n\n\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/2401f6123762207&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/2401f6123762207&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/33a4fa123762224&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/33a4fa123762224&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/4d79ad123762235&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/4d79ad123762235&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/fb70d4123762243&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/fb70d4123762243&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/e81ad5123762259&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/e81ad5123762259&lt;/a&gt;\n\n\n\nDeath Note: the Last name ÃƒÂ¨ un film del 2006 diretto da Shusuke Kaneko.\nSecondo adattamento live action della serie di manga e anime DEATH NOTE, firmati Tsugumi Ohba e Takeshi Obata.\nIl titolo giapponese di questo film usa le maiuscole in modo leggermente diverso: DEATH NOTE: the Last name.\n\n\n\n\nTrama\n\n\nUno squilibrato tenta di uccidere Misa Amane in un vicolo ma improvvisamente l'uomo muore. Subito dopo dal nulla compare un quaderno nero e non appena la ragazza lo tocca vede sconcertata un dio della morte di nome Rem. Entra quindi in possesso del Death Note e inizia ad imitare il mitico Kira di cui ÃƒÂ¨ una fan. Spedisce poi un messaggio alla redazione di Sakura Tv in cui dimostra di poter uccidere a piacimento e chiede all'autentico Kira di incontrarla. Il messaggio viene trasmesso e chiunque tenta di bloccare la messa in onda viene ucciso. Infatti Amane ha &quot;gli occhi&quot;, con cui vede nome e cognome di un malcapitato semplicemente guardando il suo viso.\n\nLight Yagami, entrato a far parte del gruppo di ricerca di Kira, capisce che un simile dono puÃƒÂ² fargli comodo per uccidere il suo acerrimo nemico L, che continua a sospettare la sua colpevolezza. Prima che il ragazzo trovi Misa, questa riesce a trovare lui e fingendosi la sua ragazza i due pianificano le mosse che porteranno a sferrare un attacco a L. Ma proprio quando Misa riesce finalmente a vedere L di persona, scoprendone il vero nome, questo la fa rapire illegalmente e la tiene in una stanza segreta (dopo che alcune prove rinvenute sulle cassette pervenute a Sakura TV indicano che lei ÃƒÂ¨ il secondo Kira). Dopo diversi giorni di reclusione Misa chiede a Rem di ucciderla, ormai allo stremo delle forze, e il dio della morte ÃƒÂ¨ costretto a rivolgersi a Yagami. Questo si fa allora internare, mani e piedi legati, al fine di dimostrare che lui non puÃƒÂ² essere Kira. Sia lui che Misa abbandonano il possesso del Death Note e perdono completamente la memoria di questo.\n\nRem consegna il Death Note alla giornalista pro-Kira Kiyomi Takada che, sentendosi oltremodo onorata del regalo, decide di proseguire il lavoro di Kira partendo con l'uccisione della conduttrice di Sakura TV di cui prende immediatamente il posto. Gli omicidi quindi continuano e questo spinge L a rilasciare sia Misa che Light. Yagami si rimette a lavoro e finalmente identifica in Kiyomi Takada la responsabile delle nuove morti. Le viene quindi organizzata una trappola in cui si espone rivelando la sua identitÃƒÂ  di Kira e il metodo utilizzato per uccidere. Quando i membri del gruppo toccano il Death Note in suo possesso iniziano a vedere Rem, mentre Light Yagami riguadagna tutte le sue memorie del passato, tornando ad essere Kira. Poi con un frammento del quaderno uccide Kiyomi tornando ad essere il proprietario del quaderno. Comunica quindi a Misa di recuperare il secondo Death Note che aveva nascosto in un bosco e insieme i due ricominciano ad uccidere.\n\nMa Light elabora un piano per far convergere le ricerche del nuovo Kira verso Misa, in modo che Rem, per salvare la vita alla ragazza, uccida per lui L (di cui ancora non conosce il nome) e Watari. Mentre L muore Light ammette di essere il vero Kira, ormai fuori pericolo. Rem diventa polvere e con lui viene distrutto il suo Death Note. Light allora tenta di manipolare il padre per ottenere l'ultimo Death Note segnando la sua morte, ma l'uomo non muore affatto.\n\nSi scopre cosÃƒÂ¬ che il Death Note in possesso di Light ÃƒÂ¨ finto e che L non ÃƒÂ¨ morto affatto. Infatti aveva scritto il proprio nome sul Death Note originale (sacrificandosi) scegliendo per sÃƒÂ© il limite di giorni possibile, annullando di conseguenza l'efficacia del Death Note di Rem. Poi aveva sostituito il Death Note di Light con uno fasullo per renderlo inefficace e intanto avere la certezza della colpevolezza di Light.\n\nLight non vuole arrendersi e chiede disperatamente a Ryuk di uccidere tutti per salvarlo. Ma Ryuk invece uccide Light dicendogli che aveva contato troppo su di lui e solo in quel momento gli menziona che un umano che ha usato il quaderno non va nÃƒÂ© al paradiso nÃƒÂ© all'inferno, ma nel nulla. Ryuk poi chiede a L se vuole il suo Death Note, ma il detective rifiuta. E mentre Light muore il padre lo tiene tra le sue braccia e dice alla famiglia che ÃƒÂ¨ morto ucciso da Kira nel tentativo di fermarlo.\n\n\n\n\n\n\n\n[ Info sul file ]\n\nNome: (MDW)_Death_Note_-_The_Last_Name_DVD.avi\nData: 12/08/2007 08:52:48\nDimensione: 1,280,188,416 bytes (1220.883 MB)\n\n[ Info generiche ]\n\nDurata: 02:19:50 (8390.478828 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: MOLTO ALTA (704 x 396)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 4 (sarebbe stato meglio 16)\nQualitÃƒÂ  DRF medio: MEDIA (4.003872)\nQualitÃƒÂ  deviazione standard: MEDIA (1.127901)\nMedia pesata dev. std.: ALTA (0.782832)\n\n[ Traccia video ]\n\nFourCC: divx/DX50\nRisoluzione: 704 x 396\nDisplay aspect ratio: 16:9 = 1.777777\nFramerate: 23.975985 fps\nFrames totali: 201170\nBitrate: 1019.325876 kbps\nQf: 0.152499\nMax key int: 300\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate: 192 kbps CBR\nCanali: 2\nFrequenza: 48000 Hz\nStream size: 201,371,328 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b2292p\nPacked bitstream: SÃƒÂ¬ (*)\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 201170\nFrames corrotti: 0\n\nI-VOPs: 2316 ( 1.151 %)\nP-VOPs: 124397 ( 61.836 %) ###############\nB-VOPs: 74458 ( 37.012 %) #########\n\nMax consecutive B-VOPs: 2\n1 consec: 43322 ( 73.564 %) ##################\n2 consec: 15568 ( 26.436 %) #######\n\n[ Analisi DRF ]\n\nDRF medio: 4.003872\nDeviazione standard: 1.127901\nDRF max: 8\n\nDRF=1: 3 ( 0.001 %)\nDRF=2: 5916 ( 2.941 %) #\nDRF=3: 67595 ( 33.601 %) ########\nDRF=4: 86744 ( 43.120 %) ###########\nDRF=5: 3551 ( 1.765 %)\nDRF=6: 36392 ( 18.090 %) #####\nDRF=7: 0 ( 0.000 %)\nDRF=8: 970 ( 0.482 %)\nDRF&gt;8: 0 ( 0.000 %) ","torrent":{"xt":"urn:btih:db12acc4b8ba5039e3196644623d6335d6967439","amp;dn":"DEATH+NOTE%3A+the+Last+name+%5BDVDRip+Xvid+Mp3+Jap+HardSub+Ita%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db12acc4b8ba5039e3196644623d6335d6967439","infoHashBuffer":{"type":"Buffer","data":[219,18,172,196,184,186,80,57,227,25,102,68,98,61,99,53,214,150,116,57]},"announce":[],"urlList":[]}}