{"title":"Bruce Almighty(2003)DVDRip.AC3(ENG)-DROCK","uid":6168157,"size":734206453,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc3d5bb41e321623b11e862603380e906c23fb0f&amp;dn=Bruce+Almighty%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1297462133,"description":"After a bad day at work, a man suddenly gets a new job -- as the world's new Heavenly Father -- in this comedy. Bruce Nolan (Jim Carrey) is a television reporter working in Buffalo, NY, who has been growing increasingly dissatisfied with his existence, and after an especially bad day, he flies into a rage and curses God for making his life miserable. To Bruce's great surprise, the Supreme Being Himself (Morgan Freeman) appears, and tries to convince Bruce of the enormity of his task. Bruce, however, isn't buying it, so God gives him a chance to find out what he's up against; God bestows all of his powers on Bruce for a week, to see how he'd handle things. At first, Bruce has a great time bending the world around him to his will, much to the puzzlement of his girlfriend, Grace (Jennifer Aniston), but after six days God stops by to remind Bruce he hasn't done much to make the Earth a better place. Disappointed, God presents Bruce with an ultimatum -- he has one day to improve the world in a concrete way, or God will toss the planet back into the void. Bruce Almighty was directed by Tom Shadyac, who previously teamed with Jim Carrey for Liar, Liar and Ace Ventura: Pet Detective. \n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:dc3d5bb41e321623b11e862603380e906c23fb0f","amp;dn":"Bruce+Almighty%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc3d5bb41e321623b11e862603380e906c23fb0f","infoHashBuffer":{"type":"Buffer","data":[220,61,91,180,30,50,22,35,177,30,134,38,3,56,14,144,108,35,251,15]},"announce":[],"urlList":[]}}