{"title":"still game 1","uid":6133661,"size":4680830976,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc59f447c29dd113884f424b97cb25b920133b26&amp;dn=still+game+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gedjames","files":31,"time":1296219986,"description":"Still Game is a Scottish sitcom, produced by The Comedy Unit with the BBC. It was created by Ford Kiernan and Greg Hemphill, who play the lead characters - two Glaswegian pensioners, named Jack Jarvis and Victor McDade respectively.\n\nSeries 1 (2002)Flittin' - Jack's life is increasingly miserable due to anti-social neighbours. He is keen to move but can't find a house until the man across the landing from his best friend Victor dies.\n\nEnglish Translation- Moving\nFaimly - Victor is awaiting a visit from his son John who now lives in Johannesburg. But when John leaves a message on Victor's answering machine, a crucial part of it is blocked out by the sound of a train horn. Jack and Victor set out to discover what it says with help from their friend Shug who has an acute sense of hearing. Meanwhile Winston gets injured in a fight with Peggy at the butchers over who gets the gigot chops.\n\nEnglish Translation- Family\nCauld - The residents of Craiglang are experiencing one of the coldest winters in years when Winston offers a solution - free electricity through by-passing the meter. Gradually a number of locals accept Winston's help but Victor takes the moral high ground and refuses to participate.\n\nEnglish Translation- Cold\nCourtin' - Jack asks Barbara, the woman from the charity shop, to go out with him leaving Victor feeling lonely and resentful of his friend's new romance. Meanwhile, Winston gets barred from The Clansman and looks for new places to drink.\n\nEnglish Translation- Dating\nWaddin' - It's the wedding of the year and both Jack and Victor still haven't received an invite - they decide to do something about it. Meanwhile, it is thought that Wullie MacIntosh has died and Winston plans to rummage through his house to find something that will assure him an invite.\n\nEnglish Translation- Wedding\nScones - Jack and Victor are irritated by Tam's success at entering and winning competitions and embark on an attempt of their own, involving composing a slogan for scones. Their attempts are futile, and of course, hilarious. Meanwhile, Winston is having problems with the Social Security office who have stopped his benefits. Isa's estranged husband, Harry, also returns after a six year absence.\n\n","torrent":{"xt":"urn:btih:dc59f447c29dd113884f424b97cb25b920133b26","amp;dn":"still+game+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc59f447c29dd113884f424b97cb25b920133b26","infoHashBuffer":{"type":"Buffer","data":[220,89,244,71,194,157,209,19,136,79,66,75,151,203,37,185,32,19,59,38]},"announce":[],"urlList":[]}}