{"title":"Democracy Now - 25 feb 2011","uid":6202028,"size":449882753,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ddccf984071a9446215e047652e86f9627b2512f&amp;dn=Democracy+Now+-+25+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1298653181,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 25, 2011\n\n- U.N.: Thousands May Have Died in Libyan Crackdown\n- Protesters Plan Rally in Libyan Capital\n- U.N. Security Council, Rights Panel Holds Sessions on Libya\n- Wisconsin Assembly OKs Anti-Union Bill\n- Idaho Senate Advances Curbs on Teachers' Union\n- Thousands Join &quot;Day of Rage&quot; in Iraq\n- Pakistan Trial of CIA Operative Adjourns\n- Algeria Lifts State of Emergency\n- Foreign Student Arrested on Terror Charges\n- Indiana Senate OKs Anti-Immigrant Bill\n- Same-Sex Marriage Legalized in Hawaii, Advanced in Maryland\n\n\nSpecial reports\n\n- Thousands Feared Dead in Gaddafi's Crackdown on Libyan Uprising\n\nThe United Nations is warning thousands of people may have been killed in Colonel Muammar Gaddafi's assault on the growing popular uprising across Libya. The United Nations is also warning Libya's food supply network is on the brink of collapse. Deadly clashes are ongoing as anti-government forces close in on the capital city of Tripoli. We get a report from Democracy Now!'s Anjali Kamat in the Libyan city of Tobruk.\n\n\n- Protesters Expect 100,000 in Madison as Assembly OKs Anti-Union Bill\n\nThe Republican-controlled Wisconsin State Assembly has passed Gov. Scott Walker's budget repair bill that would eliminate collective bargaining rights for most public employees. The measure has sparked an unprecedented 11 days of protest in the capital city of Madison and across the state. Broadcasting from the Capitol Rotunda in Madison, we speak to The Nation magazine's John Nichols.\n\n\n- Despite Exemption From Anti-Union Bill, Wisconsin Firefighters Stand With Public Sector Workers\n\nThousands of workers and labor activists have descended on Madison since last week, calling on state lawmakers to reject Republican Gov. Scott Walker's anti-union bill. Although police offices and firefighters are exempted from key provisions of the bill, they have joined the protests in large numbers. We are joined by Mahlon Mitchell, president of the Wisconsin Professional Firefighters Association. &quot;There's not one public employee that does their job to get rich,&quot; Mitchell says. &quot;We do not do our jobs to get rich, but we want a decent life and a decent middle-class family and not have to struggle like many people do.&quot;\n\n\n- &quot;Until We Throw This Bill Out, We Cannot Come Back:&quot; Wisconsin State Senator Chris Larson Remains in Illinois\n\nWisconsin senate Democrats have stalled the anti-union bill by fleeing the state, thereby denying Republicans quorum for a vote. On Thursday, Wisconsin police were deployed to retrieve the absent senate Democrats at their homes without success. We speak to Democratic State Senator Chris Larson, who has fled to Illinois.\n\n\n- Policing &amp; Protesting: Wisconsin Officers Patrol Capitol, But Join in Demonstrations\n\nWisconsin police officers have participated in the Madison labor protests, not only on the job as public security, but also as demonstrators. &quot;Law enforcement officers from across the state are proud to stand by their fellow devoted public employees,&quot; says Jim Palmer, executive director of Wisconsin's Professional Police Association.\n\n\n- &quot;Walker Needs to Get Over His Koch Addiction&quot;: Labor Activists Protest Koch Brothers' Madison Office\n\nHundreds of demonstrators gathered outside the lobbying offices of the Koch brothers in Madison on Thursday. &quot;The Koch brothers] have funded a lot of anti-union, anti-worker legislation not just in Wisconsin, but across the country,&quot; says Elizabeth DiNovella of the Madison-based magazine The Progressive. &quot;People in Wisconsin are here to say that Walker needs to get over his Koch addiction and respect workers' rights to organize.&quot;\n\n\n- Teachers, Students Among First to Protest at Wisconsin Capitol\n\nTeachers and students have been on the front lines of the Wisconsin protests. We speak to University of Wisconsin Graduate student Angela Wellman.\n\n\n- Wisconsin's Uprising: A Guided Tour of the 11-Day Protest Encampment Inside Madison State Capitol\n\nPublic employees, labor activists and students have been filling the hallways of the Wisconsin State Capitol for the past 11 days. Hundreds of people have slept inside the capitol building each night. So many people are staying here that protesters have begun building impromptu dining areas, a lending library and a medic center. Democracy Now! senior producer Mike Burke receives a tour of the building from an activist who's stayed at the capitol building for nine straight nights.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:ddccf984071a9446215e047652e86f9627b2512f","amp;dn":"Democracy+Now+-+25+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddccf984071a9446215e047652e86f9627b2512f","infoHashBuffer":{"type":"Buffer","data":[221,204,249,132,7,26,148,70,33,94,4,118,82,232,111,150,39,178,81,47]},"announce":[],"urlList":[]}}