{"title":"Coast to Coast - Mar 31 2011 - Oil Spills, Solar Cycles &amp; UFOs","uid":6288605,"size":56701852,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dddb61e9924356f1bdee93e7905175a77ad5db9d&amp;dn=Coast+to+Coast+-+Mar+31+2011+-+Oil+Spills%2C+Solar+Cycles+%26+UFOs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mscowlove","files":5,"time":1301714282,"description":"Oil Spills, Solar Cycles, &amp; UFOs\n\nDate: 03-31-11 \nHost: George Noory \nGuests: Linda Moulton Howe, Stan Deyo \n\nInvestigative reporter Linda Moulton Howe shared four reports. As we approach the one year anniversary of the BP spill, her first segment looked at how Corexit dispersant and crude oil still persist in the Gulf region. And many people along the coast from New Orleans to Pensacola, Florida, are seeking medical help for coughing, nausea, dizziness and other ailments. She spoke with neurologist Dr. Rodney Soto who believes the symptoms are directly related to exposure to Corexit and the oil. More here. \n\nLinda discussed the world's first macro-sized quantum machine in her second report. The device, which received the 2010 Science Breakthrough Award, is big enough to see with the human eye, having the width of a human hair. She interviewed the inventor, Prof. Andrew Cleland, who explained the physics behind the machine. He also noted that their research is federally funded because the U. S. government, military, and banks are concerned someone could come up with a quantum computer that can rapidly crack prime numbers - the main encryption system used today, and this could threaten national security. Read more. \n\nThe Solar Cycle 24 maximum, occurring during 2012-2013, is going to be small, perhaps the smallest in 200 years, according to astrophysicist David Hathaway, whom Linda spoke with. We could still be hit by a devastating coronal mass ejection, though we now have warning systems in place to alert satellite operators about the problem, he noted. View more. \n\nIn her last segment, details of an intriguing 2008 sighting of a mysterious aerial craft in Levittown, Pennsylvania were presented. Witness Denise Murter described seeing &quot;squares of light&quot; fall from a craft onto nearby trees as though they were being sampled in a kind of experiment. &quot;It looked like it was snowing in June! And it was coming down fast and it was sparkling. It looked like millions of lightning bugs,&quot; she said. More here. \n\nQuake &amp; Earth Changes\nFirst hour guest, Stan Deyo presented an update on earth changes. Interestingly, he's found that at the same time as the great quake hit Japan on March 11th there was seismic activity recorded at Yellowstone (related graphics). He suggested that a great pool of magma underneath Yellowstone is connected to an even larger undersea pool of magma that stretches to the Fukushima quake site. He also predicted that we'll see another mega-quake somewhere in the Pacific Rim in the near future. \n\nNews segment guests: Dr. John Apsley, Maryanna Korwitts \n\nWebsite(s): \nearthfiles.com \nstandeyo.com \nBook(s): \nMysterious Lights and Crop Circles \nGlimpses of Other Realities, Volume 2 \nAn Alien Harvest \nThe Cosmic Conspiracy - Final Edition 2010 \nDare to Prepare \n","torrent":{"xt":"urn:btih:dddb61e9924356f1bdee93e7905175a77ad5db9d","amp;dn":"Coast+to+Coast+-+Mar+31+2011+-+Oil+Spills%2C+Solar+Cycles+%26+UFOs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dddb61e9924356f1bdee93e7905175a77ad5db9d","infoHashBuffer":{"type":"Buffer","data":[221,219,97,233,146,67,86,241,189,238,147,231,144,81,117,167,122,213,219,157]},"announce":[],"urlList":[]}}