{"title":"Coast to Coast AM - 2011-02-01 - Alternative Cancer Treatments","uid":6170836,"size":55288700,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:de441b17ab15103eb26364a60c89788febdc5515&amp;dn=Coast+to+Coast+AM+-+2011-02-01+-+Alternative+Cancer+Treatments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1297566574,"description":"Date: \t02-01-11\nHost: \tGeorge Noory\nGuests: \tTy Bollinger, Dannion Brinkley\n\nAuthor and health freedom advocate Ty Bollinger set out to find out all he could about cancer and discovered a world of effective treatments which are being ignored by the medical establishment. Cancer (a mutation of cells) is usually held in check by a healthy immune system but, he said, many people's systems have become toxic from environmental pollutants, vaccinations, and EMF. He cited a &quot;cancer conspiracy,&quot; and the &quot;Medical Mafia&quot; that acts to suppress or use strong arm tactics against alternative approaches to surgery, chemotherapy, and radiation. Some people, he reported, are even prosecuted and sent to prison, such as Jason Vale, who sold apricot pits &amp; apple seeds (Vitamin B-17 or Laetrile).\n\nBollinger reviewed different approaches to cancer such as the Hoxsey tonic, an herbal mixture that was developed through observing a horse cure itself of cancer by grazing on certain wild plants, and the Rife machine which targets cancer cells using particular frequencies. Hemp also has curative properties and helps increase alkalinity, he noted.\n\nOther alternative therapies &amp; supplements he touched on included:\n\n    * Hyperthermia-- a treatment in which cancer cells are super-heated.\n    * Hyperbaric oxygen chamber-- a suppressed method for treating cancer.\n    * Carnivora-- supplement made from the Venus Fly Trap that's an immune booster and cancer fighter.\n    * Food grade hydrogen peroxide.\n    * Budwig Diet.\n\nUprising in Egypt\n\nFirst hour guest, author and teacher Dannion Brinkley, who has made over 30 trips to Egypt, discussed the unrest that is happening there. We are watching a worldwide revolution begin, he commented. He noted that a number of his Egyptian friends who live in the Los Angeles area also want Mubarak out. The border of Egypt and Gaza could be of concern to Israel, he cautioned, as people who want to instigate war might see an opening.\n\nNews segment guests: Mitch Battros, John Lott, Christian Wilde\nWebsite(s):\n\n    * cancertruth.info\n    * cancertruth.net\n    * dannion.com\n\nBook(s):\n\n    * Cancer: Step Outside the Box\n    * Secrets of the Light\n","torrent":{"xt":"urn:btih:de441b17ab15103eb26364a60c89788febdc5515","amp;dn":"Coast+to+Coast+AM+-+2011-02-01+-+Alternative+Cancer+Treatments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de441b17ab15103eb26364a60c89788febdc5515","infoHashBuffer":{"type":"Buffer","data":[222,68,27,23,171,21,16,62,178,99,100,166,12,137,120,143,235,220,85,21]},"announce":[],"urlList":[]}}