{"title":"COAST TO COAST AM.2011-03-09 - Ghost Investigtations","uid":6232972,"size":55175949,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:decc0102b0ee6317cfb9406b9d9afdc9b2780696&amp;dn=COAST+TO+COAST+AM.2011-03-09+-+Ghost+Investigtations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1299771480,"description":"\nGhost Investigtations\n---------------------\nDate: 03-09-2011\nHost: George Noory\n\nGuests: David M. Rountree, Michael Sebastian, Nicole Sebastian\n\n\nParanormal investigator David M. Rountree discussed his work using scientific methods for ghost hunting, which he hopes will help bridge the gap between the paranormal and science. Measurable atmospheric and environmental conditions seem to be related to unusual phenomena, he reported, especially in small localized areas such as when cold spots are found. &quot;A lot of what we're encountering is a by-product of the conduit in which these energies use to manifest,&quot; he noted. \n\nRountree made connections between EMF (electromagnetic fields) and EVP (electronic voice phenomena), finding that unexplained voice recordings were being created by electromagnetic waves in the voice spectrum rather than from sound. Further, the EMF seems to be emerging into the environment, as though out of thin air, he added. His team also found gamma radiation bursts in localized areas where people experience ghostly phenomena. \n\n&quot;My theory has been developing now that we're actually dealing with a type of wormhole that opens up and connects...to an adjacent universe to our own...and the act of that connection dramatically alters the environment around it,&quot; accounting for the unusual readings they measure, he explained. Rountree also shared his research into orbs, which though invisible to the naked eye, have shown up in many people's digital photographs. While there is a prosaic reason for most of the orbs (dust, lens flares etc.), by using two cameras photographing the same area at the same time, he's shown that some orbs can't be easily accounted for. \n\nNight Terrors:\nFirst hour guests, &quot;The Dream Team,&quot; Michael &amp; Nicole Sebastian, talked about night terrors, which they characterized as &quot;nightmares on steroids.&quot; In many cases, night terrors could be incidents of &quot;astral invasions,&quot; in which dreamers have negative contacts in other dimensions with astral entities or &quot;psychic criminals,&quot; said Michael. Nicole listed five tools people could use to combat or prevent these encounters: \n\n1) Practice a balancing vocal technique, saying the phrase &quot;hu.&quot; \n2) Visualize yourself wrapped in reverse mirrors to reflect negative energy away. \n3) Invoke your spiritual guide before going to sleep and request to only go to higher realms. \n4) Picture yourself in a white light shield. \n5) Re-write the 'script' to the Night Terror while awake. \n\nNews segment guests: Charles R. Smith, Robert Zubrin \n\n\nWebsites:\nspinvestigations.org\ntrustyourself.tv\n\nBooks:\nParanormal Technology: Understanding the Science of Ghost Hunting\nTrust Yourself: Master Your Dreams, Master Your Destiny\nSociology of Soul\n\n\nMANY THANKS TO MY SORCE OF THIS SHOW, AND THOSE WHO CAN HELP SEED...\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:decc0102b0ee6317cfb9406b9d9afdc9b2780696","amp;dn":"COAST+TO+COAST+AM.2011-03-09+-+Ghost+Investigtations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"decc0102b0ee6317cfb9406b9d9afdc9b2780696","infoHashBuffer":{"type":"Buffer","data":[222,204,1,2,176,238,99,23,207,185,64,107,157,154,253,201,178,120,6,150]},"announce":[],"urlList":[]}}