{"title":"Pay back 1968","uid":6221364,"size":588863106,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dee52a650cbcc8581585c3bfd4fb25a2500fc13e&amp;dn=Pay+back+1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1299341215,"description":"Plot\n\nIn a seedy basement, a man pours a glass of whiskey and sterilizes his crude surgical tools. Porter lies severely wounded with two gunshot wounds in his back. After the removal of the rounds and several months of healing, Porter returns and begins tracking down Val Resnick, his former partner, and Lynn, his ex-wife, both of whom betrayed Porter and left him for dead following a $140,000 heist from the Chinese Triads, whose leader is Pearl.\n\nPorter sets out intent on reclaiming his $70,000 cut of the heist. Following his betrayal, Val rejoined the Outfit, a powerful criminal organization, using $130,000 of the heist money to repay an outstanding debt.\n\nTo get his share of the money back, Porter is forced to deal with his former employer, the Outfit, the Chinese Triads, and corrupt police officers Det. Hicks and Det. Leary. He enlists the help of a call girl, Rosie, who is affiliated with the Outfit. Prior to the events depicted at the beginning of the film, Porter served as a driver for Rosie, during which time they developed a close, romantic friendship, which ultimately was the reason behind Porter's wife conspiring against him.\n\nFollowing unsuccessful attempts to reclaim his $70,000 share of the original heist, Porter shoots one of the Outfit's top men, Carter, and kidnaps the son, Johnny, of the head of the crime syndicate. By now the mob's two top figures, Bronson and Fairfax, join the hunt to take him down.\n\nPorter is captured by thugs after a wild chain of events involving the Triads. While being tortured, he lures them to an apartment that had previously been rigged to a phone connected to dynamite. Using a slick ruse, Porter directs the Outfit members to the apartment where they meet their explosive demise, and he and Rosie (with her dog, also named Porter) drive off to begin a new life, the main character having murdered over a dozen men.\n","torrent":{"xt":"urn:btih:dee52a650cbcc8581585c3bfd4fb25a2500fc13e","amp;dn":"Pay+back+1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee52a650cbcc8581585c3bfd4fb25a2500fc13e","infoHashBuffer":{"type":"Buffer","data":[222,229,42,101,12,188,200,88,21,133,195,191,212,251,37,162,80,15,193,62]},"announce":[],"urlList":[]}}