{"title":"Trio - Da Da Da [Bananas tv show 1982].VOB","uid":6264535,"size":169584640,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e00d971e55542456ac9622756bafe7c130315369&amp;dn=Trio+-+Da+Da+Da+%5BBananas+tv+show+1982%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1300864513,"description":"Trio - Da Da Da [Bananas tv show 1982].VOB\n\n\nVery HQ Bananas tv show promo music video from an outstanding and very rare 1980's tv show from Germany, broadcasted from 1981 to 1984, this is practically unknown in America, but this show has very well known artists of the 1980's.\n\nThe rarity of this show is that, all the appearances of very well known guests are a whole new promo music video production that easly could be considered as never seen before videos or second versions of several classic 80's videos.\n\n&quot;Da Da Da I Don't Love You You Don't Love Me Aha Aha Aha&quot; (usually shortened to just &quot;Da Da Da&quot;) was an international hit record for German band Trio formed in 1980 by Stephan Remmler, Gert 'Kralle' Krawinkel and Peter Behrens. &quot;Da Da Da&quot; released in 1982 was a hit in Germany and about 30 countries worldwide and sold 13 million records. The lyrics were written by Stephan Remmler, and the music by Gert 'Kralle' Krawinkel. &quot;Da Da Da&quot; remains their biggest German hit and their only hit outside Germany, taken from their debut album Trio released in 1982. Trio had another three top ten hits in Germany until the end of 1983, then disbanded the following year.\n\nThe song &quot;Da Da Da&quot; is a song that has become popular while being extremely repetitive. It was a product of the Neue Deutsche Welle (or NDW). However, Trio preferred the name Neue Deutsche Frohlichkeit, which means &quot;New German Cheerfulness&quot;, to describe their music. At that time, popular songs were based on extremely simple structures that were ornately produced. Trio's main principle was to remove almost all the ornamentation and polish from their songs, and to use the simplest practical structures (most of their songs were three-chord songs). For this reason, many of their songs are restricted to drums, guitar, vocals, and just one or maybe two other instruments, if any at all. Bass was used very infrequently until their later songs, and live shows often saw Remmler playing some simple preprogrammed rhythms and melodies on his small Casio VL-1 keyboard while Behrens played his drums single-handedly while eating an apple.\n(video has a semi-transparent white &quot;festiva&quot; logo at the top right)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Da_Da_Da&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Da_Da_Da&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/daehaAADJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/daehaAADJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 9641kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:19\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*          &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:e00d971e55542456ac9622756bafe7c130315369","amp;dn":"Trio+-+Da+Da+Da+%5BBananas+tv+show+1982%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e00d971e55542456ac9622756bafe7c130315369","infoHashBuffer":{"type":"Buffer","data":[224,13,151,30,85,84,36,86,172,150,34,117,107,175,231,193,48,49,83,105]},"announce":[],"urlList":[]}}