{"title":"CyberPower Video Switch","uid":6203577,"size":5103914,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e02c09d5606a17e98e8ef4b48782d6c8f8e9b962&amp;dn=CyberPower+Video+Switch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IRISHMANb","files":2,"time":1298711489,"description":"CyberPower Video Switch 2.5.1\n\n\nCyberPower Video Switch is a piece of extremely powerful and full-featured video converter that can convert videos among different formats like MPEG, WMV, AVI, MP4, FLV, 3GP, MOV and many others with high speed and excellent quality. By taking advantage of this easy video format converter, you can enjoy your favorite videos and music freely on any portable player like iPhone, iPod, iPad, Apple TV, PSP, etc. It also allows you to convert video to HD format and lets you experience unparalleled High-Definition movie.\n\nFile Size - 5 MB\nFeatures\n\t\n\n      Video Conversion for Various Uses\n      CyberPower Video Switch allows you to convert video files with a great\n      deal of popular video formats to MPEG, WMV, AVI and other popular\n      formats as common standard definition videos (MP4, FLV, 3GP, ASF, MOV,\n      etc.) and high definition videos ( MTS, M2TS, HD AVI, etc.) with perfect\n      output quality. It also supports a variety of multimedia devices such\n      as iPod, iPhone, iPad, Apple TV, PSP for mobile entertainment.\n\n      Video to Audio Conversion\n      CyberPower Video Switch is an all-round video converter helps you\n      convert video to audio without hassle. Converting multifarious video\n      files to audio formats such as MP3, WMA, WAV, AAC, OGG and so on or\n      extracting audio from a video is can all be done in a matter of clicks.\n      Enjoy sweetening songs on your MP3 player is no longer a problem!\n\n      Optimized Output Settings\n      CyberPower Video Switch empowers you to choose output parameter\n      settings like resolution, frame rate, encoder bit rate of video and\n      sample rate, channel, encoder, bit rate of audio for your various\n      demands and save it as your own profile. To meet your specific need,\n      the properties of each format are allowed to choose! Or you can just\n      keep the default one.\n\n      Super High Conversion Speed\n      The support for batch conversion process makes your video conversion\n      faster and handier, while the top quality of CyberPower Video Switch\n      makes your watching and listening more colorful. With the inbuilt\n      batch conversion engine, you can increase performance in case of mass\n      conversion. The multicore CPU technology makes the conversion speed\n      much faster than ever.\n\n      Ease of Use\n      With its easy-to-use intuitive interface, you can easily find any\n      options as needed and convert the videos to the format you want in\n      just few clicks. With step-by-step wizard, requiring no technical\n      knowledge, even beginners can do the conversion without troubles.\n\n\n\nSystem Requirements\n\t\n\n      Minimum:\n          o Intel Pentium 3 500MHz or equivalent processor\n          o At least 256 MB RAM\n          o 50 MB free hard disk space\n          o Graphics mode 800x600, 16-bit color\n          o Internet Explorer 6\n          o Microsoft Windows XP / Vista / 7\n\n\n      Recommended:\n          o Intel Pentium 4 1GHz or equivalent processor\n          o 512 MB RAM\n          o Minimum 100 MB free hard disk space\n          o Graphics mode 1024x768 true color (highest 32-bit)\n          o Internet Explorer 7\n          o Microsoft Windows XP / Vista / 7","torrent":{"xt":"urn:btih:e02c09d5606a17e98e8ef4b48782d6c8f8e9b962","amp;dn":"CyberPower+Video+Switch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e02c09d5606a17e98e8ef4b48782d6c8f8e9b962","infoHashBuffer":{"type":"Buffer","data":[224,44,9,213,96,106,23,233,142,142,244,180,135,130,214,200,248,233,185,98]},"announce":[],"urlList":[]}}