{"title":"Thillalangadi (Tamil) (2010) Ayangaran DVD 1 CD Rip","uid":6205410,"size":730306273,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e083837ed41ee6b961ff29aedf430011e3e0a72a&amp;dn=Thillalangadi+%28Tamil%29+%282010%29+Ayangaran+DVD+1+CD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nrsadri","files":1,"time":1298778809,"description":"Krishna (Jayam Ravi) is a happy-go-lucky youth who excels in every field, but always does strange and dangerous things to obtain a certain &quot;kick&quot;- a thrill or excitement that he craves. One such activity is secretly double-crossing his childhood friend Dass (Sathyan) while helping him elope. At this point, he meets Nisha (Tamannaah) who is shocked at his recklessness and writes him off as crazy. Krishna, however, sets his sights on Nisha and woos her in a very unorthodox way; he begs her not to fall in love with him. After a host of comical situations involving Krishna's caring but easy-going parents (Prabhu and Suhasini), local thugs (John Vijay and Mayilsamy), and an ever-present comic relief named Jackson (Vadivelu), Nisha accepts Krishna's love. However she sets a condition; Krishna must stay in a well-paying job- he had resigned from other jobs due to lack of &quot;kick&quot;- and only then will she agree to marry him. Krishna accepts, but soon resigns again for the same reason and tries to hide it from Nisha. When she finds out, Nisha breaks up with him and leaves him for good.\nSome months later, Nisha's parents arrange for her to meet a prospective suitor in Malaysia. Though reluctant, she meets the suitor- Krishna Kumar (Shaam), a tough and honest policeman. She narrates the story of her affair with Krishna, and Krishna Kumar reveals that he is tracking a dangerous thief who has stolen large amounts of money from wealthy (mostly corrupt) politicians. At Malaysia, Nisha, her sister (Sanchita Shetty) and Jackson run into Krishna again, but learn that he has lost his memory and can't remember his past life. Nisha sees this as an opportunity to start their relationship again from scratch. However, it is revealed that Krishna isn't really suffering from amnesia; he has faked his condition by convincing an actual amnesiac, Paul (Santhanam) that he is a doctor, and tricked him into diagnosing his condition falsely. Nisha is initially upset, but realizes that it was done due to his love for her, and she has hidden her own feelings from him. They reconcile.\n\n","torrent":{"xt":"urn:btih:e083837ed41ee6b961ff29aedf430011e3e0a72a","amp;dn":"Thillalangadi+%28Tamil%29+%282010%29+Ayangaran+DVD+1+CD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e083837ed41ee6b961ff29aedf430011e3e0a72a","infoHashBuffer":{"type":"Buffer","data":[224,131,131,126,212,30,230,185,97,255,41,174,223,67,0,17,227,224,167,42]},"announce":[],"urlList":[]}}