{"title":"Coast to Coast - Mar 29 2011 - Search for Bigfoot","uid":6284770,"size":55415875,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e0e1fc7da8d9027d4af5e4fd3f283b44c8c50b69&amp;dn=Coast+to+Coast+-+Mar+29+2011+-+Search+for+Bigfoot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1301529875,"description":"Search for Bigfoot\n\nDate: 03-29-11 \nHost: George Noory \nGuests: Dr. Jeffrey Meldrum, Daniel Perez, Loren Coleman, Tom Blees \n\nThree experts in the field of cryptozoology discussed the latest findings and theories in the search for Bigfoot, in separate one-hour appearances. First up, Professor of Anatomy and Anthropology Jeffrey Meldrum reviewed various types of data that suggest that the elusive creature isn't particularly human-like. For instance, there's no evidence that Bigfoot use tools or build permanent shelters, which would put them on an intelligence level comparable to that of gorillas, he said. Latest research he's involved in, includes the study of hair samples that continue to defy any attribution to common wildlife, and the use of search &amp; recovery dogs to identify the tissue of great apes/primates. \n\nFounder of the Center for Bigfoot Studies, Daniel Perez suggested that it was simply the rarity of the species that makes it seem like the creature has an inter-dimensional aspect. He considers the best evidence to date to be the 1967 Patterson/Gimlin film, though he also praised photos taken by a backpacker at Silver Star Mountain in 2005. Perez said he went back to the site with the hiker, and it became clear that the photos couldn't be reproduced just by having a person dress in black in the distance. \n\nLast hour guest, cryptozoologist Loren Coleman spoke about his latest book, True Giants (co-written with Mark Hall), which looks at lesser-known Bigfoot cases involving larger-sized creatures. The typical height in Bigfoot sightings ranges from 6 Ã‚Â½ to 8 ft. tall, but there have been reports of a creature that is 15-20 ft. tall. This giant leaves a 4-toed footprint and is thinner than the usual Bigfoot, he detailed. \n\nNuclear Alternatives\nFirst hour guest, researcher Tom Blees talked about nuclear energy issues. He spoke in favor of the Integral Fast Reactor, a design for a nuclear reactor originally developed at Argonne National Laboratories that offered enhanced safety measures, seismic resistance, and the ability to burn nuclear waste as fuel. He also mentioned an isotope separator that would allow uranium to be used 50% more effectively. \n\nNews segment guests: Robert Zimmerman, Jose Escamilla \n\nWebsite(s): \nbigfoottimes.net \nlorencoleman.com \ncryptomundo.com \nprescriptionfortheplanet.com \nBook(s): \nSasquatch: Legend Meets Science \nBigfoot: Encounters Past to Present \nTrue Giants: Is Gigantopithecus Still Alive? \nBigfoot! The True Story of Apes in America \nPrescription for the Planet \n","torrent":{"xt":"urn:btih:e0e1fc7da8d9027d4af5e4fd3f283b44c8c50b69","amp;dn":"Coast+to+Coast+-+Mar+29+2011+-+Search+for+Bigfoot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0e1fc7da8d9027d4af5e4fd3f283b44c8c50b69","infoHashBuffer":{"type":"Buffer","data":[224,225,252,125,168,217,2,125,74,245,228,253,63,40,59,68,200,197,11,105]},"announce":[],"urlList":[]}}