{"title":"Deep Purple - House Of Blue Light (1999) WMA320","uid":6298309,"size":124370573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e215e799d0967c784c40bbbf075e905d6c097d12&amp;dn=Deep+Purple+-+House+Of+Blue+Light+%281999%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1302070818,"description":"If you're looking to absorb some more of Deep Purple's rib-crunching, dramatic hard rock, but want something that hasn't been as endlessly re-released on compilations or on classic rock radio lately, &quot;The House Of Blue Light&quot; is an ideal find.\nReleased in 1987, Deep Purple's second &quot;reunion album&quot; was overlooked upon release, but is actually one of their most precisely formulaic albums since &quot;In Rock.&quot; While it's not as daring as their 70s releases, &quot;Blue Light&quot; is a highly enjoyable blueprint for the plan of finding a hit. Each track sounds like an attempt to score a hit single, which means the band rarely crosses any musical boundaries, but that's part of the album's hard-edged charm. Despite a strict, limited approach, Deep Purple's musicianship still carries the power of a fiery chariot battalion, and they gut it out on each song with admirability. What's most important is that the group takes the seemingly cliched ideas of 'Mad Dog,' 'Bad Attitude,' or 'Black and White' and presents them as stunning, addictive hard rock tracks. If one were to hand these musical ideas to most other bands, the results would not be as satisfying. Ian Gillan's lyrics do the impossible task of sounding fresh, despite the limited formula, and Richie Blackmore and Jon Lord are typically dazzling, anchored by the rhythm section of producer Roger Glover and Ian Paice. Virtually all of the music here is catchy and exciting, most notably on the addictive 'Call of the Wild,' 'The Unwritten Law,' 'The Spanish Archer,' and 'Dead Or Alive,' a song that expresses the dangers of drug addiction, with a very frank, that's-the-way-it-is perspective, preached with force by musicians who have been there and back. 'Hard Lovin' Woman,' 'Bad Attitude,' and 'Dead Or Alive' would be featured on the in-concert &quot;Nobody's Perfect,&quot; the latter receiving a blazing treatment including a slightly bluesy intro. \nDue to the unfortunate fact that it was dismissed upon its release, &quot;The House of Blue Light&quot; is quickly becoming more and more rare to find in music stores, like its two predecessors &quot;Slaves and Masters&quot; and &quot;The Battle Rages On.&quot; This makes it all the more pertinent that these albums not be lost among Purple fans. They are worthy additions to an already-bracing cannon of work.\n\nby Bud\n\nTRACKLIST:\n\n01 - Bad Attitude.wma                                            \n02 - The Unwritten Law.wma                                       \n03 - Call Of The Wild.wma                                        \n04 - Mad Dog.wma                                                 \n05 - Black &amp; White.wma                                           \n06 - Hard Lovin' Woman.wma                                       \n07 - The Spanish Archer.wma                                      \n08 - Strangeways.wma                                             \n09 - Mitzi Dupree.wma                                            \n10 - Dead Or Alive.wma  \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:e215e799d0967c784c40bbbf075e905d6c097d12","amp;dn":"Deep+Purple+-+House+Of+Blue+Light+%281999%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e215e799d0967c784c40bbbf075e905d6c097d12","infoHashBuffer":{"type":"Buffer","data":[226,21,231,153,208,150,124,120,76,64,187,191,7,94,144,93,108,9,125,18]},"announce":[],"urlList":[]}}