{"title":"BBC.Attenborough.Explores.Our.Fragile.World.PDTV.XviD.AC3..avi","uid":6225322,"size":734558208,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e491195ee8a897b3c845d7f5290c6979daddc5f7&amp;dn=BBC.Attenborough.Explores.Our.Fragile.World.PDTV.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"drvvr","files":1,"time":1299490032,"description":"Attenborough Explores... Our Fragile World\nThe United Kingdom offers unique insights into the effects of climate change on our planet. It has a long history of nature observations - particularly the timing of seasonal events such as flowering and bird nesting. So, with the UK as his platform, Sir David Attenborough takes a look at the effect of global warming, both local and global. \n\nHis journey begins in the Cairngorms, the last wilderness of the UK. Its snow-encrusted summit is a rare arctic environment, but a third of this habitat has melted away over the last 30 years. The loss of arctic habitat in Britain is mirrored on a grand scale at the North Pole where the polar bear is its most iconic casualty. \n\nGlobal warming doesn\\'t just affect air temperatures - it impacts on our oceans too. Sir David examines the plight of British sea bird colonies and how important they are on a global scale. In the Shetlands, the warming oceans have resulted in a collapse of the main food source for some marine birds. \n\nHowever, while some animals lose out, others benefit. Insects such as the emperor dragonfly have extended their range northwards in Europe, while bird species like the great tits have changed their breeding times so that they synchronise with the earlier arrival of the insects.","torrent":{"xt":"urn:btih:e491195ee8a897b3c845d7f5290c6979daddc5f7","amp;dn":"BBC.Attenborough.Explores.Our.Fragile.World.PDTV.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e491195ee8a897b3c845d7f5290c6979daddc5f7","infoHashBuffer":{"type":"Buffer","data":[228,145,25,94,232,168,151,179,200,69,215,245,41,12,105,121,218,221,197,247]},"announce":[],"urlList":[]}}