{"title":"Cruel Intentions(1999)DVDRip.AC3(ENG)-DROCK","uid":6201855,"size":733431594,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e49e31312e5f609af72b7e9b9cb85a992975cad2&amp;dn=Cruel+Intentions%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1298645857,"description":"In an adaptation of Choderlos de Laclos' novel, Les Liaisons Dangereuses, Kathryn Merteuil (Sarah Michelle Gellar) and Sebastian Valmont (Ryan Phillippe) are step-brother and step-sister living in Manhattan. With their absent parents travelling in Europe, the wealthy pair have the family penthouse to themselves as they while away their summer break before beginning senior year at a private high school. Sebastian, bad-boy lothario, has apparently slept with all the girls in town and appears numb to it all. Kathryn, who appears to be the good girl class president, is actually far more amoral and malicious than Sebastian, but maintains appearances to the contrary. When she is dumped by her boyfriend, Court Reynolds (Charlie O'Connell), for the innocent Cecile Caldwell (Selma Blair), she schemes revenge by destroying Cecile's reputation. She challenges Sebastian to deflower Cecile and transform her into a tramp to humiliate Court. Sebastian isn't as interested as Cecile -- she's spent her whole life in a Catholic girl's school and presents no challenge. The girl who has caught his attention is Annette Hargrove (Reese Witherspoon), the new headmaster's daughter. Annette had written an article for Seventeen Magazine on her plans to stay a virgin until she finds her one true love. Kathryn makes a wager. If Sebastian fails to lure Annette into bed before the summer is over, Kathryn gets his car. If he succeeds, Sebastian gets Kathryn, whom he wants anyway. Sebastian accepts the bet, but Annette turns out to be more than either of them bargained for.\n\nRipped with Handbrake.\n\nLength: 1 Hour 37 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:e49e31312e5f609af72b7e9b9cb85a992975cad2","amp;dn":"Cruel+Intentions%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e49e31312e5f609af72b7e9b9cb85a992975cad2","infoHashBuffer":{"type":"Buffer","data":[228,158,49,49,46,95,96,154,247,43,126,155,156,184,90,153,41,117,202,210]},"announce":[],"urlList":[]}}