{"title":"Democracy Now - 30 mar 2011","uid":6282817,"size":457724793,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e6b738113898a8c025df165e156a8b7c43fcb3c1&amp;dn=Democracy+Now+-+30+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1301504567,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 30, 2011\n\n- Gaddafi Forces Advance on Ras Lanuf\n- NATO Affirms to Continue Air Raids in Libya\n- Obama: U.S. Could Arm Libyan Rebels\n- NATO Commander: Troops Could Enter Libya\n- Libyan Woman Who Alleged Gaddafi's Forces of Rape Remains Missing Following Arrest\n- Japan to Decommission 4 Stricken Reactors\n- 53 Killed in Iraq Attack; U.S. Forces Deployed\n- Assad Accepts Resignation of Syrian Government\n- Wisconsin Judge Re-Issues Order Freezing Anti-Union Law\n- Ohio House to Vote on Anti-Union Bill\n- Supreme Court Hears WalMart Sex Discrimination Case\n- U.S. to Accept Green Card Bids From Same-Sex Couples\n- Gbagbo Forces Accused of Mass Killings in Abidjan\n- BP Execs Could Face Manslaughter Charges\n\n\nSpecial reports\n\n- &quot;Prescription for Survival&quot;: A Debate on the Future of Nuclear Energy Between Anti-coal Advocate George Monbiot and Anti-nuclear Activist Dr. Helen Caldicott\n\nThe crisis in Japan has refueled the rigorous global debate about the viability of nuclear power. Japan remains in a &quot;state of maximum alert&quot; as the experts scramble to contain radiation that is leaking from the Fukushima Daiichi nuclear power station. Nuclear energy remains a controversial topic in climate change discourse, as environmental activists argue how to best reduce the amount of greenhouse gases being emitted into the atmosphere-often the debate pits one non-renewable energy against another as renewable energy technology and research remains underfunded. Democracy Now! hosts a debate today about the future of nuclear energy between British journalist George Monbiot and Dr. Helen Caldicott. Monboit has written extensively about the environmental and health dangers caused by burning coal for energy, and despite the Fukushima catastrophe, stands behind nuclear power. Caldicott is a world-renowned anti-nuclear advocate who has spent decades warning of the medical hazards posed by nuclear technologies, and while agrees about the dangers of burning coal, insists the best option is to ban nuclear power.\n\n\n- Haitians Deported From the U.S. Held in &quot;Absolutely Horrific&quot; Conditions\n\nThe United States resumed the deportation Haitians back to Haiti in January despite the country remains ravaged by an earthquake and cholera epidemic. In February, every one of 27 Haitians deported and sent directly to a Haitian detention center died of cholera-like symptoms. iting inhumane conditions, the Center for Constitutional Rights has called for the Obama administration to extend the Temporary Protected Status for Haitian immigrants in the United States. Democracy Now!'s Amy Goodman recently spoke with CCR's Laura Raymond in Port-au-Prince. &quot;The walls of the detention center here were covered in feces and vomit and the bathrooms weren't working, so men had to go to the bathroom in trash bags. These conditions during a cholera epidemic were literally deadly,&quot; Raymond says.\n\n\n- Haitians Face Imminent Eviction Displaced Persons Camps\n\nReconstructions efforts in Haiti have barely begun 15 months after a devastating earthquake killed thousands and left more than 1.5 million people homeless. Hundreds of thousands of people still live in makeshift shelters in hundreds of tent camps across Haiti. Democracy Now's Sharif Abdel Kouddous reports from one of those camps and speaks with residents who face imminent eviction by land owners even though they have no where else to go.\n\n\n- Sharif Abdel Kouddous Transitions from Democracy Now! Senior Producer to Middle East Correspondent\n\nDemocracy Now! bids a fond farewell to Sharif Abdel Kouddous, our senior news producer for the past eight years. Kouddous joined Democracy Now! in 2003 just as the United States invaded Iraq. He was soon covering Iraq then returned to produce the daily show, traveling to New Orleans in the aftermath of Hurricane Katrina, to the climate change conferences in Copenhagen, Bolivia and Cancun, and together with Amy Goodman to Haiti to cover the return of former Haitian President Jean-Bertrand Aristide just weeks ago. During the popular uprising in Egypt, Kouddous became the eyes and ears of Cairos' Tahrir Square as he reported throughout the uprising. Kouddous is heading home to Egypt and will continue his work reporting as a Democracy Now! correspondent.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:e6b738113898a8c025df165e156a8b7c43fcb3c1","amp;dn":"Democracy+Now+-+30+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6b738113898a8c025df165e156a8b7c43fcb3c1","infoHashBuffer":{"type":"Buffer","data":[230,183,56,17,56,152,168,192,37,223,22,94,21,106,139,124,67,252,179,193]},"announce":[],"urlList":[]}}