{"title":"Gary Cooper American Life, American Legend  (VHS) [1991]","uid":6135581,"size":467070873,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e734c8dd10e0635024833c10311aa7655e1f5dc3&amp;dn=Gary+Cooper+American+Life%2C+American+Legend++%28VHS%29+%5B1991%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1296292864,"description":" &lt;a href=&quot;http://bayimg.com/lAdKcaaDi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lAdKcaaDi&lt;/a&gt;\n\nGary Cooper: American Life, American Legend (1991) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0121314/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0121314/&lt;/a&gt;\n\nGary Cooper: American Life, American Legend (1991) -- the title says it all. Gary Cooper was one of Hollywood's best loved and perhaps most iconic American stars. His fans loved him because he was one of them, a regular Joe. Cooper represented an idealized version of ourselves and, in a simpler time, our country. As host Clint Eastwood says in the documentary Gary Cooper: American Life, American Legend, &quot;[we] saw in his face the face of all America.&quot;\n\nGary Cooper was born Frank James Cooper in Helena, Montana on May 7, 1901. Raised on a ranch and a rugged outdoorsman, Coop, like many of his characters, was Western born and bred. But, like his screen image, Cooper also had a polished ease. This he gained from his parents. Cooper's father was a lawyer and would become a state supreme court justice. His parents were also English immigrants and sent the young Cooper (at age 10) to public school in England for three years. He furthered his education at an Iowa college where he studied to become a commercial artist, before leaving to attend art school. But it was during a visit to his parents, who had relocated to Los Angeles, that Gary Cooper got his big break.\n\nAt first, it might not have seemed like a career move. Cooper found work simply doing what he knew and loved - riding horses as an extra in Westerns. But Hollywood soon took notice of the handsome guy in the background. Within two years, he had a studio contract and appeared in the first motion picture to win Best Picture. The movie was Wings (1927) with Clara Bow, and Cooper played the brief, but unforgettable, part of a doomed flyer. It would be his breakthrough film. From Wings Cooper quickly made the jump to leading man and star. And by 1939, Gary Cooper would be the highest paid man in the country according to the US Treasury.\n\nThe 1930's were indeed good to Cooper. He kicked off the decade opposite Marlene Dietrich in Morocco (1930). 1932's A Farewell to Arms, based on a novel by Cooper's friend and Sun Valley neighbor Ernest Hemmingway, would follow. And in 1936, Cooper would step into the role that came to define him - as everyman Longfellow Deeds in Frank Capra's Mr. Deeds Goes To Town. In Mr. Deeds Goes to Town, Cooper plays a small town man who inherits a fortune, and in spite of the money, is able to maintain a sense of integrity. It was a story that moviegoers were primed for in the depression era '30s and a performance that would seal Cooper's screen fate as an all-American good guy. Not only was the film nominated for Best Picture, but Gary Cooper also received his first Best Actor nomination. The 1940's were equally kind to Cooper, awarding him his first OscarÃ‚Â® for Sergeant York (1941), followed by two more Best Actor nominations as baseball great Lou Gehrig in Pride of the Yankees (1942) and for another Hemmingway adaptation For Whom the Bell Tolls (1943).\n\nPerhaps the culmination of Cooper's career, and possibly his most perfectly realized role, came in High Noon (1952). In the film, Cooper plays a retiring lawman who dutifully protects a town from an outlaw - even though no one will stand and fight with him. He won his second OscarÃ‚Â® for the stoic performance. Ever the strong silent type, Cooper let the action speak for itself.\n\n","torrent":{"xt":"urn:btih:e734c8dd10e0635024833c10311aa7655e1f5dc3","amp;dn":"Gary+Cooper+American+Life%2C+American+Legend++%28VHS%29+%5B1991%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e734c8dd10e0635024833c10311aa7655e1f5dc3","infoHashBuffer":{"type":"Buffer","data":[231,52,200,221,16,224,99,80,36,131,60,16,49,26,167,101,94,31,93,195]},"announce":[],"urlList":[]}}