{"title":"FlashFXP 4.0.0 Build 1533 (+Portable) [ak]","uid":6157704,"size":11512618,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e78c31b5573cb471d53f7b851eb12efa3f95fc5f&amp;dn=FlashFXP+4.0.0+Build+1533+%28%2BPortable%29+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1297097631,"description":"FlashFXP 4.0.0 Build 1533 (+Portable)\n\nFlashFXP is a FTP (File Transfer Protocol) client for Windows, which offers the easiest and fastest way to transfer any file between your local computer and a server on the Internet, or even directly between two servers using Site to Site transfers. Available in over 20 languages. FlashFXP offer security, performance, and reliability that you can always count on to get your job done quickly and efficiently. Use FlashFXP to publish and maintain your website, Upload and download documents, photos, videos, music and more, Share your files with your friends and co-workers, or even use it to download other shareware! There are many, many features available in FlashFXP.\n\nFlashFXP Features :\nPerformance\n- Fully tested and supports gigabit speeds (including Jumbo Frames)\n- MODE Z support for on-the-fly streaming compression.\n- Support for FEAT and &quot;stat -l&quot; fast directory listing reduces overhead and improves compatibilty.\n- Download and upload speed limiting. Save some of your bandwidth for browsing the web.\n- Advanced Skip list.\n- Optional caching of remote directory lists.\n\nSecurity\n- Includes OpenSSL Libraries 0.9.8b.\n- Automatic support for One Time Password (OTP) S/KEY.\n- Strong encryption (Blowfish) can be applied to the site manager to protect your information.\n- Connect to sites using SSL/TLS encryption for added security, including the use of client certs.\n- SSL Site-to-Site (SSCN) Transfers.\n- Clear Command Channel (CCC).\n\nConnectivity\n- Site to Site (FXP) Transfers.\n- Fully recursive file transferring (uploading, downloading, site to site).\n- Caching allows for offline browsing, queueing.\n- Firewall support, allowing you to define a set range of local ports, or bind to a specific IP.\n- FTP Proxy, HTTP Proxy, Socks 4, 5 support. (WinGate, WinProxy, MS Proxy, etc).\n- Internal ident server.\n- Per Site Connectivity modes support.\n- PRET support for distributed FTP servers.\n\nInterface\n- Full Multi-language support.\n- Simple (FTP-Only) and Advanced (FXP) views.\n- Advanced queue control.\n- Transfer Graph (only ftp transfer speeds can be graphed).\n- Multi-Proxy Server Manager.\n- Synchronized browsing allows webmasters to keep local and remote directly listings in synch while browsing.\n- Internal Schedule (Transfer or Stop a queue at a specific time).\n- Enhanced drag-and-drop functionality.\n- Import site listings from Cute FTP, WS_FTP, FTP Explorer, LeapFTP, and Bullet Proof. Including passwords!.\n- Optional displaying of Owner/Groups/Attrib.\n- Site Stats, keeps track of your uploads/downloads and overall totals.\n- Minimizes to system tray.\n- List hidden files.\n- Folder Bookmarks to provide one click access to any folder.\n- Quick backup/restore of all sites/settings.\n- Internal text editor for quick edits.\n\nAdvanced Options\n- Extensive command line options for scripting/scheduling.\n- Remote FTP file search.\n- Custom file highlighting; display file masks in user defined colors.\n- Calculate the size of all files in a specified path.\n- Grouped SITE custom commands.\n- Priority transfer list.\n- Time Zone setting for Site Manager.\n- Selective Transfer feature (transfer only images or just php files).\n\nNew Features:\n- SFTP Support.\n- Added the ability to replace a client certificate, replacing the certificate assigns the new certificate to all the sites the previous certificate was assigned to.\n- Added the ability to en-queue delete operations and raw commands. (Remote file list &gt; Right click &gt; EnQueue)\n- Added History sub-menu to the connection dropdown menu list.\n- Added an Option (Preferences &gt; General &gt; Options) &quot;Include Quick Connect sites in History&quot;\n- Local folder sizes are pre-calculated prior to upload to help calculate a more accurate queue remaining time.\n- Support for toolbar themes and custom button images.\n- Added ability to add comments to a bug report directly from within FlashFXP.\n- Added the ablity to reorder and select SFTP encryption ciphers/MACs. (global and per site)\n- Updated OpenSSL to 0.9.8h.\n- New extended toolbar tray tooltip that displays detailed transfer information.\n- New option to blend transfer progressbar with windows theme. (Preferences &gt; Display &gt; Colors &amp; Fonts &gt; Blend with windows theme).\n- New Global default and Session on transfer complete option &quot;Retry failed transfers&quot;.\n- Set Per session via main menu &gt; Session &gt; Retry failed transfers.\n- Set global default via Preferences &gt; Transfer &gt; Retry failed transfers\n- New option &quot;Move failed transfers to the bottom of queue before retrying&quot; (Set in Preferences &gt; Transfer &gt; Options.)\n- Added support for environment variables (i.e. %appdata%, %temp%) in most local browser inputs such as the address bar.\n- Added en queue raw command support to the FlashFXP command line. i.e. FlashFXP.exe -raw=&quot;site fubar&quot; (Since the raw command is queued you can use -cX flags such as -c2 to close FlashFXP after performing the command.)\n\n\nHome Page - http://www.flashfxp.com/\n\n","torrent":{"xt":"urn:btih:e78c31b5573cb471d53f7b851eb12efa3f95fc5f","amp;dn":"FlashFXP+4.0.0+Build+1533+%28%2BPortable%29+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e78c31b5573cb471d53f7b851eb12efa3f95fc5f","infoHashBuffer":{"type":"Buffer","data":[231,140,49,181,87,60,180,113,213,63,123,133,30,177,46,250,63,149,252,95]},"announce":[],"urlList":[]}}