{"title":"Samantha Fox: All Around the World (2002, music documentary) + 2","uid":6147618,"size":887517779,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8480cfe91ee118cbdcde23df67aea2dda96cd0b&amp;dn=Samantha+Fox%3A+All+Around+the+World+%282002%2C+music+documentary%29+%2B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Albeda74","files":4,"time":1296752301,"description":"Screenshots: http://img707.imageshack.us/img707/2104/samfoxdoc.jpg\n\nHere's something you may not have been expecting: a short music documentary on Samatha Fox, the sexy 80s Page 3 girl and pop singer who came out of the closet a while back.  I found out this existed while perusing British DVD sites, where it's OOP and fairly expensive, but found it for a decent price on NTSC through American retailers.\n\nDespite starting out as a young, cute and busty teenaged Page 3 girl for The Sun, Samantha seemed to take her role as adult pop chanteuse seriously, releasing several popular albums in the 1980s and 1990s, doing daunting multi-national tours, and continuing with her career even as her brand of hi-NRG pop fell out of favor in the marketplace.  Her duration in the field lends her some legitimacy, and she's risen above her sexy-pop-idol roots to become something of a LGBT icon, and some of her songs are still dance club classics.\n\nThis DVD is a fluffy ~1 hour &quot;behind the scenes&quot; look at Samantha's music career circa 2002, released by independent French record label XIII Bis.  From the DVD copy (mildly edited to make it somewhat grammatical): &quot;More than a sex symbol or a simple pop star, Samantha Fox is a genuine legend in the music world.  The queen of the 80s is back after numerous tours all over the world (USA, Europe, Russia, Japan, India...). Sam Fox speaks openly about these glorious years in the film &quot;All Around the World.&quot;\n\nThe original source is grainy and soft-focus, and comparisons of this rip to the original show little difference... therefore, poor video is the fault of the original, not the rip and compression.  From an interlaced NTSC video source; if your player allows you to deinterlace, activate it-- it improves the presentation.  The original was non-anamorphic letterboxed and oddly used some source video that was anamorphic, giving some clips the &quot;skinny&quot; effect.  Again, these are present in the original and are not the fault of the rip.\n\nAlso included are .avis of the two music videos from Samantha included on the DVD: &quot;Santa Maria&quot; and &quot;Let Me Be Free.&quot;","torrent":{"xt":"urn:btih:e8480cfe91ee118cbdcde23df67aea2dda96cd0b","amp;dn":"Samantha+Fox%3A+All+Around+the+World+%282002%2C+music+documentary%29+%2B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8480cfe91ee118cbdcde23df67aea2dda96cd0b","infoHashBuffer":{"type":"Buffer","data":[232,72,12,254,145,238,17,140,189,205,226,61,246,122,234,45,218,150,205,11]},"announce":[],"urlList":[]}}