{"title":"THE.DEVIL.WEARS.PRADA.2006.PAL.DVDR.[EN SUBS[NORDIC+IS.EN.HU -Li","uid":6272795,"size":4683876463,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e8bfc4239fb94ddfdaab30899cb6e1d735b26175&amp;dn=THE.DEVIL.WEARS.PRADA.2006.PAL.DVDR.%5BEN+SUBS%5BNORDIC%2BIS.EN.HU+-Li&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Froobozz","files":6,"time":1301145283,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0458352&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0458352&lt;/a&gt; Raiting = 6,8/10\n\nDescription\nA scathing comedy satire of fashionistas and cut-throat corporate excess boasting a grandstanding central turn by Meryl Streep as the ultimate boss from Hell, The Devil Wears Prada is based on the novel by Lauren Weisberger who once worked as an assistant to real-life Vogue editor Anna Wintour.\n\nIn the dizzying world of New York fashion, where size zero is the new 2, six is the new 8, and a bad hair day can end a career, Runaway magazine is the Holy Grail. Overseen with a finely manicured fist by Miranda Priestly (Meryl Streep) - the most powerful woman in fashion - Runway is a fearsome gauntlet for anyone who wants to make it in the industry. To make Runway the fashion bible of New York and therefore the world, Miranda has let nothing stand in her way - including a long line of assistants that didn't make the cut. It's a job no self-respecting person can survive, yet it's an opportunity a million young women in New York would kill for. \n\nA stint as Miranda's assistant could blast-open the doors for recent college graduate Andy Sachs (Anne Hathaway). More college drab than haute couture, she stands alone among the small army of 'Clackers' on staff at Runway - superslim fashion divas clacking their stilettos down the halls of the magazine's Manhattan headquarters. But when Andy comes in for the job, it dawns on her that making it in this industry will take more than drive and determination. And her ultimate test stands before her in head-to-toe Prada. Miranda can spin the fashion world like a basketball but has a devil of a time finding and keeping a good assistant. Andy is completely wrong for the job. But she has something the rest of them don't: she refuses to fail.\n\nTo become the perfect assistant, Andy will need to make herself over in Miranda's image. Soon, much to her boyfriend's dismay, she can talk the talk, walk the walk and never again confuse Dolce with Gabbana. But the more of life she sees through Miranda's eyes, the more she begins to grasp that Miranda's world is a fabulous but lonely one - and that sometimes great success depends on great sacrifice. But at what cost?\n\nSpecial Features\nAudio commentary with director David Frankel, producer Wendy Finerman, costume designer Patricia Field, screenwriter Aline Brosh-McKenna, editor Mark Livolsi and director of photography Florian Ballhaus \nDeleted scenes \n'The Trip To The Big Screen' featurette \n'Fashion Visionary: Patricia Field' featurette \n'Getting Valentino' featurette \n'Boss From Hell' featurette \n'NYC &amp; Fashion' featurette \n'International Fashion Editor' featurette \nGag reel \nTheatrical trailer\n\nTechnical Details\nActors Meryl Streep, Anne Hathaway, Emily Blunt, Stanley Tucci, Adrian Grenier, Tracie Thoms, Rich Sommer, Simon Baker, Daniel Sunjata, Jimena Hoyos, Rebecca Mader, Tibor Feldman, Stephanie Szostak &amp; David Marshall Grant\nDirector David Frankel\nCertificate 12 years and over\nYear 2006\nScreen Widescreen 2.35:1 Anamorphic\nLanguages English - Dolby Digital (5.1) \nSubtitles Nordic + Icelandic Hungarian English \nDuration 1 hour and 49 minutes (approx)\nRegion Region 2\n\nDevil Wears Prada, The [2006 PAL DVDR][En Subs[Nordic+Is.En.Hu]\n\nDjÃƒÂ¤vulen bÃƒÂ¤r Prada ÃƒÂ¤r filmatiseringen av Lauren Weisbergers storsÃƒÂ¤ljare med samma namn och huvudrollen spelas av Meryl Streep. \n\nAndrea Sachs (Anne Hathaway) ÃƒÂ¤r en smÃƒÂ¥stadstjej som kommer till New York med en drÃƒÂ¶m om att jobba i tidningsbranschen. Hon tror hon ÃƒÂ¤ntligen ÃƒÂ¤r pÃƒÂ¥ rÃƒÂ¤tt vÃƒÂ¤g nÃƒÂ¤r hon lyckas fÃƒÂ¥ det eftertraktade jobbet som assistent till Miranda Priestly (Meryl Streep), chefredaktÃƒÂ¶r pÃƒÂ¥ en av vÃƒÂ¤rldens ledande modetidningar. Men Miranda visar sig vara chefen frÃƒÂ¥n helvetet och Andrea mÃƒÂ¥ste snart bestÃƒÂ¤mma sig om hon ÃƒÂ¤r villig att sÃƒÂ¤lja sin sjÃƒÂ¤l till djÃƒÂ¤vulen fÃƒÂ¶r att nÃƒÂ¥ sina drÃƒÂ¶mmar...\n\nSpeltid 110 min\nFÃƒÂ¤rg/svartvit FÃƒÂ¤rg\nTV-system PAL\n\nTextning Danska Engelska Finska IslÃƒÂ¤ndska Norska Svenska Ungerska \nLjud Engelska (Dolby Digital 5.1)\n \nBild Widescreen 2.35:1 (anamorfisk)\nExtra material\nÃ‚Â» KommentatorspÃƒÂ¥r\nÃ‚Â» Featurette: The trip to the big screen\nÃ‚Â» Featurette: NYC and fashion\nÃ‚Â» Featurette: Fasion visionary Patricia Field\nÃ‚Â» Featurette: Getting Valentino\nÃ‚Â» Featurette: Boss from Hell\nÃ‚Â» Featurette: Danda Santini: Real life editor in chief\nÃ‚Â» Borttagna scener\nLokal titel DjÃƒÂ¤vulen bÃƒÂ¤r Prada\nOrginal titel The Devil Wears Prada\nGenre Drama\nProduktionsland USA\nPremiÃƒÂ¤rÃƒÂ¥r 2006\nRegi David Frankel\nManus Aline Brosh McKenna Lauren Weisberger \nSkÃƒÂ¥despelare Meryl Streep Anne Hathaway Emily Blunt Stanley Tucci Adrian Grenier Tracie Thoms Rich Sommer Simon Baker Daniel Sunjata \nBiorelease 2006-10-20\n","torrent":{"xt":"urn:btih:e8bfc4239fb94ddfdaab30899cb6e1d735b26175","amp;dn":"THE.DEVIL.WEARS.PRADA.2006.PAL.DVDR.%5BEN+SUBS%5BNORDIC%2BIS.EN.HU+-Li","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8bfc4239fb94ddfdaab30899cb6e1d735b26175","infoHashBuffer":{"type":"Buffer","data":[232,191,196,35,159,185,77,223,218,171,48,137,156,182,225,215,53,178,97,117]},"announce":[],"urlList":[]}}