{"title":"WCW World War 3 1997 [VHSrip ENG] TNT Village","uid":6273392,"size":1716875916,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e90596e55065639348905a19a88af7cb988d0c9c&amp;dn=WCW+World+War+3+1997+%5BVHSrip+ENG%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"l.diliberto","files":3,"time":1301162505,"description":"WCW World War 3 1997 [VHSrip ENG] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=55439&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=55439&lt;/a&gt;\n\nWorld War 3 1997 took place on November 23, 1997 from The Palace of Auburn Hills in Auburn Hills, Michigan.\n\nNumbers in parentheses indicate the length of the match.\n\n    * The Faces of Fear (Meng and The Barbarian) defeated Glacier and Ernest Miller (9:09)\n          o Meng pinned Miller with the Tongan Death Grip.\n    * Perry Saturn defeated Disco Inferno to retain the WCW World Television Championship (8:19)\n          o Saturn forced Inferno to submit with the Rings of Saturn.\n    * Yuji Nagata (with Sonny Onoo) defeated ÃƒÅ¡ltimo DragÃƒÂ³n (12:45)\n          o Nagata pinned Dragon.\n          o If Dragon had won, he would have got 5 minutes alone with Onoo.\n    * The Steiner Brothers (Rick and Scott) defeated The Blue Bloods (Lord Steven Regal and Squire David Taylor) to retain the WCW World Tag Team Championship (9:45)\n          o Rick pinned Regal after a Steiner Bulldog.\n    * Raven (w/The Flock) defeated Scotty Riggs in a &quot;Raven's Rules&quot; No Disqualification match when Riggs could not answer a ten count (9:43)\n          o Raven gave Riggs three Evenflow DDTs, then ordered the referee to count the unconscious Riggs out.\n          o After the match Riggs was carried out of the ring by members of The Flock, marking his entry into the group[1].\n    * Steve McMichael defeated Alex Wright (3:36)\n          o McMichael pinned Wright after a Mongo Spike.\n          o The match was originally supposed to pit McMichael against Bill Goldberg for possession of McMichael's Super Bowl ring that Goldberg had taken after Halloween Havoc, but McMichael attacked Goldberg with a lead pipe before the match and took possession of the ring.\n          o McMichael then made a challenge to anyone else to face him, and Debra McMichael dragged Alex Wright to the ring to answer it.[2]\n    * Eddy Guerrero defeated Rey Misterio, Jr. to retain the WCW Cruiserweight Championship (12:42)\n          o Guerrero pinned Misterio after a Frog Splash.\n    * Curt Hennig defeated Ric Flair to retain the WCW United States Heavyweight Championship (17:57)\n          o Hennig pinned Flair after hitting him with the US title belt.\n    * Scott Hall won the Three Ring, 60 man battle royal to earn a WCW World Heavyweight Championship match (29:48)\n          o The match began with fifty-nine wrestlers.\n          o The other fifty-eight wrestlers that started the match were: Chris Adams, Brad Armstrong, Marcus Bagwell, The Barbarian, Chris Benoit, Bobby Blaze, Booker T, Ciclope, Damien, El Dandy, Barry Darsow, Disco Inferno, Jim Duggan, Fit Finlay, HÃƒÂ©ctor Garza, The Giant, Glacier, Johnny Grunge, Juventud Guerrera, Chavo Guerrero, Jr., Eddy Guerrero, Curt Hennig, Prince Iaukea, Chris Jericho, Lizmark, Jr., Lex Luger, Dean Malenko, Steve McMichael, Meng, Ernest Miller, Rey Misterio, Jr., Hugh Morrus, Mortis, Yuji Nagata, John Nord, Diamond Dallas Page, La Parka, Stevie Ray, Lord Steve Regal, The Renegade, Rocco Rock, Randy Savage, Silver King, Norman Smiley, Louie Spicolli, Rick Steiner, Scott Steiner, Super Calo, Squire David Taylor, Ray Traylor, ÃƒÅ¡ltimo DragÃƒÂ³n, Greg Valentine, VillaÃƒÂ±o IV, VillaÃƒÂ±o V, Vincent, Kendall Windham, Wrath and Alex Wright\n          o After every wrestler except Hall, Page, and The Giant had been eliminated, WCW World Heavyweight Champion Hollywood Hogan revealed himself to be the sixtieth entry in the battle royal; he did this to win the match for himself so no one would get the title shot.\n          o Hall won the match after Kevin Nash, in a Sting disguise, attacked Giant with a baseball bat and eliminated him.\n          o As the prematch stipulation dictated, Hall was to receive his championship match at SuperBrawl VIII; due to a chain of events that followed World War 3 Hall did not receive this shot until Uncensored in March 1998.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img28.imageshack.us/img28/9367/www97i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img28.imageshack.us/img28/9367/www97i.jpg&lt;/a&gt;\n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione: 1,59 Gb\nDurata: 165 minuti circa\n\nVideo Codec:MPEG1\nVideo Bitrate:1150Kbps\nRisoluzione: 350x240\nFPS (Frames/sec): 29.97fps\n\nAudio Codec:MPEG Audio\nAudio Bitrate: 44100Hz stereo\nFreq Audio:224Kbps ","torrent":{"xt":"urn:btih:e90596e55065639348905a19a88af7cb988d0c9c","amp;dn":"WCW+World+War+3+1997+%5BVHSrip+ENG%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e90596e55065639348905a19a88af7cb988d0c9c","infoHashBuffer":{"type":"Buffer","data":[233,5,150,229,80,101,99,147,72,144,90,25,168,138,247,203,152,141,12,156]},"announce":[],"urlList":[]}}