{"title":"Paul McCartney &amp; Wings - Band on the Run [promo].VOB","uid":6183049,"size":247646212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e971b41767f4bb5ec1426082466185d1888892b5&amp;dn=Paul+McCartney+%26+Wings+-+Band+on+the+Run+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1298023978,"description":"Paul McCartney &amp; Wings - Band on the Run [promo].VOB\n\n\nVery HQ very rare promo music video. &quot;Band on the Run&quot; is the title song from Paul McCartney &amp; Wings' acclaimed Band on the Run album.\n\nIt is composed of a three-part structure that revolves around the themes of escape and liberation. The song tells a story about a band being confined to prison and then escaping and going on the run.\n \nThe first part (0:00-1:18) is soft and melodic. The singer complains about being stuck in one room forever alone, unable to see any nice people.\n \nThe second part (1:19-2:05) is more of a soft rock melody with the guitar, drums, and bass becoming more prominent. The singer thinks about giving everything away if he does escape. George Harrison unwittingly contributed the first line of this part: &quot;If we ever get out of here&quot; when he said it during one of the many Beatles' business meetings.\n \nThe third and main part (2:05 to 5:09) is the initial rock part, which talks about the band escaping and going on the run. The people in the town are trying to find them forevermore, but they will never be found.\n \nThe version played on the radio in America in 1974 was a shorter version of the song, edited down from the original 5:09 to 3:50 in length. The difference was largely caused by the removal of the middle or the second part of the song, as well as the verse that starts with &quot;Well, the undertaker drew a heavy sigh...&quot;\n\nThe single was certified Gold by the Recording Industry Association of America for sales of over one million copies. The song features prominently on every McCartney/Wings best-of compilation and in McCartney's live shows. It was the second of five number-one singles for the band on the Billboard Hot 100. The song is featured on Guitar Hero World Tour on the main setlist.\n\nWings (also known as Paul McCartney &amp; Wings) were a rock group formed in 1971 by ex-Beatle Paul McCartney that remained active until 1981.\n \nWings had 12 top-10 singles (including one #1) in the United Kingdom and 14 top-10 singles (including six #1's) in the United States. All 23 singles credited to Wings reached the US Top 40, and one double-sided single, &quot;Junior's Farm&quot;/&quot;Sally G&quot;, reached the Top 40 with each side. Of the nine albums credited to Wings during the group's life, all went top 10 in either the UK or the US, with five consecutive albums topping the US charts.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Band_on_the_Run_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Band_on_the_Run_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/BaDNdAaDo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/BaDNdAaDo&lt;/a&gt;  \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 6912kbps\n   Audio: MPEG Audio Layer 2 48000Hz stereo 224kbps\n   Duration: 00:03:50\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:e971b41767f4bb5ec1426082466185d1888892b5","amp;dn":"Paul+McCartney+%26+Wings+-+Band+on+the+Run+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e971b41767f4bb5ec1426082466185d1888892b5","infoHashBuffer":{"type":"Buffer","data":[233,113,180,23,103,244,187,94,193,66,96,130,70,97,133,209,136,136,146,181]},"announce":[],"urlList":[]}}