{"title":"Democracy Now - 07 feb 2011","uid":6157670,"size":452858464,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eac2a0747d01024a46caa44f7cd05b407ce5df65&amp;dn=Democracy+Now+-+07+feb+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1297096603,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 07, 2011\n\n- Protests in Egypt Enter 14th Day as Gov't Meets with Opposition\n- U.S. Envoy: &quot;Mubarak Must Stay in Office&quot;\n- Al Jazeera Cairo Bureau Chief Arrested\n- Egyptian Authorities Acknowledge Detaining Google Exec\n- Facing Possible Torture Probe, Bush Cancels Swiss Trip\n- Jobless Rate Drops as 200,000 Unemployed Workers Drop Out of Labor Force\n- Unemployment Rate for Veterans Reaches New High\n- Corporate America Sends GOP Lawmakers a Wish List\n- Wife of Justice Thomas Forms Tea Party-linked Lobbying Firm\n- Trial Begins in Iran for Three Hikers\n- World Social Forum Opens in Senegal\n- AOL Purchases Huffington Post for $315 Million\n\n\nSpecial reports\n\n- Protests Demanding Mubarak to Resign Grow Stronger, Despite Some Government Concessions\n\nNewly appointed Egyptian Vice President Omar Suleiman held talks on Sunday with opposition groups in Cairo in an attempt to stem the anti-government protests that continue across the country. While Suleiman agreed to several major concessions, including ending the country's decades-old emergency laws, allowing a free press and creating a committee to propose constitutional reforms, the top demand of demonstrators--the immediate removal of President Hosni Mubarak from power--was not addressed. Protests continue today across Egypt and tens of thousands of demonstrators held their ground in Tahrir Square amidst a heavy military presence. To further explain these developments, we are joined by Democracy Now! senior producer Sharif Abdel Kouddous and Hossam Bahgat, an Egyptian human rights activist live from Cairo.\n\n\n- The Empire's Bagman: U.S. Ambassador Frank Wisner Questioned on His Close Ties to Mubarak\n\nThe official U.S. response to events unfolding in Egypt remains mixed. Over the weekend, the Obama administration distanced itself from U.S. &quot;crisis envoy&quot; to Egypt Frank Wisner after he issued a statement in support in support of President Hosni Mubarak. Revealing a possible conflict of interest, British journalist Robert Fisk recently reported Wisner works for the law firm Patton Boggs, which openly boasts that it advises &quot;the Egyptian military, the Egyptian Economic Development Agency, and has handled arbitrations and litigation on the [Mubarak] government's behalf in Europe and the U.S.&quot; We are joined by Trinity College Professor Vijay Prashad, who has written about Wisner's history with the U.S. Department of State and his close relationship with Mubarak.\n\n\n- Media Crackdown: Democracy Now!'s Sharif Abdel Kouddous Reports from Tahrir Square on the Systematic Targeting of Journalists in Egypt\n\nReporting on the Egyptian Uprising has been not only difficult but even dangerous for many domestic and foreign journalists. Tactics used against media workers include cutting phone lines, repeated arrests and detention, harassment, the seizure of equipment, and intimidation. The first fatality of a journalist was also reported last week. Sharif Abdel Kouddous speaks with journalists in Cairo's Tahrir Square. He also visits a media tent set up by activists to collect reports from people on the streets.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:eac2a0747d01024a46caa44f7cd05b407ce5df65","amp;dn":"Democracy+Now+-+07+feb+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eac2a0747d01024a46caa44f7cd05b407ce5df65","infoHashBuffer":{"type":"Buffer","data":[234,194,160,116,125,1,2,74,70,202,164,79,124,208,91,64,124,229,223,101]},"announce":[],"urlList":[]}}