{"title":"Program Installers.rar","uid":6260396,"size":305122776,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec36da8f0ee1aa4354fd5ec71fec6e379cf94d81&amp;dn=Program+Installers.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ferrariaftrdark","files":1,"time":1300731811,"description":"Included in this torrent, are several installers for various programs I have used from time to time. Here's the list:\n\n3DRadPro: This is a program for 3d modeling/video game making, this program has scripting included, but you don't necessarily need to know how to use it.\n\nBumpTop: This program creates an alternative view of your desktop, this program makes a 3d cube, with a floor, and 4 walls, which you can hang various items, and keep things more &quot;organized&quot;. You can pile like items on top of each other on the floor, saving up desktop space.\n\nExpress_Burn: This program is used to make CD's or DVD's, I included a serial, therefore making it the full version\n\nGoogle_Chrome: This is another web browser, in my opinion the fastest there is.\n\nConvertmp4tomp3: Like the title indicates, this program allows you to take an MP4 video, and extract the sound out of it, this is very useful for youtube songs.\n\nFirefox: Yet another internet browser.\n\nFreeFLVtoMP4CONVERTER: Like the title says, it takes FLV files, and converts them to MP4, a watermark will appear every so often on the videos though\n\nGamebooster: One of my favorite applications, this program shuts down all background programs running, and it defrags the system, all for the purpose of making your PC run faster for gaming, or whatever. It does not affect programs that you are using.\n\nVirtualDJ: This program allows you to mix songs, edit, add effects, and things like that. You can record your work while you do it, it includes turntables on screen.\n\niTunes: This is the best music software out there, compatible with iPod's, add music, create playlists, shuffle songs, everything you need for listening purposes.\n\nMap001: This program is an RPG maker, everything you need is included in the program itself\n\nm-ipod-to-pc-transfer: This program allows you to take songs from an iPod and put them onto a computer.\n\npstudio: This program is called Platform Studio, a 2D video game software.\n\nScratch: This program is a drag and drop scripter, allowing you to create games, or animations. It's faily easy to use, and doesn't take to long to learn how to use.\n\nSkype: This program allows you to use your webcam, to communicate to other people that have webcams, who also have this program, you can Instant message, or use the speaker in you computer, while actually seing who you are talking to.\n\nTeracopy: The #1 software that I recommend, it's sole purpose is to speed up copying and transferring files. You can take HOURS off of copy time.\n\nTerragen2: This program is a 3D Still creator, it is a lot more complicated to use than Terragen1, but with a little time, you can make some pretty cool pics.\n\nVLC: This program allows you to open videos that some other applications can't\n\nThat covers it, any problems, questions, complements, thankyou's, criticizes, anything, just comment, o and seeding will help out a lot. Enjoy.","torrent":{"xt":"urn:btih:ec36da8f0ee1aa4354fd5ec71fec6e379cf94d81","amp;dn":"Program+Installers.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec36da8f0ee1aa4354fd5ec71fec6e379cf94d81","infoHashBuffer":{"type":"Buffer","data":[236,54,218,143,14,225,170,67,84,253,94,199,31,236,110,55,156,249,77,129]},"announce":[],"urlList":[]}}