{"title":"Cosmic Awareness Newsletters - 1977 to 2010","uid":6172295,"size":3354866540,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:edde6b744e38dbe3a403b1e283dca76df735890a&amp;dn=Cosmic+Awareness+Newsletters+-+1977+to+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Manpower777","files":1,"time":1297629354,"description":"This is an archive of all 700+ Cosmic Awareness Communications newsletters from 1977 through 2011. CAC previously charged $3 each for these printed newsletters, but recently released them all under &quot;Cosmic Copyright&quot; - reproduction of these newsletters or any of its content is not only permitted, but encouraged by CAC.\n\nFrom Cosmic Awareness Communications: \n\n&quot;Cosmic Awareness is the force that expressed itself through Jesus, Buddha, Krishna, Mohammed, Edgar Cayce and other great avatars who served as channels for what is commonly referred to as &quot;God.' This force communicates again today as the world begins to enter a period of Spiritual Ascension with a new consciousness and awareness. This force refers to itself as Cosmic Awareness so that it cannot be confused with an entity or a personality. It has been communicating for more than 40 years through several carefully trained channels who go deep into trance and communicate the energies and symbols that are expressed, putting them into human language. As Cosmic Awareness reveals this information, it does not ask you to &quot;believe&quot; anything, but to question, explore, doubt and discover for yourself the Truth that is within you - to discover &quot;Who, In Fact, You Really Are.&quot; We hope you enjoy exploring the literally millions of words transcribed from these Cosmic Awareness readings.&quot;\n","torrent":{"xt":"urn:btih:edde6b744e38dbe3a403b1e283dca76df735890a","amp;dn":"Cosmic+Awareness+Newsletters+-+1977+to+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edde6b744e38dbe3a403b1e283dca76df735890a","infoHashBuffer":{"type":"Buffer","data":[237,222,107,116,78,56,219,227,164,3,177,226,131,220,167,109,247,53,137,10]},"announce":[],"urlList":[]}}