{"title":"coast to coast am-2011-03-07 - Reincarnation &amp; Media ExposÃƒÂ©","uid":6229185,"size":55280257,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ef47c1797270c4a69845068e1a65474c3199ad41&amp;dn=coast+to+coast+am-2011-03-07+-+Reincarnation+%26+Media+Expos%C3%83%C2%A9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1299640718,"description":"\nReincarnation &amp; Media ExposÃƒÂ©\n----------------------------\nDate: 03-07-2011\nHost: George Noory\n\nGuests: Patrick Henningsen, Dr. Bruce Goldberg\n\n\nIn the first half of the show, hypnotherapist Dr. Bruce Goldberg talked about reincarnation, past lives, and a report that China says the Dalai Lama has to reincarnate. He agreed with the Chinese government on their decision that the Dalai Lama doesn't have the right to choose his successor any way he wants, and should follow the religious tradition of reincarnation. If the Dalai Lama chooses a successor while he's still alive it mocks the idea of reincarnation, he commented.\n\nGoldberg said his work with time travelers or &quot;chrononauts&quot; has taken him all the way to the 50th century, where humankind is still thriving, though the 35th century is a spiritual and technological peak. He also shared an interesting case study of a woman he regressed to her first life-- a being of pure green light in another galaxy. She described being condemned by authorities there for not doing her job correctly, and confined in a force field. She was then banished from her world, and sent to the more primitive Earth to reincarnate, he detailed.\n\n-----------------\n\nIn the latter half of the show, writer, analyst and managing editor of 21st Century Wire, Patrick Henningsen discussed how Facebook may be expanding their game currency (called &quot;Credits&quot;) into general commercial usage. The Credits, are currently sold for 10 cents apiece and can be applied to purchase virtual items in games and apps. Facebook has all the elements of being a virtual nation state, minus the borders, he noted. But he warned that because some of its members are exclusively storing their photos and contacts there, the site might eventually hold hostage this material, unless people buy their Credits to maintain their database.\n\nHenningson also offered commentary on geopolitical maneuverings, technology, and the building of a global government he called the 'One World Order.' A &quot;massive bureaucracy&quot; like the European Union is an example of the push toward this kind of globalism, he suggested.\n\n\nNews segment guests: Dr. Sherri Tenpenny, Jerome Corsi \n\n\nWebsites:\n21stcenturywire.com\ndrbrucegoldberg.com\n\nBooks:\nEgypt: An Extraterrestrial And Time Traveler Experiment\nCustom Design Your Own Destiny\nTime Travelers From Our Future\nPast Lives, Future Lives Revealed\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:ef47c1797270c4a69845068e1a65474c3199ad41","amp;dn":"coast+to+coast+am-2011-03-07+-+Reincarnation+%26+Media+Expos%C3%83%C2%A9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef47c1797270c4a69845068e1a65474c3199ad41","infoHashBuffer":{"type":"Buffer","data":[239,71,193,121,114,112,196,166,152,69,6,142,26,101,71,76,49,153,173,65]},"announce":[],"urlList":[]}}