{"title":"Post.Apocalyptic.Mayhem.incl.Update.1.RIP-Unleashed","uid":6292358,"size":399281903,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f08534bb4d04c271c4edf1264646f6e9e03c671a&amp;dn=Post.Apocalyptic.Mayhem.incl.Update.1.RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":42,"time":1301865655,"description":"Release Date  :  03/04/2011                Protection  :  Steam\nRelease Type  :  RIP 40x10.00MB            Company    :  Meridian4\n\nRelease Notes\n\nPost Apocalyptic Mayhem lets you race and battle heavily-modified\nvehicles through numerous breathtaking tracks and lay waste to other\nracers in over-the-top vehicular mayhem. You can use special vehicle\nabilities to cause spectacular destruction to enemy cars as you fight\nand speed to victory. Youll experience remarkable speeds, hilarious\nand violent weapons, reinforced vehicles and various exhilarating tracks\n\nThe game offers various intense race modes to allow you to showcase\nboth your driving and battling skills. PAM features an accessible\nphysics-based driving model that allows you to sense the immense speed\nof all the post apocalyptic vehicles as well as feel every\nbone-jarring impact from both weapons and the tracks. Play\nsingle-player or battle up to five friends in online multiplayer mode.\n\nFeatures:\n\nVehicles  PAM offers numerous post apocalyptic vehicles. All\nthe Vehicles are heavily-modified and extremely menacing. All Vehicles\nare heavy-duty, reinforced and are able to take and give a lot abuse.\nThe vehicles all look like they can quickly and easily travel over the\nnewly scorched wasteland while effortlessly smashing other vehicle\nalong the way.\n\nWeapons  All of the vehicles have three unique and powerful\nabilities that they can use to severely damage opposition vehicles:\none front attack, a side attack and a rear attack. A Player can\nreceive these special abilities by picking up Special Ability Barrels\nthat are placed throughout all of the tracks. When a vehicle runs over\na Special Ability Barrel, the vehicle will gain that specific ability\nand the Player will be able to use it whenever they prefer.\n\nMultiplayer  Intense Online Multiplayer racing for up to 6\nplayers.\n\nEnvironments  The PAM tracks will be able to give players\nnumerous options while racing as well as create intense areas for the\nall important collisions. All Tracks will contain:\no Awe-inspiring apocalyptic environments.\no Various paths around certain areas of the tracks.\no Funnel areas were players are forced to drive in close\nquarters with other vehicles.\no Huge Jumps.\no Numerous compelling and completely unique tracks.\n\nAchievements  35 Steam achievements to be earned and displayed\nproudly.\n\nOnline Leader Boards  Every kill, every race and every result\nwill be recorded and uploaded to online leader boards for bragging\nrights and fueled competition.\n\nLanguages: English, German, French, Italian, Spanish and Russian\n\nRIPPED: A logo movie file was relinked\n\nInstall Notes\n\n1. Unpack the release with WinRAR or equivalent\n2. Install by running unl-pam1.exe\n3. Start game with PAMMainGame.exe\n4. Enjoy\n\nRemember to support quality games\n","torrent":{"xt":"urn:btih:f08534bb4d04c271c4edf1264646f6e9e03c671a","amp;dn":"Post.Apocalyptic.Mayhem.incl.Update.1.RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f08534bb4d04c271c4edf1264646f6e9e03c671a","infoHashBuffer":{"type":"Buffer","data":[240,133,52,187,77,4,194,113,196,237,241,38,70,70,246,233,224,60,103,26]},"announce":[],"urlList":[]}}