{"title":"Alex Jones Show - 2011 Feb 23 WE [sebaygo1]","uid":6197829,"size":86909383,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f0eb29a47d87c8d71f51f7c48a34e2f6d2a172b0&amp;dn=Alex+Jones+Show+-+2011+Feb+23+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":14,"time":1298501302,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 23 February 2011\n\n\n[sebaygo1]\n\n\nScheduled Guests\n................\n\nFrom the Infowars web site ::\n\nAlex welcomes back to the show Porter Stansberry, founder of [Jones show sponsor] Stansberry &amp; Associates Investment Research, a private publishing company based in Baltimore, Maryland. His monthly newsletter, Stansberry's Investment Advisory, deals with safe value investments and helps investors avoid the big disasters associated with Wall Street's collapse. \n\nPastor Lindsey Williams returns to follow up on information he revealed about the price of oil and Middle East turmoil on the Alex Jones Show yesterday. \n\nAlex also talks with independent journalist James Corbett, editor and webmaster of The Corbett Report, an online multi-media news and information source, since 2007. His forthcoming book, Reportage: Essays on the New World Order, will be available this year. \n\nTalk radio host Mancow Muller also makes an appearance on today's show.  [Former Defense Secretary Rumsfeld appeared on Mancow's show and denied ever hearing of WTC Building 7.]\n\n\nAlex extended today's broadcast about 50 minutes into the 4th hour.  Announcements in today's show: James Corbett may begin guest-hosting on the Jones show, Charlie Sheen is a scheduled guest for tomorrow and Lindsey Williams will be back on Tuesday of next week.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:f0eb29a47d87c8d71f51f7c48a34e2f6d2a172b0","amp;dn":"Alex+Jones+Show+-+2011+Feb+23+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0eb29a47d87c8d71f51f7c48a34e2f6d2a172b0","infoHashBuffer":{"type":"Buffer","data":[240,235,41,164,125,135,200,215,31,81,247,196,138,52,226,246,210,161,114,176]},"announce":[],"urlList":[]}}