{"title":"coast to coast am. 2011-02-20 - UFO Myths &amp; Realities","uid":6192191,"size":56561666,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f1246a952cbdb669ecae79d8c52618a4c1dea46d&amp;dn=coast+to+coast+am.+2011-02-20+-+UFO+Myths+%26+Realities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mscowlove","files":5,"time":1298330302,"description":"\nUFO Myths &amp; Realities\n---------------------\nDate: 02-20-2011\nHost: George Knapp\n\nGuest: Col. John Alexander\n\n\nWhile still on active duty in the U.S. Army during the 1980s, Col. John B. Alexander created an interagency group to explore the subject of UFOs. He joined George Knapp for the full 4-hour program to discuss what he's uncovered about the existence of these mysterious flying machines, and the lore that surrounds them. &quot;UFOs are real...there are hard physical objects that transit the universe from time to time-- every sensor we have picks them up,&quot; yet the extraterrestrial hypothesis seems like too simple of an explanation, he said. A single answer may not apply to UFOs that can vary wildly in size from tiny balls of light to huge craft, he added. \n\nAmong the experts Alexander conferred with on the UFO question were Ben Rich, head of Lockheed's Skunk Works, aerospace engineer Burt Rutan, and the late Edward Teller, the 'father of the hydrogen bomb.' All thought it was an interesting topic but said they didn't have any answers or direct knowledge. Alexander said there are a number of solid UFO cases such as Bentwaters, the Phoenix Lights, and the Cash-Landrum incident, yet he's concluded there's no formal govt. policy trying to cover-up UFO sightings. While the UFO community has been clamoring for disclosure, what they really want is confirmation of their preconceived ideas, he opined. \n\nThere's an awful lot of false information out there, Alexander declared, such as the MJ-12 documents (which he said are faked), and the idea that UFOs have successfully been reversed engineered. He offered a proposal that a high level government official such as Robert Gates say publicly that &quot;anyone who has information about UFOs, and has been told they can't talk about it, are now free to talk.&quot; Dr. Alexander will be giving a presentation this Wednesday at the UFO Congress in Arizona. \n\n\nWebsite:\njohnbalexander.com\n\nBook:\nUFOs: Myths, Conspiracies, and Realities\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:f1246a952cbdb669ecae79d8c52618a4c1dea46d","amp;dn":"coast+to+coast+am.+2011-02-20+-+UFO+Myths+%26+Realities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1246a952cbdb669ecae79d8c52618a4c1dea46d","infoHashBuffer":{"type":"Buffer","data":[241,36,106,149,44,189,182,105,236,174,121,216,197,38,24,164,193,222,164,109]},"announce":[],"urlList":[]}}