{"title":"Listening Post~Libya: A Media Black Hole   20l1  02  25  Aljazee","uid":6205272,"size":147597452,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f393952acc69b8abad7e9199b24c405994d5eeb8&amp;dn=Listening+Post%7ELibya%3A+A+Media+Black+Hole+++20l1++02++25++Aljazee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1298772778,"description":"Listening Post~Libya: A Media Black Hole   20l1  02  25  Aljazeera \n\n/25.56 mins/avi\n\n\nGaddafi responded to protests by shutting out journalists, jamming TV transmissions and cutting off the internet.\n\nFrom the media black hole that was Libya, shocking videos illustrate the revolt. Also, South Africa's best known political cartoonist: Jonathan Shapiro.\n\nThe media's role in the historic Arab uprisings has so far been celebrated and feared, with the collaboration between new media and satellite TV too powerful for dictators to withstand. But that has all changed in Libya. Muammar Gaddafi appears to have learnt some media lessons from the uprisings in Egypt and Tunisia and quickly responded to protests in his country by shutting out foreign journalists, jamming TV transmissions and cutting off the internet and phone networks.\n\nThe absence of professional journalists has meant that the job has been left to citizen journalists and the world has been able to follow the story through the often horrific and violent videos that have been leaked out of the country. In our News Divide this week we look at new media's role in shedding light on an otherwise information black hole.\n\nSome quick hits from the media world: In Hungary critics of a new media law are still concerned despite some amendments being made; a prominent Bahraini blogger is released from jail; journalist Michael Hastings wins the coveted Polk award for his profile of General Stanley McChrystal; Britain's Daily Telegraph follows the lead of The Times and the New York Times and plans to erect a paywall; and an independent TV and radio station broadcast into Myanmar is facing financial trouble.\n\nJacob Zuma would seem to be an easy man to satirize. Corruption scandals and allegations of rape are only a few of the topics that could be used against the South African prime minister. However, one satirist seems to have crossed the line after being given a court summons for his drawings. Jonathan Shapiro - known as Zapiro - has been a thorn in side of South African governments for decades; drawing satirical cartoons throughout Apartheid and through the formative years of a fledgling new democracy. With the help of a French producer he is hoping to move from the pages of a paper and on to the television screen. But television networks seem to be afraid of his edgy sketches and he cannot find a broadcaster. Listening Post's Nick Muirhead catches up with Zapiro in Cape Town.\n\nOur web video of the week stays with the theme of political cartoonists. Earlier we reported on the sale of the Huffington Post to AOL for $315mn. A lot of Arianna Huffington's content is linked to other sights - a fact not lost on political cartoonist Mark Fiore, who thinks Huffington has done rather well financially from an aggregator. We hope you enjoy the show.\n\nFLV:\n\nOther shunster posts","torrent":{"xt":"urn:btih:f393952acc69b8abad7e9199b24c405994d5eeb8","amp;dn":"Listening+Post%7ELibya%3A+A+Media+Black+Hole+++20l1++02++25++Aljazee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f393952acc69b8abad7e9199b24c405994d5eeb8","infoHashBuffer":{"type":"Buffer","data":[243,147,149,42,204,105,184,171,173,126,145,153,178,76,64,89,148,213,238,184]},"announce":[],"urlList":[]}}