{"title":"HISTORY OF POP AND ROCK MUSIC - part 287","uid":6222167,"size":785546462,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f50d5ad2e8d86de7e2e6b34ca368cf854a90687b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+287&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1299370590,"description":"                    PART  287\n\n\n            GREAT WHITE  - Save your love  (1987)\n            THUNDER  -  Love walked in  (1990)\n            DEEP PURPLE  - Love Conquers All  (1990) \n            METALLICA  -  Nothing Else Matters  (1992)\n            APOCALYPTICA - Nothing Else Matters  (1998)\n  \n\n\n     &quot;Save your love&quot; is a song by Great White, released as a single, taken from their  &quot;Once Bitten...&quot; album. &quot;Once Bitten...&quot; album was released in 1987 and became a commercial success, selling more than a million copies and being certified Platinum a few years later. It is the third full-length studio album by Great White.\n    &quot;Love walked in&quot;  is a song by Thunder  from their &quot;Backstreet Symphony&quot; album. &quot;Backstreet Symphony&quot; is the first album by Thunder. It was released in early 1990 . The band achieved its first two UK Top 30 hits with singles from this album; the title track reached #25 and, the following year, &quot;Love Walked In&quot; reached #21. The album was later certified 'Silver' by the BPI.\n    &quot;Love Conquers All&quot; is a song by Deep Purple from their album &quot;Slaves and Masters&quot;.It is the thirteenth studio album by Deep Purple, and was released in 1990. This is the only album to feature singer Joe Lynn Turner, who had replaced Ian Gillan the previous year (and was once the lead singer of Ritchie Blackmore's post-Purple band Rainbow). However, Turner was still a member of the group when they began recording The Battle Rages On.Although the album didn't attract big enough media attention and was practically lost in the USA, the following 1991 European tour was a very big success musically and financially.\n    &quot;Nothing Else Matters&quot; is a song by the American heavy metal band Metallica. It was released as the fourth single from their eponymous fifth album, &quot;Metallica&quot;. The song reached #11 on the Billboard Mainstream Rock Tracks chart as well as top-ten positions on many European charts. The song has now become a staple in Metallica's live performances, and has been dedicated to their fans .Because of the song's popularity it has been covered many times, by both artists within and outside the rock genre. ","torrent":{"xt":"urn:btih:f50d5ad2e8d86de7e2e6b34ca368cf854a90687b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+287","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f50d5ad2e8d86de7e2e6b34ca368cf854a90687b","infoHashBuffer":{"type":"Buffer","data":[245,13,90,210,232,216,109,231,226,230,179,76,163,104,207,133,74,144,104,123]},"announce":[],"urlList":[]}}