{"title":"Freedom Writers 2007 Drama  retail DD 5.1 -TBS","uid":6235782,"size":4682940142,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f51b1e48bd6b5b5b1a802967764cda50b8bfe6f3&amp;dn=Freedom+Writers+2007+Drama++retail+DD+5.1+-TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Saggin","files":-1,"time":1299865878,"description":"Freedom Writers 2007 Drama  retail DD 5.1  Multilanguage \n\n\nNederlands:       \n\nVerenigde Staten / Duitsland\nDrama\n123 minuten\n\ngeregisseerd door Richard LaGravenese\nmet Hilary Swank, April Lee Hernandez en Mario\n\nEen nieuwe lerares heeft moeite met het gedrag van haar leerlingen. Al spoedig merkt ze dat die houding veroorzaakt wordt door de gruwelen waarmee ze op straat in aanraking komen. Ze begint met een nieuw project waarbij ze hen respect, tolerantie en andere waarden bij wil brengen. De interesse is in het begin niet groot, maar hoe verder het project komt, hoe groter de invloed op hun gedrag blijkt te zijn.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/40058&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/40058&lt;/a&gt;\n\nEnglish\nThe storyline with the movie requires place between 1992-1995, beginning with scenes through the 1992 Los Angeles Riots. Hilary Swank plays the role of Erin Gruwell, a new, excited schoolteacher who leaves the safety of her hometown, Newport Beachfront, to teach at Woodrow Wilson High School in Long Beachfront, a formerly high achieving school which has recently had an integration plan put in place. Her enthusiasm is rapidly challenged when she realizes that her class are all \\&quot;at-risk\\&quot; high school students, also known as \\&quot;unteachables\\&quot;, and not the eager college students she was expecting. The high school students segregate on their own into racial groups in the classroom, fights break out, and eventually most of the high school students stop turning up to class. Not only does Gruwell meet opposition from her high school students, but she also has a difficult time with her department head, who refuses to let her teach her high school students with books in case they get damaged and lost, and instead tells her to focus on training them discipline and obedience.\n\nOne night, two high school students, Eva (April Lee HernÃƒÂ¡ndez), a Hispanic girl and narrator for much of film, and a Cambodian refugee, Sindy (Jaclyn Ngan), find on their own in the same convenience store. An additional student, Grant Rice (Armand Jones) is frustrated at losing an arcade game and demands a refund through the owner. When he storms out, Eva\\'s boyfriend attempts a drive-by shooting, wanting to kill Grant but misses, accidentally killing Sindy\\'s boyfriend. As Eva is really a witness, she must testify at court; she intends to guard her personal kind in her testimony.  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0463998&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0463998&lt;/a&gt;\n\ninfo &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Freedom_Writers&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Freedom_Writers&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5\nAudio          : Engels 5.1 DD\nBron           : retail \nOndertitels    : nl, Danish, English, Norwegian, Finnish, Swedish\nGenre          : Drama\n\nTBS","torrent":{"xt":"urn:btih:f51b1e48bd6b5b5b1a802967764cda50b8bfe6f3","amp;dn":"Freedom+Writers+2007+Drama++retail+DD+5.1+-TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f51b1e48bd6b5b5b1a802967764cda50b8bfe6f3","infoHashBuffer":{"type":"Buffer","data":[245,27,30,72,189,107,91,91,26,128,41,103,118,76,218,80,184,191,230,243]},"announce":[],"urlList":[]}}