{"title":"Going The Distance(2010)DVDRip.AC3(ENG)-DROCK","uid":6185103,"size":730593280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f69acd25cb9899ee60d416ca33ad1e1dc3444759&amp;dn=Going+The+Distance%282010%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1298092781,"description":"Drew Barrymore and Justin Long star in this romantic comedy about a long-distance romance that may be worth fighting for. Garrett (Long) is still nursing the wounds from a recent breakup when he meets Erin (Barrymore), an unflinchingly honest girl with a big talent for bar trivia. Hitting it off immediately, the pair spend a romantic summer together in New York City. It was supposed to be a summer fling, but as fall approaches and Erin returns to San Francisco, the spark is still there. Subsequently dividing his days between working and hitting the bars with best friends Box (Jason Sudeikis) and Dan (Charlie Day), Garrett drops everything whenever Erin calls. The more Garrett's phone rings, the more his pals begin to suspect that their drinking buddy is taking the relationship a little too seriously. And they're not the only ones; Erin's sister, Corrine (Christina Applegate), is keen to ensure that her smitten sibling doesn't repeat the mistakes of her past, and she makes no attempts to sugarcoat the fact that she disapproves of the coast-to-coast romance. But the heart wants what the heart wants, and as the texting becomes more intense, both Garrett and Erin start to suspect that their summer fling may just be the real thing.\n\nRipped with Handbrake.\n\nLength: 1 Hour 42 Minutes\n\nFile Type: AVI\n\nNo Subs","torrent":{"xt":"urn:btih:f69acd25cb9899ee60d416ca33ad1e1dc3444759","amp;dn":"Going+The+Distance%282010%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69acd25cb9899ee60d416ca33ad1e1dc3444759","infoHashBuffer":{"type":"Buffer","data":[246,154,205,37,203,152,153,238,96,212,22,202,51,173,30,29,195,68,71,89]},"announce":[],"urlList":[]}}