{"title":"Secrets.In.The.Walls.HDTV.XviD.2010-TiCTaC-Tipsit.nu","uid":6265794,"size":734027776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f6de7c4a584e13094986235157827c6d4348e646&amp;dn=Secrets.In.The.Walls.HDTV.XviD.2010-TiCTaC-Tipsit.nu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JeHwa","files":1,"time":1300903354,"description":"*** This review may contain spoilers ***\n\nSecrets in the Walls is about a single mother who, after landing a great job in an area of town far from her apartment, fatefully stumbles across the perfect house after getting lost while trying to find her bus home. After moving her two daughters into the old house, strange events begin to take place as something seems to be stalking the older daughter, but only the younger daughter can sense how dangerous it really is.\n\nThe elements that make up this story are derivative, but they\\'re derivative done reasonably well, and the actors all seem to be having fun with it, which adds a lot to a B movie\\'s watchability factor. Also, some spooky stuff really does go down, especially in the film\\'s first half. The second half is bogged down by the fact that the villain is trying to hide in plain sight and it kind of cramps her spooky style, but by that point she has fully earned a comeuppance and the desire to see it come to pass is just enough to hold the viewer\\'s attention.\n\nAs to the derivative elements, there\\'s a good deal of Haunting in Connecticut DNA here, as well as a splash of Amityville Horror, but the movie\\'s biggest twist is lifted directly from The Ring. This movie isn\\'t as good as any of those three, but it beats a lot of ghost stories I\\'ve seen on TV lately, and for a late night spent home alone, it\\'s good enough to turn down the lights with a bowl of Parmesan popcorn and get creeped out.","torrent":{"xt":"urn:btih:f6de7c4a584e13094986235157827c6d4348e646","amp;dn":"Secrets.In.The.Walls.HDTV.XviD.2010-TiCTaC-Tipsit.nu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6de7c4a584e13094986235157827c6d4348e646","infoHashBuffer":{"type":"Buffer","data":[246,222,124,74,88,78,19,9,73,134,35,81,87,130,124,109,67,72,230,70]},"announce":[],"urlList":[]}}