{"title":"Democracy Now - 04 mar 2011","uid":6218681,"size":440745827,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f7282d064ca61389e0337cd44325a5b3052deb1f&amp;dn=Democracy+Now+-+04+mar+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1299255927,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 04, 2011\n\n- Fighting Continues in Libya; Checkpoints Expand in Tripoli\n- Obama Orders U.S. Military To Be Prepared To Act in Libya\n- U.N.: Number of Refugees Leaving Libya Decreases\n- Egyptian Protesters Hail Selection of New Prime Minister\n- Saudi Protesters Demand Release of Shiite Leader\n- Thousands of Iraqis Protest in &quot;Day Of Regret&quot;\n- Judge Orders Protesters to Leave Wisconsin Capitol\n- Lawyer: Bradley Manning Held Naked For Seven Hours\n- Assange: New Charges Against Manning &quot;A Very Serious Matter&quot;\n- Seven Female Protesters Shot Dead in Ivory Coast\n- California Man Sues After FBI Places GPS Device on Car\n- Hillary Clinton Praises Al Jazeera as &quot;Real News&quot;\n\n\nSpecial reports\n\n- Environmentalist Tim DeChristopher Found Guilty of Sabotaging Oil and Gas Auction; Faces Up To 10 Years in Jail\n\nA federal jury in Salt Lake City has convicted environmental activist Tim DeChristopher of two felony counts for disrupting the auction of more than 100,000 acres of federal land for oil and gas drilling. DeChristopher was charged in December 2008 with infiltrating a public auction and disrupting the Bush administration's last-minute move to auction off oil and gas exploitation rights on vast swaths of federal land. A student at the time, DeChristopher posed as a bidder and bought 22,000 acres of land with no intent to pay in an attempt to save the property from drilling. He faces up to ten years in prison. DeChristopher joins us today to talk about the verdict.\n\n\n- Leaked EPA Documents Expose Decades-Old Effort To Hide Dangers of Natural Gas Extraction\n\nEfforts by lawmakers and regulators to force the federal government to better police the natural gas drilling process known as hydraulic fracturing, or &quot;fracking&quot; have been thwarted for the past 25 years, according to an expose in the New York Times. Studies by scientists at the U.S. Environmental Protection Agency on fracking have been repeatedly narrowed in scope by superiors and important findings have been removed under pressure from the industry. The news comes as the EPA is conducting a broad study of the risks of natural gas drilling with preliminary results scheduled to be delivered next year. Joining us is Walter Hang, president of Toxics Targeting, a firm that tracks environmental spills and releases across the country based in Ithaca, New York, where fracking is currently taking place.\n\n\n- Natural Gas Industry Attacks Oscar-Nominated Film &quot;Gasland&quot; For Chronicling Devastating Impact of Hydraulic Fracking\n\nThe environmental contamination and human health risk associated with the extraction of natural gas using horizontal drilling and hydraulic fracturing, or &quot;fracking,&quot; was little known across the United States for years, until a documentary film brought the issue to the national stage. Josh Fox directed the film Gasland, which chronicals the devastation affecting communities where fracking is taking place, and the influece of the natural gas industry over regulation of the techniques and chemcials used in the process. The industry aggressively attacked the film, especially when it was nominated for an Academy Award this year.\n\n\n- Michael Hastings: Army Deploys Psy-ops on U.S. Senators in Afghanistan\n\nFederal law prohibits the military from using propaganda and psychological tactics on U.S. citizens, but that is exactly what may have happened in Afghanistan according to reporter Michael Hastings, who joins us to speak about his recent expose for Rolling Stone magazine is called, &quot;Another Runaway General: Army Deploys Psy-ops on U.S. senators.&quot; In the article, Hastings writes that Lt. General William Caldwell, the commander of NATO Training Mission in Afghanistan, illegally employed psychological operations to manipulate visiting U.S. senators into providing more troops and funding for the war effort. &quot;It show how far-off the rails the entire operation has gone,&quot; Hasting says. &quot;The most important battlefield isn't in Afghanistan, it is in Washington.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:f7282d064ca61389e0337cd44325a5b3052deb1f","amp;dn":"Democracy+Now+-+04+mar+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7282d064ca61389e0337cd44325a5b3052deb1f","infoHashBuffer":{"type":"Buffer","data":[247,40,45,6,76,166,19,137,224,51,124,212,67,37,165,179,5,45,235,31]},"announce":[],"urlList":[]}}