{"title":"Jacque Fresco Compilation","uid":6292211,"size":57682587014,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f9f6e0dda15e712aa8f8c78e0acd1cbb4499bc9f&amp;dn=Jacque+Fresco+Compilation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ivanl","files":1291,"time":1301860540,"description":"#\n# What is this torrent?\n\nFocus of this torrent is Jacque Fresco and by extension The Venus Project of his.\nIt is mainly a tribute of sorts to Jacque Fresco and his work. The purpose of this\ncompilation is to give one an opportunity to easily and comfortably discover even\nmore ideas and views held by Jacque Fresco.\n\n\n#\n# Composition of the torrent\n\no 95% of data is speeches, lectures and interviews with Jacque Fresco.\no 3% The Venus Project related stuff\no 2% miscellaneous and trivia, varying from short video clips taken with mobile\n  phones, to Future By Design and Zeitgeist: Addendum outtakes, film commentaries\n  to fan made stuff (make sure you check this out!) and a couple of The Venus\n  Project related and Zeitgeist films that feature Jacque Fresco, to electronic\n  copies of magazines where Jacque Fresco was published, his e-books and audio\n  interviews with him.\n\n99% of all available videos that existed and were freely accessible have been\ndownloaded from:\n\no YouTube and Vimeo as of Dec 6, 2010\no Google Video, Dailymotion, dotsub, various blogs, etc. as of Dec 7, 2010\n\nI\\'m pretty much sure I got them all but, of course, I\\'m just a human being and I\ncould\\'ve missed something.\n\n\n#\n# Why did I do this?\n\nYouTube and similar video hosting web-sites are great and all but there are few\npoints about them to keep in mind:\n\no YouTube has been progressively becoming more and more controlling of what content\n  can be hosted and who can view it (for now this is applicable to mainly\n  copyrighted material)\no Users come and go or get banned, or something else happens and their accounts are\n  deleted and all the videos they uploaded, favorited and the playlists they\n  created are gone for good with those accounts too. Thus this torrent attempts\n  to prevent loss of these materials.\no Lots of these videos on YouTube specifically are on servers with very low\n  connection speeds. That is just frustrating when you want to see a 2 minutes long\n  video clip that takes you 5 minutes to cache it on &gt;10Mbit/s link.\no Perhaps most interesting videos are buried beneath of pile of hundreds of\n  duplicates of other, more popular, videos and were found by essentially persistent\n  sorting out. Here in this torrent you can easily find anything there is for you to\n  see (as of date of plowing the Internet). It took a lot of time and some pain to\n  put it all together but I thought you\\'d be just thrilled to have all this material\n  at your fingertips.\no I also wanted to make sure that all this material can be easily accessible to\n  anyone and nothing never gets deleted or disappears. BitTorrent is an awesome\n  protocol for this kind of thing so, please, download and share indefinitely.\n\n\n#\n# Other notes\n\no Most of these videos are not explicitly copyrighted I guess. In fact, I think 99%\n  of this array of data either isn\\'t copyrighted or copyright holders will be happy\n  to know that this torrent exists and people are downloading it.\no Videos were left split in parts intentionally with original YouTube (Vimeo,\n  Google Video, etc.) names so you could easily find them on YouTube should you\n  want to read a video description and/or see other videos of the user who\n  uploaded them. Or maybe like, favorite, leave a comment, etc.\no Highest possible video resolution was a priority. There are 1080p, 720p and\n  lower resolutions. Where 1080p and 720p were available both versions of a file\n  were saved and were either marked with -1080p and -720p filename affix\n  correspondingly. You can find single-file and also full versions of some of these\n  videos on dotsub but in lower resolutoins, no HD.\no In fact, I did some file renaming for some files but only to ensure they were\n  sorted in a meaningful fashion so that you could easily drag and drop them into\n  your video player or create playlists from UNIX console easily. So, when searching\n  for any video on the Internet omit 1of9 or 19 and add spaces between words to find\n  the video.\n\n\n#\n# Keywords\n\nJust in case you\\'re wondering how I searched for the videos I used the following\nkeywords:\n\no Jacque Fresco\no The Venus Project\no Venus Project\n\nA combinations of those by grouping with \\&quot; \\&quot; and negating some results wih -youtube\nkeywords and similar to tune the results. Which returned almost 6 thousand of videos\non YouTube only for Jacque Fresco. I plowed through all these thousands of results\nfor each of the keywords including each user channel and their uploads and playlists.\nNo, I\\'m sorry but I didn\\'t go through the Favorites. I don\\'t have that much time nor\ndo I believe it would\\'ve yielded discovery of the videos that were not indexed by\nYouTube\\'s search engine. \n\nAs a matter of fact, going through a user\\'s uploads and playlists actually resulted\nin discovery of interesting but otherwise obfuscated videos with Jacque Fresco or\nrelated to The Venus Project. Something you might want to keep in mind when searching\nfor videos on YouTube and similar web-sites.\n\n\n#\n# The Venus Project World Lecture Tour\n\nThis torrent also includes video and audio recordings of lectures given by Jacque\nFresco and Roxanne Meadows on TVP World Lecture Tour. There are at least some videos\nfor 12 out of 18 countries that Jacque and Roxanne visited in 2010 (full list of\ncountries and dates is here: http://www.thevenusproject.com/world-tour-lecture-dates/ ).\n\n\n#\n# Zeitgeist Movement\n\nI deliberately did not include speeches, lectures and interviews with Peter Joseph\nand basically 99% of purely Zeitgeist Movement related material. You can easily find\nlots of Zeitgeist videos on YouTube, Google Video, Vimeo, dotsub, DailyMotion and\nother web-sites all around the Internet. As I said this is a tribute of sorts to\nJacque Fresco.\n\nHowever I did include Awakening and Our Technical Reality by Douglas Mallette, NASA\nTVP advocate. As well as Automation Is Here and a couple of Zeitgeist films since all\nof these films either demonstrate the feasibility of technological aspects of The Venus\nProject or feature prominently Jacque Fresco and his ideas.\n\n\n#\n# More media with Jacque Fresco\n\nCheck-out the TVP web-store, you\\'ll find classic audio lectures, videos and books\nby Jacque Fresco. &lt;a href=&quot;\nhttp://thevenusproject.com/store&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thevenusproject.com/store&lt;/a&gt;\n\n\nFuture By Design\n\na documentary film about the life and work of Jacque Fresco.\nThis is a must see. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0870112/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0870112/&lt;/a&gt;\n\n\nZeitgeist: Addendum\n\nwhich prominently features Jacque Fresco and introduces viewers\nto the concepts of The Venus Project. Available on-line for free on YouTube,\nGoogle Video and/or Vimeo. Just google it up. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1332128/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1332128/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.zeitgeistmovie.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zeitgeistmovie.com&lt;/a&gt;\n\n\nZeitgeist: Moving Forward\n\nwhich gives a thorough analysis of how environment shapes\nhuman beings and how it relates to human nature, why present socioeconomic system\nfails, and presents concrete examples of how a Resource Based Economy could be\nestablished. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1781069/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1781069/&lt;/a&gt; &lt;a href=&quot;\nhttp://zeitgeistmovingforward.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://zeitgeistmovingforward.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.zeitgeistmovie.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zeitgeistmovie.com&lt;/a&gt;\n\n\nThe Reality of Me\n\na 12 hour long documentary film, a daring attempt at a really first of its kind,\ncomprehensive, holistic, critical overview of the state of affairs of the modern\nworld as we know it today, its socioeconomic, political, cultural, scientific and\ntechnological aspects. Completely based on the ideas of Jacque Fresco, RBE and TVP. &lt;a href=&quot;\nhttp://tromsite.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tromsite.com/&lt;/a&gt;\n\n\nThis should give you a really nice starting point.\n\n\n#\n# Final note\n\nPlease, download and share indefinitely 24/7. We do not have to depend neither on\nGoogle, nor Vimeo, nor any other authority.","torrent":{"xt":"urn:btih:f9f6e0dda15e712aa8f8c78e0acd1cbb4499bc9f","amp;dn":"Jacque+Fresco+Compilation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f6e0dda15e712aa8f8c78e0acd1cbb4499bc9f","infoHashBuffer":{"type":"Buffer","data":[249,246,224,221,161,94,113,42,168,248,199,142,10,205,28,187,68,153,188,159]},"announce":[],"urlList":[]}}