{"title":"Democracy Now - 27 jan 2011","uid":6131758,"size":440526018,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fac6b52272663a39cbb49020f23c15ca247410e5&amp;dn=Democracy+Now+-+27+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1296153593,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 27, 2011\n\n- Defying Gov't Ban, Egyptians Protest Mubarak\n- Clinton: Egypt Should Enact Reforms, Respect &quot;Universal Rights&quot;\n- Thousands Protest Saleh in Yemen\n- Tunisia Issues Arrest Warrant for Ben Ali\n- Arizona Judicial Emergency Could Delay Loughner Trial; Giffords Condition Improves\n- U.S. Deficit to Hit Record $1.5 Trillion\n- Financial Crisis Panel Recommends Prosecutions\n- Soldier Reaches Plea Deal in Afghan &quot;Kill Team&quot; Case\n- PrÃƒÂ©val ProtÃƒÂ©gÃƒÂ© to Exit Haiti Race\n- Thousands Protest U.S. Coca Stance in Bolivia\n- Palestine Papers: Palestinians Acceded to U.S. Demand for Goldstone Delay\n- Gay Rights Activist Slain in Uganda\n- Accused Penn. Teen is Youngest Person Ever to Face Life Term\n\n\nSpecial reports\n\n- Guardian Journalist Arrested and Beaten Alongside Protesters in Egypt Secretly Records Ordeal\n\nIn Egypt, running battles between police and anti-government protesters continued into the early hours of Thursday morning. Police have arrested up to 1,200 people, including a number of journalists. Among them was Guardian reporter, Jack Shenker. He was arrested and beaten by plainclothes police on Tuesday night and shoved into a truck with dozens of other people. He managed to keep his dictaphone with him and recorded what was happening as the truck carried them outside of Cairo. We play some of the dramatic audio and speak to him live by telephone. [includes rush transcript]\n\n\n- Guardian Reporter Jack Shenker on Egypt Protests: 'Fear Barrier Seems to Have Been Broken'\n\nUnprecedented protests in Egypt continue for a second day. On Wednesday, demonstrators defied a government ban on gatherings and took to streets in the biggest popular protests against President Hosni Mubarak in three decades. We go to Cairo to speak with Guardian reporter Jack Shenker. &quot;That fear barrier seems to have been broken,&quot; Shenker says. &quot;Software engineers, bankers and lawyers, middle-class people who were generally enjoying a comfortable standard of living, but [are] still being motivated to come out to be beaten and carried off into the desert,&quot; he says. &quot;They're so much energy and so much momentum behind what is going on ... I think we will still see a lot of people on the streets tomorrow.&quot;\n\n\n- Egyptian-American Activist: Hillary Clinton Forget to Mention Tear-Gas, Tanks, Concussion Grenades Used Against Egypt Protesters Are Made in the U.S.\n\nIn Egypt, protesters faced tear gas, water cannon and beatings from security forces on the streets of Cairo on Wednedsay. Up to 1,200 people were arrested, including a number of journalists. Six people have reportedly been killed since Tuesday. Meanwhile, U.S. Secretary of State Hillary Clinton did not criticize the Egyptian government, saying only that the country was stable and Egyptians had the right to protest, while urging all parties to avoid violence. We speak with Mostafa Omar, an Egyptian-American activist and writer.\n\n\n- From Tuscon to Virginia Tech: Shooting Survivor Calls for Gun Control\n\nThirty-two people died in the 2007 Virginia Tech shooting, 6 died in the Tuscon attack on Rep. Gabrielle Giffords, and 34 people are killed by a bullet every day in the United States. However, President Obama made no mention of gun control during his State of the Union address Tuesday. White House advisers say he will soon unveil new gun control efforts to strengthen current laws that allow mentally unstable people, such as alleged Arizona shooter Jared Loughner, to purchase assault weapons without a background check. We speak with Colin Goddard, a survivor of the Virginia Tech shooting massacre, who after recovering and finishing his degree, decided to work with the Brady Campaign to Prevent Gun Violence, the nation's largest gun control organization. His story is told in Living for 32, a new documentary that just premiered at the Sundance Film Festival. We also hear from former Salt Lake City mayor, Rocky Anderson, about a bill passed Wednesday by the Utah House of Representatives to make the Browning M1911 pistol the official state gun.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fac6b52272663a39cbb49020f23c15ca247410e5","amp;dn":"Democracy+Now+-+27+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac6b52272663a39cbb49020f23c15ca247410e5","infoHashBuffer":{"type":"Buffer","data":[250,198,181,34,114,102,58,57,203,180,144,32,242,60,21,202,36,116,16,229]},"announce":[],"urlList":[]}}