{"title":"Roots - From Abraham to America (Peter Peter Raymond Capt)","uid":6245613,"size":519155718,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb838473d6fffc10a09cfc1066a25586c7ed4cdd&amp;dn=Roots+-+From+Abraham+to+America+%28Peter+Peter+Raymond+Capt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Borzoi","files":1,"time":1300226831,"description":"In the late 1950s, the Federal Government began its move to take over the public schools in various states of the country (and the world for that matter!) and much of the public was incensed...\n\nBy the 1960s, many of the young people began to ask the question &quot;who am I&quot; (or in other words, &quot;who are we as a people&quot;)\n\nAt the time, the Blacks had books on the history of their race as did the Jews.  These books were prominently displayed and received constant publicity from the media.., and were distributed widely.\n\nSome of the parents of these children asked about buying similar history books of the white race so that they could be distributed to our own people in like manner.\n\nImagine their shock to find that almost all the wonderful history books on our race had disappeared.  There were virtually none.., in any of the bookstores!  Or, as they soon discovered.., anywhere else in the country!\n\nThere were books on the Chinese race, the Jewish, Negro, Indian, and Eskimo races, but almost nothing about their own white race.\n\nIt is now obvious to everyone.., that books dealing with Caucasians have been censored from the book shelves.., and this condition has continued for the last 50 years.\n\nUntil the day comes when we Whites have the right to study the history of our own race.., just as others study theirs.., it is hoped that this documentary will continue to help fill the void.\n\nThis is a 60 minute documentary video explaining by way of both Bible AND Secular history the origins of the Caucasian race.\n\nThe first 30 minutes is Pastor Peter J. Peters explaining the proofs and signs (or marks if you may) of the origins of the people of the Old Testament, and who they are today.  The second half, is archeologist  E. Raymond Capt, explaining the same proofs, but from a scientific and secular point of view, along with many pictorial slides and maps of the migrations (giving names and places) of these same people.\n\nWatch this video.., and then PASS IT ON !!!\n","torrent":{"xt":"urn:btih:fb838473d6fffc10a09cfc1066a25586c7ed4cdd","amp;dn":"Roots+-+From+Abraham+to+America+%28Peter+Peter+Raymond+Capt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb838473d6fffc10a09cfc1066a25586c7ed4cdd","infoHashBuffer":{"type":"Buffer","data":[251,131,132,115,214,255,252,16,160,156,252,16,102,162,85,134,199,237,76,221]},"announce":[],"urlList":[]}}