{"title":"The Saboteur  castellano","uid":6235876,"size":7572997100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fc5ed1381dedbac61eed1f19243cc6639e3aae2f&amp;dn=The+Saboteur++castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alforo","files":10,"time":1299868784,"description":"La historia de Saboteur no se ambientarÃƒÂ¡ en acontecimientos cruciales como el Desembarco de Normandia o La Batalla de BerlÃƒÂ­n sino que se situarÃƒÂ¡ en la Francia ocupada, concretamente en ParÃƒÂ­s, aunque tambiÃƒÂ©n podremos visitar ciertas zonas de Le Havre y Los Alpes. El desarrollo serÃƒÂ¡ totalmente abierto, sin limitaciones de a dÃƒÂ³nde ir o quÃƒÂ© hacer pero con un propÃƒÂ³sito de venganza de un joven ajeno en principio al conflicto.\n\nNuestro protagonista, Sean Devlin, estarÃƒÂ¡ basado en William Grover-Williams, uno de los hÃƒÂ©roes franceses de la ÃƒÂ©poca. Este joven frances desempeÃƒÂ±ÃƒÂ³ un gran papel en la liberaciÃƒÂ³n francesa: aunque corrÃƒÂ­a en las carreras de Grand Prix (de hecho ganÃƒÂ³ dos premios de MÃƒÂ³naco en su Bugatti) y se desentendÃƒÂ­a de la guerra, se uniÃƒÂ³ a la Special Operation Executive (una iniciativa britÃƒÂ¡nica contra las fuerzas del Eje) y consiguiÃƒÂ³ infiltrarse en ParÃƒÂ­s en 1942, ayudando notablemente a la resistencia francesa, aunque un aÃƒÂ±o despuÃƒÂ©s fue capturado y en 1945 ejecutado.\n\nLa ÃƒÂºnica diferencia de William GW y Sean serÃƒÂ¡ la mayor motivaciÃƒÂ³n personal del segundo, impulsado por la muerte de sus familiares y amigos por las fuerzas nazis. No obstante, la mayor peculiaridad del juego no residirÃƒÂ¡ en esta historia de venganza con moral ambigua sino en la forma de presentarla, con ciertas reminiscencias a conocidas pelÃƒÂ­culas como La Lista de Schindler, Inglourious Basterds, Sin City o, dentro del ÃƒÂ¡mbito de los videojuegos, el llamativo Okami, Assassin's Creed, Hitman o en cierto modo a la saga GTA.\n[editar] Personajes\n\nSean Devlin: irlandÃƒÂ©s conductor de carreras de alta velocidad y mecÃƒÂ¡nico (mas tarde saboteador), Sean busca venganza por la muerte de su amigo Jules, asesinado por Kurt Dierker, coronel que en secreto es nazi, quien hizo trampas durante una carrera para ganar, causa su rencor, llevandolo a entrar a una base nazi se encontraba en la ciudad, sin saber que era una peligrosa base nazi y al ser descubierto se piensa (por acto de su amigo jules), que el es un espia britanico, lo que causa la muerte de su amigo y queda involucrado en la guerra contra los naziz en Paris.\n\nKurt Dierker: Aleman Nazi que busca el dominio de Paris, encamuflado como un famoso piloto de carreras, toma rumbo hacia una carrera en la cual esta implicado Sean Devlin, Kurt al ver que Sean le esta ganando, le dispara en la llanta causandole que pierda, involucrando por causas del destino a Sean en la toma de Paris por los Nazis.traduccion al castellano-gracias una vez mas a avelino 1492-alforo-alfrg","torrent":{"xt":"urn:btih:fc5ed1381dedbac61eed1f19243cc6639e3aae2f","amp;dn":"The+Saboteur++castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5ed1381dedbac61eed1f19243cc6639e3aae2f","infoHashBuffer":{"type":"Buffer","data":[252,94,209,56,29,237,186,198,30,237,31,25,36,60,198,99,158,58,174,47]},"announce":[],"urlList":[]}}