{"title":"Un Cerebro Superdotado.(Docu.SATRip.Spanish).","uid":6306551,"size":364765184,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:fd9bdf9119fe78259c581061267ccfe61f83905b&amp;dn=Un+Cerebro+Superdotado.%28Docu.SATRip.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1302356185,"description":"Un Cerebro Superdotado\n\nSufre el Sindrome del Sabio. Es capaz de aprender un idioma a la semana. Puede realizar operaciones matematicas con 100 decimales de cabeza. De hecho, tiene el record de Europa de memorizar los decimales de Pi (mas de 22.000). Bienvenidos al cerebro de Daniel Tammet, un joven con una extraordinaria memoria y una habilidad unica para las matematicas.\n\nEste documental le seguira en un viaje hasta America para encontrarse con los cientificos que aseguran que su asombrosa capacidad es, en realidad, innata a todo ser humano pero que solo algunos -como David- saben potenciarla.\n\nSu historia empezo cuando tenia cuatro anyos y sufrio un ataque epileptico: esto transformo su quimica cerebral y le proporciono la capacidad de la sinestesia, es decir, que se mezclaron las partes del cerebro responsables de las distintas areas de percepcion. Asi, empezo a responder emocionalmente a numeros, a la vez que contemplaba de forma automatica formas y texturas. No se pierdan este asombroso documental en el que seremos testigos de su cita con el sabio mas famoso del mundo: el genio que inspiro a Dustin Hoffman en la pelicula Rain Man. Guardara David la clave para potenciar unas capacidades similares en cientos de seres humanos?\n","torrent":{"xt":"urn:btih:fd9bdf9119fe78259c581061267ccfe61f83905b","amp;dn":"Un+Cerebro+Superdotado.%28Docu.SATRip.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd9bdf9119fe78259c581061267ccfe61f83905b","infoHashBuffer":{"type":"Buffer","data":[253,155,223,145,25,254,120,37,156,88,16,97,38,124,207,230,31,131,144,91]},"announce":[],"urlList":[]}}