{"title":"A History Of Road Racing.avi","uid":6151844,"size":432227328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdb657e4bef1b9a454e8a2461ef3c7f31c39843c&amp;dn=A+History+Of+Road+Racing.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Superakela","files":1,"time":1296904411,"description":"A History of Road Racing is the amazing and action-packed tale of the circuits which have entertained and thrilled motorsport fans for more than a century.\n\nInitially drawing on archive footage and commentary from historians and racing legends such as Geoff Duke, this is a story which begins in the early 1900s and the first ever races, then takes us between the wars and on to the introduction of the now-legendary tracks, like Assen and Spa.\n\nThe DVD then moves onto the early decades of World Championship racing, when purpose-built circuits were in their infancy and recalls the pioneering riders and circuits which were the building blocks of what we know as racing today.\n\nWe travel through the 1960s and 1970s with the help of sporting icons such as John Surtees and Murray Walker, and see how safety became an important issue and many road circuits were abandoned in favour of the modern race tracks.\n\nDespite the changing fashion, some road courses, such as the TT Mountain Course in the Isle of Man and Dundrod in Northern Ireland continued to draw in the crowds, despite losing World Championship status.\n\nAs fans refused to fall out of love with these iconic public road circuits, new race series began. Yet these were difficult times and, as the DVD explains, there was a desperate struggle to keep these tracks alive.\n\nHowever, survive they did, and we share the action as the story continues to the present day and we see how these race tracks survives in these health and safety conscious times.\n\nA History of Road Racing celebrates not just the tracks, but also the riders and the races which made them famous.","torrent":{"xt":"urn:btih:fdb657e4bef1b9a454e8a2461ef3c7f31c39843c","amp;dn":"A+History+Of+Road+Racing.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdb657e4bef1b9a454e8a2461ef3c7f31c39843c","infoHashBuffer":{"type":"Buffer","data":[253,182,87,228,190,241,185,164,84,232,162,70,30,243,199,243,28,57,132,60]},"announce":[],"urlList":[]}}