{"title":"Coast to Coast AM - 2011-01-30 - Electromagnetic Effects &amp; Mysti","uid":6160889,"size":57160117,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ffa05e6cc1d64162345b646935fa91ef593c4709&amp;dn=Coast+to+Coast+AM+-+2011-01-30+-+Electromagnetic+Effects+%26+Mysti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1297208731,"description":"Date: \t01-30-11\nHost: \tJohn B. Wells\nGuests: \tDavid B. Sereda, Howard Bloom\n\nGuest host John B. Wells (email) spoke with scientist, filmmaker and mystic ecologist David Sereda about his latest research on the Earth's pole shift and why the sunrise has been early, the bird die-off, quantum electro-dynamics, and 2012, as well as new children being born with advanced abilities. Pointing out that the human body has an electrical magnetic field, he noted that it can be affected by activity on the sun, as well as energies coming from different parts of the galactic plane, as the Earth moves through it.\n\nA big shift of energy could be coming in 2012 that is going to affect every living thing on the planet, and possibly trigger quakes and other sudden earth changes, he said. The solar system may have entered such a new field of energy on December 22, 2010, which set off a chain of events, including the largest storm ever recorded on Saturn, the strange bird and animal die-offs, and an early sunrise in Greenland (related to a wobble of the Earth and the moving of the magnetic pole), he outlined.\n\nChildren born into the current cosmic energy have new DNA that enables them to talk to angels or with entities on the Other Side, he suggested. Or in some cases, they can even physically pop in and out of dimensions and disappear for a time, he reported. Their higher vibration of consciousness may tie into the idea of the Rapture, with people moving into another dimension. Sereda also shared some of his personal mystical and paranormal experiences such as seeing a ball of light fall into his daughter's head (on a night vision camera), just as his wife was sending a prayer for an angel to protect her.\nEgypt Analysis\n\nFirst hour guest, author Howard Bloom commented on the continuing anti-government protests in Egypt. A number of contingents could be jockeying for power there including the Muslim Brotherhood, Islamic revolutionaries, and a democratic and secular group that would govern similar to Turkey, he detailed.\n\nNews segment guest: Lauren Weinstein\nWebsite(s):\n\n    * lightstreamtechnologies.com\n    * HowardBloom.net\n    * bigbangtango.net\n\nVideo(s):\n\n    * Hope For Humanity\n\nBook(s):\n\n    * Differentials, The Hidden Harmonic Codes of the Universe\n    * The Genius of the Beast: A Radical Re-Vision of Capitalism\n","torrent":{"xt":"urn:btih:ffa05e6cc1d64162345b646935fa91ef593c4709","amp;dn":"Coast+to+Coast+AM+-+2011-01-30+-+Electromagnetic+Effects+%26+Mysti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa05e6cc1d64162345b646935fa91ef593c4709","infoHashBuffer":{"type":"Buffer","data":[255,160,94,108,193,214,65,98,52,91,100,105,53,250,145,239,89,60,71,9]},"announce":[],"urlList":[]}}